import 'dart:ffi';

import 'package:flutter/cupertino.dart';

import 'package:iFix/models/app_model.dart';
import 'package:iFix/models/code_model.dart';

import 'package:iFix/models/item.dart';
import 'package:iFix/models/menu_item_model.dart';

class Constants {
  static List<MenuItemModel> trickesMenuItemlist = [
    MenuItemModel(
      [
        ItemModel(null, 'assets/A.jpg', null),
        ItemModel(
            'اگر گوشی هوشمندتان از صفحه نمایش AMOLED استفاده می‌کند، می‌توانید با انتخاب یک تصویر زمینه تیره کمی در مصرف شارژ باتری صرفه‌جویی کنید. صفحات AMOLED تنها پیکسل‌های رنگی را روشن میکنند و بنابراین برای نمایش دادن رنگ سیاه تنها با خاموش کردن پیسکل‌ها، این کار را انجام میدهند. پس اگر از تصویری تاریک به عنوان پس زمینه گوشی خود استفاده کنید انرژی کمتری برای نمایش دادن آن مصرف خواهد شد. بیشتر گوشی‌های سامسونگ از اینگونه صفحات نمایش بهره‌مند می‌‎باشند، بنابراین اگر از محصولات این برند استفاده می‌کنید، ترفند مذکور برایتان مفید خواهد بود. حتی اگر از گوشی‌های هوشمندی با صفحه نمایش معمولی استفاده می‌کنید باز هم استفاده از تصاویر پس زمینه ساده به جادی والپیپرهای زنده یا همان لایو، می‌تواند در بهبود طول عمر باتری مؤثر باشد. والپیپرهای زنده به واسطه انیمیشن‌هایی که در خود دارند نسبت به تصاویر ثابت به مراتب انرژی بیشتری مصرف می‌کنند.',
            null,
            '1- والپیپرهای زنده را رها کنید و از تصاویر پس زمینه تیره استفاده نمایید'),
        ItemModel(
            'برای اینکه مصرف شارژ گوشی خود را بهینه کنید نیازی نیست تا حتماً به سراغ اپلیکیشن‌های شخص ثالث بروید، زیرا خود سیستم عامل اندرودید ویژگی جالبی به نام Battery Saver دارد که به کمک آن می‌توایند مدیریت بهتری بر روی مصرف شارژ باتری داشته باشید. تنها کاری که باید بکنید این است که با مراجعه به تنظیمات گوشی گزینه مربوط به این ویژگی را فعال نمایید. با فعال کردن Battery Saver عملکرد و روشنایی صفحه نمایش گوشی محدود خواهد شد تا طول عمر باتری افزایش یابد.شما می‌توانید در مواقع نیاز این ویژگی را به صورت دستی فعال کنید و یا اینکه آن را طوری تنظیم نمایید که با کاهش شارژ باتری به زیر 15 درصد، به صورت خودکار فعال شود.',
            null,
            '2- از Battery Saver استفاده کنید'),
        ItemModel(
            'اگر سری به فروشگاه‌هایی مانند گوگل پلی زده باشید، حتماً با خیل عظیم برنامه‌هایی که ادعای بهینه‌سازی مصرف شارژ گوشی را دارند مواجه شده‌اید. متأسفانه بیشتر این برنامه نه تنها تأثیر چندان مثبتی بر روی طول عمر باتری گوشی ندارند، بلکه به نوبه خود باعث اشغال فضای رم و مصرف شارژ باتری می‌شوند! اما در این بین استثناهایی هم وجود دارند و Greenify یکی از این استثناهاست. تقریباً به تمام وعده‌هایی که می‌دهد عمل می‌کند و با متوقف کردن موقتی برنامه‌های فعال در پس‌زمینه سیستم عامل، مانع استفاده بیش از حد از منابع دستگاه مانند حافظه رم و شارژ باتری، می‌شود. شایان ذکر است با وجود اینکه Greenify برای اجرا نیازی به روت شدن دستگاه ندارد اما برای استفاده از تمامی قابلیت‌ها و پتانسیل بالای آن، گوشی شما باید روت شده باشد.',
            null,
            '3- Greenify، یک مدیریت کننده خوب باتری برای گوشی‌های اندرویدی'),
        ItemModel(
            'به گزارش پارس ناز اجرای خودکار برنامه‌های مختلف و تغییر تنظیمات گوشی بدون نیاز به دخالت کاربر، به طور قابل ملاحظه‌ای می‌تواند در افزایش طول عمر باتری مؤثر باشد. برنامه‌هایی مانند IFTTT و یا Tasker جزو بهترین مواردی هستند که می‌توانید برای رسیدن به این هدف از آن‌‌ها استفاده نمایید. IFTTT که مخفف عبارت If This, Then That می‌باشد قادر است تا بسیاری از کارها را به صورت خودکار در گوشی شما انجام دهد. نصب این برنامه اصلاً پیچیدگی خاصی ندارد و پس از نصب بالافاصله قابل استفاده خواهد بود.به عنوان مثال به کمک IFTTT می‌توانید گوشی خود را طوری برنامه‌ریزی کنید که با خروج از محل کار، وای فای گوشی خاموش شده و با رسیدن به خانه دوباره روشن و قابل استفاده شود و یا اینکه در ساعات خواب شما گوشی به حالت پرواز تغییر وضعیت داده و صبح دوباره به حالت عادی بازگردد. کارهای زیادی وجود دارد که با کمک این اپلیکیشن فوق العاده می‌توانید انجام دهید و تمامی این موارد ریز و درشت در کاهش مصرف شارژ باتری تأثیر به سزایی خواهند داشت.Tasker نیز برنامه‌هایی مشابه با IFTTT است که البته از کنترل‌های بیشتر و گزینه‌های دقیق‌تری برخوردار می‌باشد. البته برای استفاده از قابلیت‌های بالای این اپلیکیشن باید اطلاعات کمی نیز از برنامه‌نویسی داشته باشید و در نگاه اول ممکن است کار کردن با Tasker کمی پیچیده به نظر بیاید. اما اگر کمی با این برنامه و قابلیت‌های آن آشنا شوید خواهید دید کارهای بسیار زیادی وجود دارند که می‌توانید با گوشی هوشمند خود انجام دهید. Tasker نیز همانند IFTTT در گوشی‌های روت شده کارایی به مراتب بیشتری دارد.',
            null,
            '4- گوشی خود را هوشمندتر از همیشه کنید!'),
        ItemModel(
            'با مراجعه به تنظیمات گوشی و بخش مربوط به باتری می‌توانید لیست برنامه‌هایی که بیشترین مصرف شارژ را دارند مشاهده کرده و در صورت امکان از نسخه‌های سبک‌تر آن‌ها استفاده کنید. به عنوان مثال اپلیکیشن فیسبوک به سایز بالا و مصرف زیاد رم و شارژ باتری مشهور است و بنابراین برای صرفه‌جویی در مصرف انرژی باید به سراغ نسخه سبک‌تری از آن رفته و یا اینکه تنها از طریق مرورگر اینترنت گوشی وارد اکانت فیسبوک خود شوید. اگر برنامه مورد نظر شما نسخه سبک‌تری نداشت در این صورت بهتر است به فکر پیدا کردن یک جایگزین برای آن باشید.غیرفعال کردن اتصالاتی مانند وای فای و مکان یاب (GPS) تأثیر زیادی بر مصرف بهینه باتری دارد. حتی غیرفعال کردن همگام‌سازی‌های خودکار و همچنین اعلان‌های غیرضروری نیز می‌تواند در افزایش طول عمر باتری کاملاً مؤثر باشد.',
            null,
            '- از اپلیکیشن‌ها و اینترنت گوشی، هوشمندانه استفاده کنید'),
        ItemModel(
            'همان طور که در ابتدای مطلب هم اشاره کردیم، ما به عنوان یک کاربر عادی برای افزایش طول عمر باتری کار خاصی نمی‌توانیم انجام دهیم و استفاده درست و بهینه از آن تنها کاری است که از دستمان برمی‌آید. در کنار تمام مواردی که در بالا اشاره کردیم، ترک برخی عادت‌های نادرست و نامناسب نیز می‌تواند در استفاده طولانی مدت‌تر از گوشی مؤثر باشد. به عنوان مثال برخی از کاربران عادت دارند مدام با گوشی خود بازی کرده و حتی وقتی که کاری با آن ندارد، قفل آن را باز می‌کنند، صفحات را به چپ و راست می‌کشند و دوباره آن را قفل می‌کنند! چنین کارهایی با اینکه در نگاه اول جزئی به نظر می‌رسند اما اگر تبدیل به عادت شده و در طول روز تکرار شوند، می‌توانند بخش قابل ملاحظه‌ای از شارژ باتری را مصرف نمایند.',
            null,
            'سخن پایانی'),
      ],
      "ترفندهای کاهش میزان مصرف باتری اندروید",
    ),
    MenuItemModel([
      ItemModel(
          'برخی اوقات باید تماس بگیریم اما نباید طرف مقابل شماره ما را مشاهده کند و برای این کار راه هایی وجود دارد مانند نصب نرم افزارهای مختلف برای تماس ناشناس. شماره های یکبار مصرف فقط برای جاسوسی نیست بلکه می تواند کاربردهای زیادی داشته باشد. به عنوان مثال وقتی دوست ندارید شماره همراهتان را به فروشگاه های آنلاین بدهید یا خیلی موارد دیگر… بنابراین خیلی کارها هست که می توانید با این شماره ها انجام دهید. هم ارزان هستند و هم پرکاربرد. علاوه بر این شماره ها یکسری اپلیکیشن ها هم هستند که می توانند شماره شما را هنگام تماس مخفی کنند. این برنامه ها یکسری قابلیت های دیگر هم دارند. مثلا پیام هایی که می فرستید بعد از خواندن گیرنده حذف می شود یا می توانید چند شماره را با هم بگیرید. اکنون از میان این برنامه پرکاربردترین شان را معرفی کرده ام که هم برای اندروید و هم برای آیفون قابل استفاده هستند.',
          null,
          'نرم افزارهایی برای تماس ناشناس '),
      ItemModel(
          'این اپلیکیشن طراحی بسیار زیبا و جذابی دارد و می توانید در آن کد ۴۰ کشور را به عنوان شماره های جایگزین وارد کنید. این برنامه از شبکه وای فای برای تماس ها استفاده می کند. بنابراین هیچ هزینه بالایی برای تماس های راه دور نخواهد داشت. یک بخش مستقلی هم دارد به نام voicemail. این اپلیکیشن هم برای اندروید و هم برای آیفون قابل استفاده است. هم می توانید این اپ را به صورت رایگان ۳ روزه استفاده کنید و هم برای یک شماره خصوصی هزینه بدهید.',
          null,
          'Hushed'),
      ItemModel(null, 'assets/65.jpg', null),
      ItemModel(
          'این اپلیکیشن طراحی و ظاهر ساده ای دارد و به شما اجازه می دهد با شماره پرایویتی که انتخاب کرده اید تماس گرفته و پیام بدهید. بهترین قسمت برنامه برنر این است که می توانید شماره خود را بسوزانید. بنابراین می توانید آن را کنار گذاشته و یک شماره جدید برای خود انتخاب کنید. این اپلیکیشن را می توانید هم به صورت رایگان برای مدت محدود استفاده کنید و هم برای دسترسی به امکانات بیشتر آن هزینه کنید. برنر به شما این اجازه را می دهد که شماره خود را به اپلیکیشن هایی چون اورنوت (Evernote)، اسلک (Slack)، دراپ باکس (Dropbox) و SoundCloud متصل کنید.',
          null,
          'Burner'),
      ItemModel(null, 'assets/66.jpg', null),
      ItemModel(
          'این اپلیکیشن علاوه بر گوشی های اندروید و آیفون روی مک، ویندوز، آمازون فایر، آیپد و اپل واچ هم نصب می شود. هم می توانید به صورت ۷ روزه رایگان از آن استفاده کنید و هم جهت استفاده های مختلف در دوره های مختلف آن را خرید کنید. البته ناگفته نماند که از نسخه رایگان این اپ می توانید تنها با کسانی که این اپ را دارند تماس برقرار کنید.',
          null,
          'Line2'),
      ItemModel(null, 'assets/67.jpg', null),
      ItemModel(
          'این هم یکی دیگر از اپ هایی است که می توانید به صورت رایگان با شماره های بیش از ۲۰۰ کشور تماس داشته باشید. با نسخه رایگان این اپ فقط می توانید با کسانی که اپلیکیشن های TextMe Up و TextMe را در گوشی نصب شده دارند ارتباط برقرار کنید اما اگر می خواهید از امکانات بیشتر این اپ و با شماره های مخفی تماس برقرار کنید باید بابت خرید آن هزینه کنید.',
          null,
          'TextMe Up'),
      ItemModel(null, 'assets/68.jpg', null),
    ], 'نرم افزارهایی برای تماس ناشناس '),
    MenuItemModel([
      ItemModel(null, 'assets/69.jpg', null),
      ItemModel(
          'شما می توانید موبایل خود را با یک ترفند که معرفی خواهیم کرد به یک کنترل تبدیل کنید و انواع دستگاه ها را با موبایل خود هدایت و کنترل کنید. نرم افزار Galaxy Universal Remote با استفاده از فرستنده IR دستگاه اندروید، گوشی شما را به یک کنترل از راه دور تبدیل می کند؛ بدون نیاز به هیچ سخت افزار خارجی و بدون نیاز به اتصال اینترنت. توسط این برنامه می توانید تلویزیون، ست تاپ باکس، آمپلی فایر، پخش کننده DVD، Air Conditioner، پخش کننده Blu-ray، پروژکتور، دوربین DSLR، کنسول PS3، کنسول Xbox و … خود را کنترل کنید. با دوستان خود شوخی کنید، با این کنترل از راه دور کاربر پسند، هر چیزی را که می خواهید کنترل کنید.',
          null,
          'تبدیل موبایل به یک کنترل با این ترفند'),
      ItemModel(
          'ذخیره هر یک از دستگاه ها برای دسترسی آسان به آن در زمان دیگر کنترل تمام دستگاه های خود فقط از یک صفحه، با ایجاد کنترل سفارشی خود، که در آن می توانید دکمه ها را با یک لمس ساده از دستگاه های مختلف اضافه کنید! سفارشی کردن کنترل از راه دور خود با تغییر تعداد زبانه ها، طرح، رنگ ها، سبک هر دکمه و … ذخیره دنباله ای از کارها(ماکرو) برای انجام شدن یک به یک. برای مثال شما می توانید تلویزیون خود را روشن کنید، جعبه کابل را روشن کنید، یک ثانیه صبر کنید، به کانال 100 بروید و صدا را زیاد کنید. همه این اقدامات در یک دکمه ذخیره می شود. شما می توانید کد IR خود را ارسال کنید و آن را در یک دکمه ذخیره نمایید.',
          null,
          'ویژگی ها:'),
    ], 'تبدیل موبایل به یک کنترل با این ترفند '),
    MenuItemModel([
      ItemModel(null, 'assets/E.jpg', null),
      ItemModel(
          'استفاده بهینه از حافظه تلفن همراه می تواند باعث بهبود عملکرد و افزایش سرعت دستگاه شود. ما به شما راه هایی را برای افزایش دادن حافظه تلفن همراه معرفی می کنیم. در این مطلب سعی می شود تا با ذکر ترفندی نحوه افزایش فضای ذخیره سازی در گوشی های آیفون را به شما ارائه دهیم.کمبود حافظه در گوشی های آیفون همواره از جمله مشکلاتی است که کاربران با آن مواجه هستند. ما در این خبر سعی داریم ترفندی را به کاربران گوشی های آیفون آموزش دهیم تا از شر کمبود فضا در گوشی های خود خلاص شده و مقدار زیادی از فضای اشغال شده توسط فایل های اضافی را آزاد کنند بدون آنکه بخواهند فیلم و عکسی از گوشی خود پاک کنند.',
          null,
          'ترفندهای افزایش دادن حافظه تلفن همراه '),
      ItemModel(
          'افزایش فضای ذخیره سازی در گوشی های آیفون به گزارش پارس ناز نکته قابل توجه اینجاست که اگر شما از Photo Library آی کلود روی آیفون خود استفاده می کنید،درنتیجه گوشی آیفون شروع به آپلود عکس ها به iCloud و حذف آن ها از خود گوشی می کند بعد از این کار شما دانلود را متوقف کنید و در نهایت اگر کلا فایل شما دانلود شده بود ، برنامه دانلود شده را حذف کنید. به این ترتیب حدود 1 گیگا بایت فضای آزاد برای شما فراهم می شود.در ابتدا اقدام به دانلود فایلی با حجم بالا  کنید، در این هنگام سیستم عامل گوشی شما تشخیص می دهد که فضای کافی برای ذخیره سازی آن فایل وجود ندارد و در نتیجه شروع به پاکسازی فایل ها و موارد اضافی گوشی شما(Junk Files) می کند.',
          null,
          'روش کار'),
      ItemModel(null, 'assets/F.jpg', null),
    ], 'ترفندهای افزایش دادن حافظه تلفن همراه'),
    MenuItemModel([
      ItemModel(null, 'assets/72.jpg', null),
      ItemModel(
          'وقتی رمزهای وای فای مربوط به دستگاه های متفاوت را در گوشی خود هنگام اتصال ذخیره می کنیم,رمزهای ورود نیز ذخیره خواهند شد. نرم‌افزارها و روش‌های متعددی برای استخراج رمزهای شبکه‌های وایرلس ذخیره شده در سیستم‌عامل ویندوز وجود دارد، اما این روزها بسیاری از کاربران با استفاده از تلفن همراه و تبلت خود به بسیاری از شبکه‌های وای‌فای متصل می‌شوند و ممکن است به‌دلیل فراموش کردن رمز اتصال به وای‌فای، نیازمند استخراج این رمزها از دستگاه هوشمند خود باشند.آیا می‌دانید تمام رمزهای مربوط به اتصال وای‌فای در دستگاه‌های هوشمند مجهز به سیستم‌عامل اندروید در یک فایل ذخیره شده و براحتی قابل مشاهده است؟ دوست دارید استفاده از این ترفند را همین حالا تجربه کنید؟ پس از کسب اطمینان از روت بودن دستگاه، با مراجعه به یکی از لینک‌های زیر اپلیکشن ES File Explorer را دانلود و روی دستگاه خود نصب کنید. http://tiny.cc/click_esfile2 اپلیکیشن را اجرا کرده و پس از مراجعه به منوی اصلی آن از بخش Tools کلید مقابل گزینه Root Explorer را فعال کنید. دوباره به منوی اصلی مراجعه کرده و از بخش Local روی Device فشار دهید سپس از فهرست پوشه‌های به‌نمایش درآمده به Data مراجعه کرده، روی Misc فشار داده و در نهایت وارد پوشه Wi-fiشوید.در پوشه فایل wpa_supplicant.conf قابل مشاهده است. روی آن فشار داده و از فهرست اپلیکیشن‌های به‌نمایش درآمده برای اجرای این فایل، ES Note Editor را انتخاب کنید. همان‌طور که مشاهده می‌کنید فهرستی از مجموعه شبکه‌های وای‌فای ذخیره شده در دستگاه شما شامل نام شبکه، رمز اتصال و نوع رمزنگاری براحتی قابل مشاهده، کپی یا ذخیره‌سازی هستند.',
          null,
          'چگونه رمزهای وای فای را از گوشی اندرویدی بدست آوریم؟ '),
    ], 'چگونه رمزهای وای فای را از گوشی اندرویدی بدست آوریم؟ '),
    MenuItemModel([
      ItemModel(null, 'assets/G.jpg', null),
      ItemModel(
          'برای شما راهکار بسیار عالی داریم که مهیج و سرگرم کننده است، شما می توانید کیبورد گوشی خود را به طور موزیکال استفاده کنید. اندروید یک سیستم اجرایی قابل تنظیم است که گاهی اوقات از این ویژگی برای قابلیت های اصلی و هسته ای بکار می بریم و گاهی اوقات هم برای سرگرمی . یکی از تنظیماتی که در این جا معرفی کرده ام تبدیل کیبورد اندروید به ابزار موسیقی است به طوری که با تایپ کردن هر کدام از کلیدها صدای متفاوتی می دهد. واقعا سرگرم کننده است. در این جا به شما یاد می دهم که چگونه این کار را انجام دهید. اپلیکیشن Keyusic را دانلود و نصب کنید برای این که کیبورد اندروید را به ابزار موسیقی تبدیل کنید ابتدا اپلیکیشن Keyusic را دانلود و نصب کنید',
          null,
          'ترفند موزیکال کردن کیبورد گوشی اندرویدی '),
      ItemModel(null, 'assets/H.jpg', null),
      ItemModel(
          'بعد از نصب، برنامه را باز کنید و دکمه مقابل گزینه Start up را فعال کنید. از اینجا به بعد باید سرویس دسترس پذیری اپلیکیشن را فعال کنید. برای این کار روی گزینه Show the Settings تب کنید و از لیستی که نمایش داده شده Keyusic را انتخاب کنید. سپس کلیدی که در بالای صفحه قرار دارد را فعال کنید و در آخر OK را انتخاب کنید.',
          null,
          null),
      ItemModel(null, 'assets/I.jpg', null),
      ItemModel(
          'وقتی سرویس دسترس پذیری فعال شد دوباره برنامه Keyusic را باز کنید و یک بار دیگر روی دکمه مقابل گزینه Start up تب کنید. در این جا ۲ آپشن دارید. یا روی دکمه مثبت در پایین صفحه تب کنید و اپلیکیشن های خاصی که می خواهید این برنامه را در آن ها به کار ببرید انتخاب کنید و یا این که گزینه Global activation را فعال کنید. تا بتوانید کیبورد موزیکال را در تمام برنامه های گوشی استفاده کنید.',
          null,
          null),
      ItemModel(null, 'assets/K.jpg', null),
      ItemModel(
          'وارد گزینه Experimenting در برنامه شوید. در این جا می توانید کیبورد را امتحان کنید. پس در این جا با تنظیمات پیش فرض آن را امتحان کنید. اگر دوست نداشتید می توانید یک ابزار موسیقی دیگر از لیستی که به شما نشان می دهد انتخاب کنید. در این جا می تنظیمات دیگری هم وجود دارد که می توانید با استفاده از آن ها صدای کیبورد را بلند یا کم کنید یا نت های آن را تغییر دهید. با این تنظیمات بازی کنید تا به نتیجه دلخواه تان برسید.',
          null,
          null),
      ItemModel(null, 'assets/L.jpg', null),
      ItemModel(
          'از این جا به بعد کیبورد شما هنگام تایپ موزیکال می شود. سطح صدای کلیدها بستگی به صدای سیستم پخش کننده موسیقی گوشی تان دارد. بنابراین می توانید آن را کم یا زیاد کنید. هر کدام از دکمه ها نت متفاوتی را اجرا می کند پس هر کلمه ای که تایپ می کنید مثل یک فرمول هنری خواهد بود.',
          null,
          null),
    ], 'ترفند موزیکال کردن کیبورد گوشی اندرویدی'),
    MenuItemModel([
      ItemModel(null, 'assets/M.jpg', null),
      ItemModel(
          'بسیاری از اوقات ما نیاز داریم تا مکالمات تلفنی خود را ضبط کنیم که برای همه سیستم عامل ها می توان این کار را به راحتی انجام داد. با چند روش ساده بر اساس سیستم عاملی که گوشی همراهتان پشتیبانی می کند می توانید تماس های تلفنی را ضبط کنید. ضبط مکالمات تلفنی ممکن است برای هر فردی با توجه به نوع نیازش از اهمیت برخودار باشد، این کار با نرم افزارهای مختلفی که در مارکت ها وجود دارد امکان پذیر است و شما با دسترسی به چند برنامه کاربردی می توانید به آنچه مدنظر دارید با توجه به نوع سیستم عامل موبایل خود، برسید. دارندگان سیستم عامل ios به دلیل امنیتی که سیستم برای موبایل طراحی کرده امکان ضبط خودکار را ندارند اما می توانید با JailBreak کردن (عملی که موجب می شود شما به فایل های سیستمی موبایل خود دسترسی داشته باشید) و استفاده از توئیک ها (بسته های نرم افزاری که در موبایل تغییرات ظاهری یا سیستمی ایجاد می کند) مانند iOS Call Recorder یا AudioRecroder 2 به ضبط مکالمات تلفنی در آیفون بپردازید. اگر از سیستم عامل ویندوز فون استفاده می کنید در قسمت سیستم تنظیمات گوشی phone را انتخاب کنید سپس وارد Default apps و Voice recorder شوید، پس از انتخاب Voice recorder در زمان مکالمه گزینه record فعال می شود و با لمس آن می توانید تماس های تلفنی را ضبط کنید. اگر سیستم عامل شما ویندوز 10 باشد ویژگی ضبط تماس به صورت پیش فرض برای شما فعال است و نیاز به طی مراحل یاد شده ندارید.در سیستم عامل اندروید نیز این کار به راحتی انجام می شود مگر در برخی از مدل های تلفن همراه که نوعه پردازنده آن امکان ضبط تلفن وجود ندارد، به دلیل اینکه اندروید طرفداران بسیاری دارد به راحتی بدر مارکت های اندروید نرم افزارهای ضبط تماس را خواهید یافت اما پیشنهاد می شود نرم افزار ACR را نصب کنید. ویژگی این نرم افزار فهرست کردن تماس های ضبط شده به ترتیب تاریخ است و می توانید به راحتی هر کدام از تماس ها را که نیاز دارید مجدد گوش دهید و حتی آن را به اشتراک بگذارید.',
          null,
          'ترفندهای ضبط مکالمه های تلفنی اندروید و آیفون '),
    ], 'ترفندهای ضبط مکالمه های تلفنی اندروید و آیفون'),
    MenuItemModel([
      ItemModel(null, 'assets/O.jpg', null),
      ItemModel(
          'رعایت نکات مهم امنیتی در آیفون منجر به این شده تا سرقت این موبایل عملا کاری بی فایده به نظر برسد چراکه که فقط صاحب آن می‌تواند بهره گیری خوب از آن داشته باشد.گاهی اوقات ممکن هست شما با دردسر گم شدن یا دزدیه شدن تلفن همراه آیفون خود که اطلاعات شخصی و مهم زیادی بر روی ان دارید روبرو شوید . به گزارش پارس ناز گم کردن یا دزدیده شدنگوشی اتفاق ناگواری هست که برای هرکسی احتمال پیش آمدن‌اش وجود دارد. با راهکار هایي که امروز آموزش می‌دهیم قصد داریم تا اگر چنین اتفاقی برای شما رخ داده هست، بتوانید موبایل خود را روی نقشه پیدا کنید یا اگر چنین اتفاقی پیش نیامده هست، بتوانید شانس پیدا کردن تلفن همراه خود را در شرایط گمشدن آن بالا ببرید.',
          null,
          'ترفند ردگیری گوشی آیفون پس از سرقت '),
      ItemModel(
          "کابران آیفون میتوانند با بهره گیری از قابلیت Find My iPhone تلفن همراه گمشده خود را پیدا کنند. از ویژگی هاي این قابلیت میتوان؛ قفل کردن موبایل از راه دور، ارسال پیام روی صفحه موبایل، به صدا در آمدن موبایل، حذف اطلاعات، دیدن تلفن همراه روی نقشه و… را نام برد. نکته قابل دقت این هست که قابلیت ردیابی فقط در صورتی ممکن هست که Find My iPhone را روی تلفن همراه فعال کرده باشید.",
          null,
          'آموزش کار با Find My iPhone'),
      ItemModel(
          'به لینک روبرو بروید: icloud.com/find حالا مشخصات اپل آیدی خود را وارد کنید به قسمت Find My iPhone بروید و اگر بیش از یک دستگاه با این اپل آیدی دارید، دستگاه مورد نظر خود را انتخاب کنید. اکنون باید محل موبایل شما روی نقشه نمایش داده شود. اگر تلفن همراه در نزدیکی شما بود، با انتخاب انتخاب Play Sound صدایی از موبایل اکران می‌شود تا بتوانید آن را پیدا کنید. شما میتوانید با انتخاب انتخاب Lost Mode تلفن همراه خود را قفل کنید .اگر اطلاعات مهمی در تلفن همراه خود دارید و موبایل خود را پیدا نکردید می‌توانید با انتخاب انتخاب Erase iPhone آیفون خود را از راه دور پاک کنید. دقت کنید که با انجام اینکار، تمام اطلاعات و تنظیمات موبایل شما پاک خواهد شد و دیگر حتی تلفن همراه خود را نیز نمیتوانید پیدا کنید',
          null,
          'برای پیدا کردن موبایل گمشده خود ابتدا:'),
    ], 'ترفند ردگیری گوشی آیفون پس از سرقت '),
    MenuItemModel([
      ItemModel(
          'در این ترفند قصد داریم به معرفی چندین کد مخفی و کاربردی جهت استفاده در گوشی های تلفن همراه بپردازیم. با بهره گیری از این کدها میتوانید بدون وارد شدن به بخش تنظیمات گوشی فرامین مختلفی را صادر کنید. هم اکنون به معرفی این کدها خواهیم پرداخت. کدهای زیر را از جهت (<—) و به وسیله دکمه های شماره گیر گوشی وارد نمایید: شماره تلفن مورد نظر*21** = انتقال مکالمه تلفنی از تلفن همراه به تلفن ثابت. *43#* = فعال کردن پشت خطی. 7370* = ریست کردن ( پاک کردن) تنظیمات نرم افزاری گوشی. #شماره مورد نظری که تلفن به آن منتقل میشود*61** = در صوت عدم پاسخگویی از جانب شما ، شماره منتقل میشود. #62#* = در صورتی که شما در دسترس نباشید (خارج از محدوده باشید) شماره منتقل میشود.',
          null,
          'کد مخفی و کاربردی گوشی'),
    ], 'کد مخفی و کاربردی گوشی'),
    MenuItemModel([
      ItemModel(null, 'assets/P.jpg', null),
      ItemModel(
          'شما می توانید در اندورید نیز مانند ویندوز چندین برنامه را همزمان در حالت اجرا نگه دارید و از آن ها استفاده نمایید که کاربرد مفیدی می باشد. یکی از پیشرفت هایی که سیستم عامل اندروید نوگات 7 داشته است قابلیت مالتی تسکینگ آن است که قابل توجه ترین آنها مالتی ویندوز بودن آن است. این یعنی تمام اندرویدها میتوانند از یک رابط تقسیم صفحه نمایش استفاده کنند. بنابراین تمام توسعه دهندگان اپلیکیشن میتوانند برنامه هایی با قابلیت تقسیم صفحه عرضه کنند که روی تمام گوشی ها و تبلت های اندروید قابل اجرا باشد. یکی از این اپلیکیشن ها که به شما اجازه می دهد دو پنجره را در یک زمان با هم باز کنید برنامه Screens – Multi Window Manager است که در زیر نحوه کاربرد آن توضیح داده شده است. ابتدا اپلیکیشن را دانلود کرده و نصب کنید.',
          null,
          'ترفند اجرای همزمان برنامه ها در اندروید'),
      ItemModel(null, 'assets/Q.jpg', null),
      ItemModel(
          'بعد از نصب برنامه به منوی اصلی تنظیمات گوشی بروید و وارد گزینه Accessibility شوید. در صفحه ای که باز می شود روی گزینه Screens تب کنید. و در پنجره نمایش داده شده گزینه OK را انتخاب کنید.',
          null,
          null),
      ItemModel(null, 'assets/R.jpg', null),
      ItemModel(
          'به گزارش پارس ناز اپلیکیشن را باز کنید. در ابتدا دو دکمه “+” در بالای صفحه میبینید. دکمه + بالایی برای پنجره ای است که در بالای صفحه مالتی تسکینگ باز میشود و دکمه + پایینی برای پنجره ای است که در پایین باز میشود. روی هر کدام از دکمه ها تب کنید و برنامه های مورد نظرتان را انتخاب کنید. بعد از انجام این کار نامی برای شورت کات مالتی ویندوز انتخاب کنید. و در آخر گزینه Create Shortcut را بزنید. بلافاصله شورت کات در صفحه هوم گوشی ساخته میشود.',
          null,
          null),
      ItemModel(null, 'assets/S.jpg', null),
      ItemModel(
          'از این به بعد هر وقت خواستید دو برنامه را با هم باز کنید روی آیکونی که در صفحه هوم ساخته اید تب کنید. اگر گوشی در حالت عمودی باشد یکی از پنجره ها بالا و دیگری در زیر باز میشود. اما اگر گوشی در حالت افقی باشد یکی از پنجره ها در سمت راست و دیگری در سمت چپ باز میشود.',
          null,
          null),
      ItemModel(null, 'assets/T.jpg', null),
      ItemModel(
          'بهترین کاربرد این برنامه زمانی است که میخواهید از برنامه چت و مرورگر همزمان استفاده کنید. چون به راحتی می توانید لینک ها را کپی و پیست کنید.',
          null,
          null),
    ], 'ترفند اجرای همزمان برنامه ها در اندروید'),
    MenuItemModel([
      ItemModel(null, 'assets/U.jpg', null),
      ItemModel(
          'برای صفحه کلید گوگل در اندروید شما می توانید بخش اعداد را به قسمت بالایی کیبورد اضافه نمایید تا بهتر کار کنید. اگر شما نیز به مانند بسیاری از کاربران اندروید از کیبورد گوگل به عنوان صفحه‌کلید پیش‌فرض گوشی یا تبلت خود استفاده می‌کنید حتماً می‌دانید که برای تایپ اعداد نیاز است که کلید مخصوص اعداد را لمس کرده و از پد اعداد برای تایپ عدد استفاده کنید. اما دیگر نیازی به این کار نیست، چرا که می‌توانید با استفاده از این ترفند به آسانی ردیف اعداد را به بالای صفحه‌کلید اضافه کنید. هم‌اکنون به معرفی این ترفند می‌پردازیم.ابتدا وارد Settings و بخش Language & Input شوید.',
          null,
          'ترفند عالی برای کیبورد گوگل در اندروید'),
      ItemModel(null, 'assets/V.jpg', null),
      ItemModel(
          'افزودن ردیف اعداد به بالای کیبورد اکنون در زیر قسمت Input Method، گزینه‌ی Google Keyboard را لمس کنید.',
          null,
          null),
      ItemModel(null, 'assets/z.jpg', null),
      ItemModel(
          'این کار صفحه‌ی تنظیمات کیبورد گوگل را باز می‌کند. اکنون Preferences را لمس کنید. لازم به ذکر است در برخی از دستگاه‌ها نیاز است که به جای Preferences، گزینه‌ی Appearance & Layouts را لمس کنید.',
          null,
          null),
      ItemModel(null, 'assets/Z1.jpg', null),
      ItemModel(
          'آموزش کار با کیبورد گوگل در مرحله‌ی بعدCustom input styles را انتخاب کنید.',
          null,
          null),
      ItemModel(null, 'assets/z3.jpg', null),
      ItemModel('حالا آیکن به‌علاوه را لمس نمایید.', null, null),
      ItemModel(null, 'assets/z4.jpg', null),
      ItemModel(
          'سپس در قسمت Language زبان دلخواه خود را انتخاب کرده و در قسمت Layout، گزینه‌ی PC را انتخاب کنید و دکمه‌ی Add را لمس کنید.',
          null,
          null),
      ItemModel(null, 'assets/z5.jpg', null),
      ItemModel(
          'اکنون از شما در خصوص فعال‌سازی این چینش جدید سوال می‌شود که بایستی Enable را انتخاب کنید.',
          null,
          null),
      ItemModel(null, 'assets/z6.jpg', null),
      ItemModel(
          'در صفحه‌ی بعدی Use system language را غیرفعال کرده و چینش جدید خود که به (PC) ختم می‌شود را فعال نمایید و دیگر موارد را غیرفعال کنید',
          null,
          null),
      ItemModel(null, 'assets/z7.jpg', null),
      ItemModel(
          'اکنون این چینش جدید صفحه‌کلید گوگل که با ردیف اعداد در بالای آن همراه است برای شما فعال شده است.برای بازگردانی به حالت اولیه نیز کافی است به Settings -> Language & Input -> Google Keyboard -> Languages مراجعه کرده و Use system language را فعال کنید.',
          null,
          null),
    ], 'ترفند عالی برای کیبورد گوگل در اندروید '),
    MenuItemModel([
      ItemModel(null, 'assets/1.jpg', null),
      ItemModel(null, null, 'ترفندهای کاربردی عکاسی با موبایل به صورت حرفه ای'),
      ItemModel(
          'اکنون روی دوربین موبایل ها به دلیل استفاده گسترده مردم،حساسیت زیادی است اما باید بدانیم که ترفندهای عکاسی هم در گرفتن عکس خوب تاثیرگذار است. به تازگی در مورد عکاسی با گوشی همراه صحبتی با یکی از دوستانم داشتم. او می گفت این روزها از هر کسی می پرسم چطور با گوشی همراهم عکس های بهتری بگیرم شروع به فلسفه بافی می کند و حرف های قلنبه سلمبه ای می زند که به جای اینکه علاقه مندم کند کاملا نا امیدم می کند. چرا هیچ کس یک راه ساده برای گرفتن عکس های بهتر معرفی نمی کند؟ من دوست ندارم حرف های گنده گنده بشنوم و یا نام تکنیک هایی که یک عکاس در کلاس ها آموخته را حفظ کنم. من هم که در تمام این مدت هاج و واج نگاهش می کردم پس از کمی مکث دست روی شانه اش گذاشتم و گفتم نگران نباش اینطورها هم که گفتی سخت نیست. او حالا عکس های خیلی بهتری می گیرد و می خواهم امروز نکاتی را که به دوستم یاد دادم به شما نیز بیاموزم تا مورد استفاده قرار دهید.',
          null,
          null),
      ItemModel(null, null, 'همه چیز به نور مربوط می شود'),
      ItemModel(
          'این واقعیت دارد، نور اهمیت بسیار بالا در عکاسی و مخصوصا عکاسی با موبایل دارد. نور چیزی است که به یک عکس کمک می کند عکسی عالی شود. سایه ای که خورشید روی اشیا به وجود می آورد را ببینید. انعکاس نور حاصل از ساختمان را در نظر بگیرید. در طول ساعات طلایی ( به مدت زمان کوتاهی بعد از طلوع آفتاب و قبل از غروب آفتاب می گویند ) تمرین کنید. ببینید چگونه نور از یک پنجره به درون اتاق می آید. عکس گرفتن در این ساعات را حتما تجربه کنید فوق العاده است. گوشی همراه توانایی بالایی در عکاسی با نور کم ندارد. این را به خاطر بسپارید گوشی همراهتان بهترین عملکرد خود را زیر نور مناسب می تواند ارائه کند.',
          'assets/2.jpg',
          null),
      ItemModel(
          'لطفا به هیچ عنوان با گوشی خود زوم نکنید، خالصانه از طرف دوستتان. به نظر من اولین گام در مسیر گرفتن یک عکس بد با گوشی همراه این است که از زوم استفاده کنید. اگر می خواهید روی چیزی زوم کنید از پاهای خود استفاده کنید چند قدم جلو بروید.می توانم درباره سیستم زوم گوشی های همراه کلی فلسفه بافی کنم اما همینقدر بدانید کافی است: از زوم به هیچ وجه استفاده نکنید.',
          'assets/3.jpg',
          'با پاهایتان زوم کنید'),
      ItemModel(
          'به گزارش پارس ناز لرزش دوربین در حال عکس گرفتن حتی با دوربین های بزرگ نیز بسیاری اوقات نادیده گرفته می شود. راه اصلی حل این مشکل آن است که تمرین کنید چگونه گوشی خود را دست بگیرید ( بیشتر اوقات به جای اینکه گوشی را عمودی دست بگیرید افقی بگیریدش این کار قاب عریض تری به شما می دهد ) بدانید از کدام دکمه به عنوان شاتر می خواهید استفاده کنید ( راه های متفاوتی برای این کار هست، دکمه کم و زیاد شدن صدا و دکمه لمسی دوربین تایمر و غیره … ) هدف این است که هنگام لمس یا فشار دکمه شاتر گوشی نلرزد و عکسی واضح گرفته شود. مطمئنا از نتیجه این کار راضی خواهید بود. اگر می خواهید از چیزهایی عکس بگیرید که متحرک هستند از گزینه براست ( یا عکس پی در پی ) کمک بگیرید. با این کار می توانید از میان عکس ها بهترین را انتخاب کنید.',
          'assets/4.jpg',
          'دستتان را تکان دهید، نه گوشی را'),
      ItemModel(
          'دید خود را نسبت به اطراف خود تغییر دهید. اخیرا از کسی شنیدم تغییر زاویه در یک عکاسی نمی تواند تمرین مناسبی برای گرفتن عکسی عالی باشد.این کاملا غلط است. به عقیده من تغییر زاویه ها و دیدتان نه تنها باعث می شود عکس بهتری بگیرید، همچنین می تواند نشان دهد دید شما نسبت به چیزی که از آن عکس گرفتید چگونه بوده. پس از هر روشی که می توانید زاویه هایی جدید برای عکس هایتان درست کنید. تمام زاویه های ممکن را روی چیزی که از آن عکس می گیرید امتحان کنید.',
          'assets/5.jpg',
          'اهمیت زاویه'),
      ItemModel(
          'این یک قانون خیلی ساده است. لنز دوربین گوشی را تمیز کنید. درست مانند وقتی که  پنجره خانه تان کثیف باشد، بعد از تمیز کردن تصویری واضح تر از بیرون دارید. گرفتن عکس با لنزی تمیز خیلی بهتر از عکسی است که اثر انگشتانتان روی آن پیدا باشد.',
          'assets/7.jpg',
          'لنزتان تمیز است؟'),
      ItemModel(
          'از هر چیز و هرکسی که به نظرتان جالب می آید عکس بگیرید. چیزی که در این میان اهمیت دارد آن است که هرچه بیشتر عکس بگیرید این کار برایتان راحت تر می شود. زیاد عکس گرفتن کمکتان می کند به مرور جهت عکاسی خود را پیدا کنید و بفهمید بیشتر روی چه چیزی تمرکز دارید. تنها چیزی که مانعتان می شود مقدار فضای موجود در گوشی و عمر باتری آن است.',
          'assets/8.jpg',
          ' کیفیت و کمیت'),
      ItemModel(
          'اجازه دهید یک بار دیگر روشنتان کنم. لطفا از فلش دوربینتان استفاده نکنید ، خالصانه از طرف دوستتان. اگر به کیفیت عکسی که می گیرید اهمیت می دهید این کار نکنید. اگر با استفاده از نور طبیعی اطراف عکس بگیرید هرگز به نور فلش دوربین گوشی تان احتیاج پیدا نمی کنید. اگر می خواهید فضا را روشن تر کنید وسائل جانبی هستند که روی گوشی نصب می شوند و در این کار کمکتان می کنند. در حال حاضر از فلش دوربینتان فقط به عنوان چراغ قوه استفاده کنید بسش است',
          'assets/9.jpg',
          'فلش دوربینتان هم اذیت کننده است'),
      ItemModel(
          'آینه ها، شیشه ها، گودال های کوچک آب، سطوح صاف و درخشنده اینها همگی انعکاس های زیبایی تولید می کنند که حتما باید برای عکاسی امتحانشان کنید، مطمئن باشید ارزشش را دارند.',
          'assets/10.jpg',
          'آینه، آینه … چه کسی از همه زیباتر است'),
    ], 'ترفندهای کاربردی عکاسی با موبایل به صورت حرفه ای'),
    MenuItemModel([
      ItemModel(
          'با این ترفند بسیار کاربردی میتوانید گوشی خود را که گم شده است برای همیشه غیر فعال کنید. شاید گوشی خود را گم کرده باشید و شخص دیگری گوشی شما را پیدا کرده باشد و آن را به شما پس دهد اما شما میتوانید برای جلوگیری از سوء استفاده از گوشیتان میتوانید با این ترفند گوشی خود را غیر فعال کنید. برای اینکار باید کار های زیر رو انجام بدید اما بدونید که اگر گوشی دوباره هم به دستتون برسه دیگه فایده نداره چون اون گوشی کار نمیکنه برای چک کردن شماره سریال موبایل خود، کلید های زیر را به ترتیب فشار دهید (بدون فاصله) : * # ۰ ۶ # یک کد دیجیتالی روی صفحه نمایش ظاهر می شود. این شماره مختص دستگاه شما است. این شماره را یادداشت کنید و در جایی امن نگه دارید. هنگامیکه موبایل شما دزدیده می شود، شما می توانید به پشتیبان شبکه خود تماس بگیرید و این کد را به آنها بدهید. سپس آنها قادر خواهند بود دستگاه شما را مسدود کنند حتی اگر دزدها SIM کارت را عوض کرده باشند. تلفن شما کاملاً غیرقابل استفاده خواهد شد. شما ممکن است نتوانید موبایل خود را بازپس گیرید، اما حداقل می دانید شخصی که آنرا دزدیده است دیگر نمی تواند از آن استفاده کند یا آنرا بفروشد.',
          null,
          'چگونه گوشی ربوده شده را غیر فعال کنیم'),
    ], 'چگونه گوشی ربوده شده را غیر فعال کنیم'),
    MenuItemModel([
      ItemModel(
          'شما می توانید با استفاده از ترفند زیر آنتن دهی گوشی موبایل خود را تقویت کنید تا همیشه بهترین کیفیت را در مکالمه داشته باشید. با چند روش ساده می توانید آنتن‌دهی گوشی های هوشمند خود را افزایش دهید.برای بسیاری از ما پیش آمده که برای برقراری ارتباط از طریق تلفن های همراه خود به دلیل آنتن دهی ضعیف مشکل بوجود آمده است و یا آنکه آنتن دهی گوشی هوشمندمان به اندازه ای کم است که برقراری ارتباطات را میسر نمی کند. در ادامه سه روش ساده و کارآمد را برای شما شرح می دهیم تا پس از این شرایط آنتن دهی تلفن همراه شما بهبود یابد.ساده ترین و نخستین کاری که بسیاری از مردم در برخورد با این مشکل انجام می دهند راه اندازی مجدد گوشی با خاموش و روشن کردن آن است این کار درست است زیرا با راه اندازی مجدد گوشی ارتباط تازه ای با آنتن های مخابراتی برقرار می شود، توجه داشته باشید استفاده از حالت پرواز در گوشی های هوشمند نیز عملکرد راه اندازی مجدد را دارد.راه دوم اینست که قابلیت ذخیره‌سازی انرژی یا همان power saving را خاموش کنید، درست است که این قابلیت گوشی‌های همراه موجب می‌شودت ا شما زمان بیشتری از تلفن خود استفاده کنید اما توجه داشته باشید این کار بر روی آنتن دهی دستگاه شما تاثیر گذاشته و قدرت دریافت سیگنال های مخابراتی را کاهش می دهد، پس بهتر است در زمان نیاز از قابلیت ذخیره سازی انرژی استفاده کنید.اگر قابلیت یاده شده در گوشی شما فعال است و آنتن دهی مناسبی ندارید این حالت را غیر فعال کرده و دوباره شبکه خود را جستجو کنید. اما راه حل سوم و آخر، این راه حل نیز بسیار در بین مردم مرسوم است، جا به جایی مکانی؛ محیط های بسته قطعا قدرت آنتن شما را کاهش می دهد پس بهتر است برای دریافت سیگنال های با کیفیت در محیط های باز برای صحبت کردن با تلفن همراه خود قرار گیرید از سویی دیگر بهتر است گوشی خود را به نحوی دست بگیرید که دریافت سیگنال به درستی انجام  بگیرد زیرا قرار گرفتن دستتان بر روی آنتن قدرت آنتن دهی را کاهش می دهد.',
          'assets/13.jpg',
          'ترفند افزایش قدرت آنتن دهی گوشی'),
    ], 'ترفند افزایش قدرت آنتن دهی گوشی '),
    MenuItemModel([
      ItemModel(null, 'assets/14.jpeg', null),
      ItemModel(
          'تلگرام شبکه اجتماعی موبایلی با امکانات خوب خود در بین مردم محبوب شد.اما شما شاید با برخی از امکانات مفید آن هنوز آشنا نباشید. با ما همراه باشید تا برخی ویژگی ها و ترفندهایی را که با بروز شدن تلگرام به آن اضافه شده است به شما آموزش دهیم.پیام رسان تلگرام توانسته محبوبیت زیادی در بین کاربران ایرانی پیدا کند تا جایی که بیش از 20 میلیون نفر از کاربرانش را ایرانیان تشکیل می دهند. اپلیکیشن تلگرام علاوه بر امکاناتی که همه‌ی ما از آن باخبر هستیم دارای نکات و ترفندهای ریزی نیز هست. با ما همراه باشید تا برخی ویژگی ها و ترفندهایی را که با بروز شدن این پیام رسان به آن اضافه شده است به شما آموزش دهیم.',
          null,
          'ترفندهای مفید و کاربردی تلگرام'),
      ItemModel(
          'همان‌طور که می‌دانید اگر قصد داشته باشید همان لحظه عکس یا فیلمی بگیرید و آن را از طریق تلگرام ارسال کنید، بایستی ابتدا در صفحه‌ی چت، آیکن سنجاق را لمس کرده و سپس آیکن دوربین را انتخاب کنید. اما نیازی به این کار نیست. بلکه کافی است انگشت خود را بر روی آیکن سنجاق نگه دارید. با این کار علاوه بر نمایش دوربین، یک منو نمایان می‌شود که دارای دو دکمه‌ی Photo و Video است. با فشردن دکمه‌ی Photo عکس گرفته می‌شود و با فشردن دکمه‌ی Video نیز فیلم‌برداری آغاز می‌شود. در مرحله‌ی بعد نیز می‌توانید نسبت به ارسال عکس یا ویدیو اقدام کنید.',
          null,
          'عکسبرداری و فیلمبرداری سریع (ویژه IOS)'),
      ItemModel(
          'اگر تصادفاً دکمه‌ی ضبط صدا را در یک صفحه‌ی چت نگه داشته‌اید و یا از صدایی که ضبط کرده‌اید راضی نیستید، الزامی برای ارسال آن وجود ندارد. این گونه مواقع کافی است مادامی که دکمه‌ی میکروفون نگه داشتید، انگشت خود را به سمت چپ بکشید. با این کار عملیات ضبط صدا لغو خواهد شد. لازم به ذکر است در نسخه‌ی ویندوز تلگرام برای انجام این کار بایستی نشان‌گر ماوس یا انگشت خود را به سمت بالا و خارج از محدوده‌ی ضبط صدا ببرید.',
          null,
          'لغو کردن ضبط صدا'),
      ItemModel(
          'تلگرام به ربات GIF برای ارسال تصاویر متحرک مجهز شده است. اما مشکلی که در این خصوص وجود دارد این است که با هر بار ارسال تصویر، عبارت via @gif در بالای تصویر ارسالی به چشم می‌خورد. مگر این‌که تصویر را یک‌بار ذخیره کرده باشید و از قسمت تصاویر ذخیره‌شده‌ GIF را ارسال کنید که این راه نیز چندان سریع و بهینه نیست. برای ارسال تصاویر GIF راه دیگری که وجود دارد این است که ابتدا دکمه‌ی سنجاق را در صفحه‌‌ی چت لمس نمایید. اکنون مطابق با سیستم‌عامل خود مراحل زیر را طی نمایید: •  در iOS گزینه‌ی Photo or Video را لمس کنید. سپس آیکن ذره‌بین یا Search را لمس نمایید. حال به تب GIFs بروید و عبارت مد نظر خود را جستجو کنید. مجموعه‌ای از تصاویر متحرک مرتبط با عبارت جستجوشده نمایش داده می‌شود که می‌توانید نسبت به ارسال هر یک اقدام کنید. •  در اندروید گزینه‌ی Gallery را لمس کنید. سپس Find GIFs را لمس نمایید. حال عبارت مورد نظر خود را جستجو کرده و پس از نمایش نتایج، تصویر متحرک دلخواه خود را ارسال نمایید.مزیت این روش در این است که با این کار تصویر متحرک بدون متن اضافی ارسال می‌شود. هم‌چنین تاریخچه‌ای از تصاویر متحرک ارسالی از این پس در این مسیر به چشم می‌خورد که ارسال تصاویر تکراری را آسان‌تر خواهد کرد.',
          null,
          'ارسال بهتر تصاویر GIF'),
      ItemModel(
          'با استفاده از قابلیت Share می‌توان پیام‌های موجود در کانال‌ها را بسیار سریع‌تر برای دوستان ارسال کرد. برای این کار کافی است در کانال، دکمه‌ی فلش موجود در سمت راست پیام را لمس نمایید. سپس مخاطب مورد نظر را انتخاب کرده و پیام را ارسال کنید. بلافاصله پیام برای وی ارسال خواهد شد. همچنین در این روش می‌توانید یک نظر یا Comment نیز به همراه پیام بنویسید و ارسال کنید. این نظر در قالب یک پیام جداگانه برای مخاطب ارسال خواهد شد. برای این کار بعد از انتخاب مخاطب، در قسمت Write a comment پیام خود را بنویسید.',
          null,
          'به جای Forward کردن، Share کنید'),
      ItemModel(
          'تلگرام در به‌روزرسانی نسخه‌ی 3.9 خود قابلیت ویرایش پیام‌ها پس از ارسال را افزوده است. با استفاده از این قابلیت می‌توانید پیام‌های ارسالی خود را در چت‌‌های خصوصی و گروه‌ها ویرایش نمایید. البته برای ویرایش پیام یک مهلت 48 ساعته دارید. برای این کار کافی است در iOS انگشت خود را بر روی پیام ارسال‌شده نگه دارید و سپس Edit را انتخاب کنید. در اندروید نیز پس از یک بار لمس پیام می‌توانید Edit را انتخاب نمایید. همچنین در نسخه‌ی ویندوز نیز با راست‌کلیک بر روی پیام و انتخاب Edit می‌توان پیام را ویرایش کرد. حال می‌توانید پس از ویرایش متن، Save را انتخاب کنید تا پیام ذخیره شود.',
          null,
          'بعد از ارسال پیام آن را ویرایش کنید'),
    ], 'ترفندهای مفید و کاربردی تلگرام'),
    MenuItemModel([
      ItemModel(null, 'assets/17.jpg', null),
      ItemModel(
          'برای راحتی پاسخ دادن به پیام های فوری می توانیم در ios از ترفندی جالب بهره گیریم تا در حالت قفب صفحه گوشی به پیام پاسخ دهیم. یکی از قابلیت‌های خوبی که در iOS 8 به این سیستم عامل اضافه شدن است امکان پاسخ دادن به پیام‌ها از طریق لاک اسکرین است. یعنی از این پس می‌توانید از همان لاک اسکرین مشخص کنید که با یک ایمیل یا یک مسیج چه کار می‌خواهید بکنید. برای این کار:',
          null,
          'ترفند ios در لاک اسکرین به پیام ها پاسخ دهید'),
      ItemModel(
          '۱- وقتی در لاک اسکرین نوتیفیکیشن پیامی را دریافت می‌کنید انگشت خود را روی آن از چپ به راست سوییپ کنید. ۲- از بین گزینه‌هایی که می‌بینید گزینه مورد نظر را انتحاب کنید. توجه داشته باشید که بسته به نوع پیامی که دریافت می‌کنید این گزینه‌های واکنش‌گرا متفاوت خواهند بود. مثلا برای مسیج‌ها با گزینه Reply مواجه خواهید شد ولی برای ایمیل‌ها با گزینه‌های Mark As Read و Archive رو به رو خواهید شد.',
          'assets/18.jpg',
          null),
      ItemModel(null, 'assets/18.jpg', null),
      ItemModel(null, 'assets/19.png', null),
      ItemModel(
          'البته لازم به ذکر است که این ویژگی در iOS 8 فقط مختص اپ‌های پیش‌فرض نیست بلکه دولوپرها هم می‌توانند از نوتیفیکیشن‌های واکنش‌گرا در اپ‌های خود استفاده کنند. پس هر اپ متفرقه هم گزینه‌های متفاوتی از این طریق در اختیار شما قرار خواهد داد.',
          null,
          null),
    ], ' (ios) در لاک اسکرین به پیام ها پاسخ دهید'),
    MenuItemModel([
      ItemModel(
          'گوشی های سامسونگ استقبال بسیار خوبی در ایران داشت, البته تا قبل از ورود گوشی های پیشرفته حال حاضر!!!یک سری کامل از کدهای مخفی گوشی های سامسونگ را برای شما قرار می دهیم…همه این کد ها امتحان شده است اما ممکن است در برخی کشور ها ( مخصوصا ایران ) بعضی از این کد ها بسته شده باشد!!! #06#* سریال نامبر گوشی ( IMEI ) #9999#* ورژن نرم افزار گوشی 228#*#8999* وضعیت باطری ( دما ، ولتاژ ، ظرفیت) 246#*#8999* وضعیت برنامه 289#*#8999* تغییر سرعت زنگ آلارم گوشی324#*#8999* Debug screen 367#*#8999* Watchdog ( رمز گوشی) 427#*#8999* Trace Watchdog ( پیدا کردن رمز گوشی) 523#*#8999* تغییر میزان کنتراست صفحه تصویر ( تنها در ورژن G60L01W ) 636#*#8999* وضعیت حافظه746#*#8999* حجم فایل سیم کارت 778#*#8999* اطلاعات سیم کارت 289#*#8999* تست رینگ تون 778#*#8999* جدول SIM Service 377#*#8999* تصحیح EEPROM Error ( از کلیدهای جانبی برای انتخاب مقادیر cancel و ok استفاده کنید) 785#*#8999* RTK( Run Time Kernel ) Error اگر ok را بزنید گوشی ریست میگردد. 947#*#8999* ریست گوشی در مواقعی که گوشی بسیار هنگ کرده است. '
              '842#*#8999* تست ویبراتور',
          'assets/20.jpg',
          null),
    ], 'ترفند و کودهای جالب از گوشی های سامسونگ'),
    MenuItemModel([
      ItemModel(
          'حال حاظر یکی از مشکلات بزرگ دارندگان موبایل تمام شدن شارژ گوشی آنهاست.روش های جلوگیری از هدر رفتن شارژ گوشی موبایل را در برای شما در سایت موبوا.كام قرار داده ایم. برای اینکه باتری دیرتر خالی شود، نکات زیر را در نظر بگیرید؛1- اگر از بلوتوث استفاده نمیکنید، آن را خاموش کنید. بلوتوث خود به تنهایی باتری زیادی مصرف میکند. بعد از استفاده هدست یا هندزفری بلوتوث یا نقل و انتقال فایل، عکس، صوت و… از طریق بلوتوث فراموش نکنید آن را خاموش نمایید. 2- نور صفحه نمایش خود را کم کنید. بعضی از گوشیها به طور خودکار نور صفحه نمایش خود را با توجه به نور محیط تنظیم می‌کنند ولی بعضی دیگر از گوشیها این قابلیت را ندارند و باید خود کاربر این کار را انجام دهد. 3- از عکسهای متحرک استفاده نکنید. محافظ های صفحه نمایش و عکسهای متحرک پس زمینه بسیار جالبی هستند ولی مصرف باتری شما را بیشتر میکنند. 4- زنگ موبایل خود را تنظیم کنید زیرا زنگ با صدای بلند، به همراه لرزش، انرژی زیادی مصرف میکند که باعث میشود باتری زودتر خالی شود. 5- باتری خود را بشناسید. بعضی از گوشیها باتریهای لیتیومی دارند و برخی باتریهای نیکلی. در مورد باتری های نیکلی، قبل از اولین بار استفاده باید گوشی خود را تا 10 ساعت شارژ کنید تا تمام ظرفیت باتری قابل استفاده شود، اما درباره باتری‌های لیتیومی تنها تا زمانی که اعلام میکند باتری شارژ شده است کافی است. باتریهای نیکلی بعد از مدتی استفاده از آن و شارژ مجدد، نیاز به تخلیه کامل باتری دارد چون در غیر این صورت زود خراب می‌شود ولی باتریهای لیتیومی این مشکل را ندارند. این باتریها را هر موقع که لازم بود شارژ کنید و لازم نیست صبرکنید تا شارژ آن کاملا تخلیه شود. 6- باتری را خنک نگهدارید و جلوی نور آفتاب قرار ندهید. باتری‌های لیتیوم باتریهای لیتیومی در خود تجهیزات محافظت در برابر حرارت دارند که اگر مدت طولانی در شارژ باشند صدمه ‌ای به آنها وارد نمیشود. اما با این حال اگر باتریهای لیتیومی را بیش از یک هفته شارژ کنید یا اگر گوشی شما مرتب مقابل نور مستقیم آفتاب یا نزدیک‌ منبع گرمایی باشد، صدمه می‌بیند.',
          'assets/21.jpg',
          null),
    ], 'ترفندی جالب برای باتری گوشی'),
    MenuItemModel([
      ItemModel(null, 'assets/22.png', null),
      ItemModel(
          'Network Speed Booster نرم افزاری حرفه ای برای سیستم عامل آندروید می باشد که به شما کمک می کند تا بتوانید سیگنال های دریافتی از طریق دستگاههای بی سیم اینترنتی را بهتر و با کیفیت بالاتری دریافت نمایید. این نرم افزار کانکشن های شما با برج های مخابراتی ومراکز به اشتراک گذاری ارتباط اینترنتی را بهبود بخشیده و باعث افزایش سرعت اینترنت شما می شود.شما می توانید با استفاده از نصب این نرم افزار در سرعت مرور سایتهای اینترنتی بهبود بسیار قابل توجهی ایجاد کنید که لذت وب گردی را برای شما ۲ چندان خواهد کرد. این نرم افزار به شما کمک می کند تا با امن شدن کانکشن های شما و افزایش کیفیت ارتباط اینترنتی شما بتوانید از بازیها و برنامه های اینترنتی استفاده کنید و از انها لذت ببرید.',
          null,
          'ترفندی برای سرعت اینترنت موبایل خود را افزایش دهید'),
      ItemModel(
          '– بهبود قابلیت دریافت سیگنال های برج های مخابراتی و …. – افزایش سرعت اینترنت و لود صفحات – ایمن کردن کانکشن های اینترنتی با برج های مخابراتی – بهبود قابلیت مکالمه شما – افزایش مسافت دریافتی سیگنال های رادیویی – قابلیت های مخصوص ارتباطات اینترنتی و تلفنی در موارد مختلف مانند هواپیما – بسیار ویژگی های دیگر….',
          null,
          'از ویژگی های کلیدی نرم افزار :'),
    ], 'ترفندی برای سرعت اینترنت موبایل خود را افزایش دهید'),
    MenuItemModel([
      ItemModel(
          'ترفندی دیگر از سری ترفند های پر کاربرد موبایل که بیشتر نقش یک تغییر و تحول و سرگرمی دارد را ما هم اکنون در یک موبایل قرار داده ایم.در این ترفند به شما می اموزیم که چگونه به جای قرار دادن نام برروی بلوتوث گوشی خود شکلک هایی زیبا را قرار دهید. اول به این ادرس داخل کامپیوتر رفته : Start Up>All Program>Accessories>System Tools و برنامه ی Character Map رو باز میکنید و فونت Arial را انتخاب میکنید. وقتی Scroll را بیارین پایین تر عکسهای مورد نظر را میبینید. و با انتخاب هر کدوم گزینیه ی select را میزنید. این کارو که کردید و عکسای دلخواهتونو گلچین کردید گزینه ی Copy رو میزنید و یک فایل رو که عکس یا موزیک یا Text هستش را انتخاب میکنین و اون را Renameمیکنید و Pastمیکنید و اسم فایل تون به شکلک های انتخاب شده در میاد.فایل مورد نظر را به گوشیتون منتقل میکنین.توی گوشی فایلو پیدا میکنین و با کپی کردن اسم فایل و رفتن به بلوتوث وعوض کردن اسم بلوتوث و Past کردن اسم فایل میتونین از این شکلک ها برای اسم بلوتوثتون استفاده کنید.',
          'assets/23.jpg',
          null),
    ], 'ترفندی جالب قرار دادن شکلک به جای نام بلوتوث در موبایل'),
    MenuItemModel([
      ItemModel(
          'در این مطلب قصد داریم ترفندی را به شما آموزش دهیم که ممکنه برای خیلی از شما جالب باشه البته این ترفند فقط برای دارندگان گوشی های نوکیا می باشد چون قرار است از باگی که در این گوشی های وجود دارد استفاده کنیم با این ترفند جالب اگر کسی با استفاده از بلوتوث بخواهد گوشی شما را بیابد گوشی اش ریست خواهد شد.روشی که توضیح می دهیم در واقع هک کردن گوشی نیست بلکه باگی است که فقط در گوشی های نوکیا وجود دارد و در آنها عمل می کند.',
          null,
          'با بلوتوث گوشی کنار دستیتان را ریست کنید'),
      ItemModel(
          '۱- متن il[Tab]sat[Tab].com را در Notepad نوشته و ذخیره کنید. توجه : منظور از [Tab] فشردن کلید Tab است. ۲- این فایل متنی را توسط بلوتوث یا اینفرادر و یا USB به گوشی خود انتقال دهید. ۳- فایل را در گوشی باز کرده و توسط دکمه Pen متن مورد نظر را انتخاب و در همان حال دکمه Copy را بزنید. ۴- به قسمت Connect/Bluetooth گوشی رفته و در قسمت My phone’ s name این متن را Past کنید پس از این کار مشاهده خواهید کرد که یک به هم خوردگی در قسمت نام بلوتوث وجود دارد. بعد از این هر کسی بخواهد توسط بلوتوث شما را بیابد گوشی اش ریست خواهد شد. نکته : در این روش هیچ آسیبی به گوشی طرف مورد نظر که ریست می شود نمی رسد و شما برای انتقال فایل از طریق بلوتوث باید اسم  بلوتوث خود را تغییر دهید.',
          null,
          'مراحل کار :'),
    ], 'با بلوتوث گوشی کنار دستیتان را ریست کنید'),
    MenuItemModel([
      ItemModel(
          'ترفندی برای مخفی سازی فایل ها در داخل موبایل بدون داشتن نرم افزار جالبه! برای خواندن ترفند روی ادامه مطلب کلیک کنید    1- با فایل منیجر موبایل بر روی همون فایلی كه می خواهید تغییرش بدهید بروید. 2-Option =>> Rename 3- حالا پسوند فایل رو پاك می كنیم. ( با دكمه C می شه پاك كنید) می تونید از پسوند های exe. یا txt. یا dat. استفاده كنید و حالا برای اینكه پسوندش یادت نره اونو یه جایی تو اسمه فایلت بزار. اگه هم به كل ،اسم فایلت زایست. اسم رو هم عوض كن. 4-حالا OK  رو بزن5- هر موقع فایلت رو لازم داشتید همون طوری كه گفتم پسوند فایل رو بر می گردونی. نكته: با این روش فایل های كامپیوتر رو هم می توان پنهان كرد.',
          'assets/81.jpg',
          'چگونگی مخفی کردن فایل ها در موبایلمان'),
    ], 'چگونگی مخفی کردن فایل ها در موبایلمان'),
    MenuItemModel([
      ItemModel('null', null, 'برای مسدودکردن تلفن همراه چه باید کرد؟'),
    ], 'برای مسدودکردن تلفن همراه چه باید کرد؟'),
    MenuItemModel([
      ItemModel(
          'هر گوشی موبایل دارای یک سری کد محرمانه است که اعمال هر کدام با توجه به نوع شبکه باعث اعمال تغییراتی میشود.بهترین گوشی که اعمال کدهای آن بر روی سیستم مخابراتی ایران جواب می دهد نوکیا است. کافیست کد زیر را وارد کنید. اگر درست وارد کرده باشید پیام SIM CLOCK STOP ALLOWED را می بینید و این به این معنی است که شبکه به شما اجازه توقف تایمر سیم کارت رو داده است.حال با خیال راحت شماره گیری کنید. برای جلو گیری از لو رفتن این امر بهتر است هر تماس شما بیشتر از ۵ دقیقه طول نکشد. در ضمن به ازای هر ۵ دقیقه باید یک بار کد را وارد کنید. این هم از کد:   #746025625#* سه دقیقه مکالمه رایگان برای موبایل برای گوشی های نوکیا از طریق منو گوشی به آدرس زیر بروید : menu—> setting—>security—>closed user—> groupe —> activate حالا بعد از این که اکتیو کردید از شما یه شماره خواسته میشه شما 4رقم آخر شماره موبایل خودتون رو وارد کنید ! 0912 که هیچی !! 3 رقم بعدش هم هیچی !! اون 4تایی که آخر میمونه رو وارد کنید بعدشم اوکی کنید و دیگه کار تمومه برای گوشی سامسونگ به این آدرس : Menu—>network setting—>closed user groupe—> activate بعد از این که اکتیو کردید وارد منوی زیر میشید Menu—>network setting–>closed user groupe—> cug text و در اینجا هم مثل بالا 4 رقم اخر شماره خودتون رو بدید.',
          'assets/80.jpg',
          null),
    ], 'اگر نوکیا دارید اینگونه رایگان مکالمه کنید'),
    MenuItemModel([
      ItemModel(
          'به خصوص در مواقعی که به بازی کردن مشغول هستیم گوشی موبایل ما داغ می کند و در ناحیه پشت گوشی حرارت زیادی تولید می شود. شاید زیاد بازی می‌کنید یا شرایط محیطی این گرمای افراطی را سبب می‌شود؛ حقیقت این است که اشاره به چرایی دقیق گرم شدن گوشی‌ کمی دشوار است. شاید دستگاه تلفن همراهتان وقتی که داغ می‌شود، دچار کندی عملکرد شده و شاید تا زمانی که از گرمایش کاسته نشده و سرد نشود، خاموش شود. به هر نحو، این داغی باید متوقف شود. وب‌سایت میک‌یوزآف (makeuseof) نگاهی به دلایل متعددی که سبب داغ شدن گوشی می‌شود انداخته تا راهی را برای بهبود آنچه که اتفاق می‌افتد ارائه دهد. اغلب زمانی که شما در جست‌وجوی چرایی داغ شدن گوشی‌تان هستید، به دنبال دلیلی مشخص مانند استفاده زیاد یا اتصال بیش از حد به اسپیکرها می گردید. ممکن است برای حل این مشکل به اینترنت هم مراجعه کرده و عباراتی که هنگام خطا مشاهده می‌کنید را در گوگل جست‌وجو کرده باشید و حتی از اپلیکیشن‌های خاصی استفاده کنید. تقریبا هر بار شما به مجموعه‌ای از دلایل قدیمی برای علت داغ شدن گوشی خود برخورد می‌کنید؛ از جمله «روشنایی صفحه نمایشتان خیلی زیاد است» یا «وای فای گوشی برای مدت زیادی متصل مانده است»، «زیاد بازی می‌کنید (که اغلب با این توصیه که گوشی شما کنسول بازی نیست مواجه می‌شود)» و نظایر آن. در سال ۲۰۱۶ دیگر کسی نباید از گوشی‌هایی که تحت استفاده معمولی داغ می‌شوند استفاده کند. شاید وای‌فای یک مساله باشد، اما خود اتصال به اینترنت نیست که مشکل ایجاد می‌کند، بلکه نحوه استفاد از آن است.',
          null,
          'ترفند جلوگیری از داغ شدن گوشی '),
      ItemModel(
          'بدافزارها در گوشی اندروید شما می‌تواند مشکلی باشد که سبب داغ شدن گوشی می‌شود. بالاخره توسعه‌دهندگان این بدافزارها نگران سلامتی دستگاه شما نیستند و تنها می‌خواهند به داده شما دسترسی داشته باشند.',
          null,
          'ویروس‌ها را فراموش نکنید'),
      ItemModel(
          'یکی از فاکتورهایی که بسیاری از دارندگان گوشی‌های هوشمند درگیر آن هستند، قاب گوشی‌هاست. تقریبا تمامی قاب‌های گوشی از پلاستیک ساخته شده‌اند یا میزان زیادی پلاستیک دارند و حتی آنهایی که چرمی هستند هم مشکلات مشابهی را دارند. تلفن عایق است، گرما را داخل و سرما را خارج نگه می‌دارد. برای دلایل امنیتی، زمانی که گوشی شروع به گرم شدن می‌کند (خصوصا در طول عملکردهای سنگین)، نیاز است گرما را از خود دور کند و حضور یک قاب که از مواد صنعتی ساخته شده است، از این اتفاق جلوگیری می‌کند. مانند این است که با داشتن یک کت ورزش کنید. انتخاب‌هایی که برای جلوگیری از این مساله وجود دارد، چندان خاص نیست، اما بیرون آوردن گوشی از قاب می‌تواند شروع خوبی باشد.',
          null,
          'قاب گوشیتان آن را خفه کرده است؟'),
      ItemModel(
          'نکته دیگری که می‌توانید در نظر داشته باشید، حالت باتری و کابل شارژر است. اگر شما یک گوشی قدیمی دارید که اغلب بیش از اندازه در شارژ نگه داشته شده است (شما نباید گوشی خود را تا ۱۰۰ درصد شارژ کنید و برای افزایش طول عمر باتری باید گوشی خود را به طور منظم تا ۸۰ و ۹۰ درصد شارژ کنید)، ممکن است به داغ شدن گوشی منجر شود. هرچند شما باید کیفیت کابل شارژر خود را نیز کنترل کنید. گوشی‌ها نباید هنگام شارژ شدن داغ شوند (مشخصا نه آنقدر داغ که موجب ایجاد مشکل شود) و وقتی این اتفاق می‌افتد، دلیل آن می‌تواند یک باتری معیوب باشد (که جدا کردن آن از گوشی‌های هوشمند کنونی یک مشکل است) یا کیفیت پایین کابل شارژر. راه آسانی برای مقابله با این مشکل می‌تواند جایگزینی کابل باشد.',
          null,
          'کابل شارژر را چک کنید'),
      ItemModel(
          'وای فای به خودی خود مشکل‌آفرین نیست، اما ممکن است گوشی هوشمند شما به سبب نحوه استفاده بیش از اندازه از وای‌فای داغ شود. کاربران اندرویدی به طور خاص مستعد ابتلا به اپلیکیشن‌هایی هستند که در پس‌زمینه فعالیت می‌کنند، مانند CPU و Wi-Fi یا اینترنت موبایل. اگر اپلیکیشن‌ها به این نحو راه‌اندازی شوند، می‌توانند داغ شدن گوشی را به همراه داشته باشند.',
          null,
          'وای‌فای هم مشکل می‌آفریند؟'),
    ], 'ترفند جلوگیری از داغ شدن گوشی '),
  ];

  static List<MenuItemModel> LearnMenuItemlist = [
    MenuItemModel([
      ItemModel(null, 'assets/24.png', null),
      ItemModel(
          'آموزش استفاده از اینترنت گوشی در کامپیوتر اشتراک‌گذاری اینترنت گوشی از طریق وای‌ فای, یکی از مرسوم‌ترین و پرطرفدارترین راههای بهره گیری از آن روی رایانه هست. در این حالت, تلفن همراه شما یک شبکه‌ وای‌ فای ایجاد کرده و عملا شبیه به یک روتر, پلی میان شبکه‌ موبایلی و آن شبکه برقرار میکند تا داده‌ها از این مسیر منتقل شوند. برای راه‌اندازی این سیستم که به آن هات‌اسپات «Hotspot» نیز گفته می شود, پس از اطمینان از فعال بودن اینترنت موبایلتان, به تنظیمات اصلی گوشی بروید. در گوشی‌هاي اندرویدی باید از قسمت اتصالات «Connections» روی انتخاب‌اي به اسم هات‌اسپات تلفن همراه «Mobile hotspot and tethering» یا شبیه به آن بزنید تا وارد بخش ایجاد شبکه‌ وای‌فای و فعالسازی آن شوید. در آیفون مستقیما انتخاب‌اي به اسم هات‌اسپات شخصی «Personal Hotspot» در تنظیمات وجود دارد. در این بخش میتوانید اسم و رمز عبوری را برای شبکه‌ وای‌فای‌تان‌ انتخاب کنید. دقت کنید نوع پروتکل را از WPA2 PSK تغییر ندهید, زیرا امن‌ترین پروتکل هست. اضافه بر این, برخی از انواع گوشی‌هاي اندرویدی تنظیمات بیشتری مثل انتخاب کانال یا پنهان‌سازی اسم شبکه را هم در اختیار کاربران قرار میدهند. پس از ایجاد و روشن کردن هات‌اسپات روی گوشی, شبکه‌ وای‌فای ایجاد شده را در لیست شبکه‌ها در لپ‌تاپ یا کامپیوترتان می بینید و با وارد کردن رمز عبور میتوانید به آن متصل شوید. هنگامی که یک یا چند دستگاه به هات‌ اسپات ساخته‌شده متصل شوند, روی گوشی‌تان شمار این دستگاه‌ها نوشته میشود تا متوجه شوید در حال آماده چند دستگاه به هات‌اسپات شما وصل شده‌اند. در برخی گوشی‌هاي اندرویدی قابلیت اجازه به دستگاه‌هاي خاص نیز تعبیه شده و بقیه حتی با داشتن رمز عبور هم امکان اتصال را نخواهند داشت.به این نکته‌ هم دقت داشته باشید که فعال بودن هات‌اسپات, مصرف باتری گوشی‌ را بشدت بالا می برد و اگر هم گوشی‌تان حسابی داغ شد, تعجب نکنید! بنابراین زمانی که با آن کاری ندارید, حتماً هات‌اسپات را خاموش کنید.',
          null,
          'هات‌اسپات وای‌ فای'),
    ], 'آموزش استفاده از اینترنت گوشی در کامپیوتر'),
    MenuItemModel([
      ItemModel(null, 'assets/25.jpg', null),
      ItemModel(
          'گوشی های اندرویدی باتری بسیار زیادی مصرف می کنند و این مورد برای اندروید یک نقطه ضعف بزرگ در بازار به حساب می آید. به گوشی های هوشمند ما هر روز قابلیت های بیشماری افزوده می شود و توانمند تر می شوند. ما از این دستگاه ها برای گوش دادن به موسیقی، بازی کردن با انواع بازی ها و خواندن ایمیل های شخصی و کاری استفاده می کنیم. فعالیت های دیگری مثل وب‌گردی و استفاده از شبکه های اجتماعی نیز از طریق استفاده از این دستگاه های هوشمند امکان پذیر است. حالا که تکنولوژی «واقعیت مجازی» محور توجه همگان شده است، شما می توانید حتی در حالی که در منزلتان روی کاناپه لم داده اید، یک دنیای کاملا متفاوت را تجربه کنید و از آن لذت ببرید. در این حالت خیلی کمتر ممکن است موقعیتی پیش بیاید که شما مجبور باشید حتی یک تماس تلفنی برقرار کنید. اما یکی از جنبه های تلفن های هوشمند که متاسفانه پیشرفت چندانی نداشته، باتری آن است.برای اینکه زمان زیادی را صرف شارژ کردن باتری تان نکنید مجبور هستید تلفن همراهی بخرید که باتری بزرگی دارد یا قدرت شارژ شدن باتری اش بیشتر از دیگر گوشی هاست. البته راه هایی نیز وجود دارد که شما می توانید با توجه به آن ها زمان بیشتری از تلفن همراهتان استفاده کنید. مسلما این ترفند ها نمی توانند عمر باتری شما را دو یا سه برابر کنند، اما با یادگیری این ترفندها زمانی که به تلفن همراهتان نیاز دارید، با یک باتری تمام شده مواجه نخواهید شد.',
          null,
          'آموزش کاهش مصرف باتری گوشی های اندرویدی'),
      ItemModel(
          'موضوعی که باعث می شود گوشی های هوشمند بسیار خوب و کارآمد باشند این است که می توانید برای هر منظور و هدفی یک اپلیکیشن مرتبط دانلود کرده و استفاده کنید. اما از میان این اپلیکیشن ها ممکن است تعدادی وجود داشته باشند که باتری بیشتری مصرف کنند. شما می توانید به منوی تنظیمات تلفن همراهتان بروید و قسمت باتری را ببینید تا متوجه شوید اپلیکیشن ها ی مختلف چقدر باتری شما را مصرف می کنند. البته اپلیکیشنی که بیشتر استفاده می کنید حتما در صدر این لیست قرار خواهد داشت. اگر متوجه شدید که اپلیکیشنی بیش از حد در حال استفاده از باتری شماست، بهتر است آن را کاملا از روی گوشیتان حذف کنید.مشکل این اپلیکیشن ها معمولا با بروزرسانی های بعدی حل می شود و شما می توانید وقتی آپدیت بعدی این اپلیکیشن عرضه شد، دوباره آن را دانلود کرده و نصب کنید.اپلیکیشن هایی روی گوشی شما وجود دارند که به موقعیت مکانی شما دسترسی دارند. استفاده مداوم از GPS توسط این برنامه ها باعث مصرف بیش از حد باتری می شود. برای بررسی این موضوع می توانید به تنظیمات رفته و قسمت Location را نگاه کنید. در این قسمت می توانید لیست اپلیکیشن هایی که از GPS استفاده می کنند را ببینید. می توانید با باز کردن هرکدام از این اپلیکیشن ها، جزییات و میزان مصرف آن ها را مشاهده کنید. اگر میزان مصرف باتری اپلیکیشنی زیاد بود، می توانید دسترسی موقعیت مکانی آن را قطع کنید. اگر استفاده خاصی از ویژگی GPS ندارید، بهتر است حتی آن را هم خاموش کنید. GPS را در اغلب تلفن های هوشمند در منوی دسترسی سریع به تنظیمات پیدا خواهید کرد. اگر می خواهید از Google Maps استفاده کنید، می توانید آن را به راحتی روشن کرده و بعد از تمام شدن کارتان دوباره خاموشش کنید. یکی دیگر از دلایلی که باعث تمام شدن ذخیره باتری می شود، استفاده مداوم از ویجت ها است. استفاده از ویجت ها برای کاربران بسیار راحت و بی دردسر است اما وقتی تعداد زیادی از آن ها فعال باشند ممکن است انرژی زیادی از باتری را مصرف کنند. پس اگر ویجتی در گوشی یا تبلت شما وجود دارد که نیاز مبرمی به آن ندارید، بهتر است آن را غیرفعال کنید.',
          null,
          'اپلیکیشن هایی که باتری شما را می خورند'),
      ItemModel(
          'تمام گوشی های هوشمند اندرویدی دارای قابلیتی به نام وضعیت Power Saving هستند. فعال کردن این وضعیت باعث کاهش فهالیت های پشت صحنه می شود. Power Saving جلوه های ویژه انیمیشنی را قطع می کند، خدمات مکان یابی را غیرفعال می سازد و نور صفحه نمایش را نیز کاهش می دهد. این اقدامات در جهت استفاده بهینه از انرژی باقیمانده باتری صورت می گیرد. این وضعیت معمولا وقتی که سطح ذخیره باتری به ۱۵% می رسد به صورت خودکار فعال می شود. اما اگر حالتی برای شما پیش بیاید که باتری گوشیتان به سرعت در حال تخلیه انرژی باشد و نتوانید آن را به شارژر وصل کنید، می توانید به منوی تنظیمات رفته، این حالت را پیدا کرده و آن را فعال کنید. برخی شرکت های سازنده مانند سامسونگ، هوآوی و دیگر شرکت ها، وضعیت دیگری نیز به نام Ultra Power Saving در منوی تنظیمات گوشی هایشان قرار داده اند که به معنی حالت ذخیره انرژی در سطح بالاتری است. این وضعیت به این معنی است که با فعال کردنش، گوشی شما عملا به یک گوشی کاملا ساده تبدیل می شود که فقط می توانید با آن تماس تلفنی برقرار کنید و SMS دریافت کنید. اگر در وضعیتی هستید که سطح شارژ گوشیتان بسیار پایین است و در عین حال باید تماس تلفنی مهمی برقرار کنید، این وضعیت بسیار به شما کمک خواهد کرد.',
          null,
          'وضعیت Power Saving'),
      ItemModel(
          'اغلب گوشی های هوشمند دارای قابلیتی بنام تنظیم نور صفحه بصورت اتوماتیک هستند. همانطور که از نام این وضعیت برمی آید، نور صفحه را با توجه به نور محیط اطراف و توسط سنسور های روی صفحه نمایش، تنظیم می کند. اگر می خواهید مصرف باتری گوشیتان را کمتر کنید، تنظیم دستی نور صفحه نمایش و قرار دادن آن روی حداقل، می تواند به شما کمک شایانی کند. حتی وقتی که باتری گوشی کاملا شارژ شده است نیز بهتر است نور صفحه را در حد متوسط قرار دهید. برای اینکه انرژی باتری شما هدر نرود، یک کار دیگر نیز می توانید انجام دهید و آن هم در رابطه با نور صفحه در حالتی است که از آن استفاده نمی کنید. همیشه وقتی گوشی را کنار می گذارید، چند ثانیه ای طول می کشد تا نور صفحه کاملا خاموش شود. بهتر است این فاصله زمانی را به حداقل ( مثلا ۱۰ ثانیه) برسانید. می توانید در قسمت تنظیمات صفحه نمایش، این وضعیت را مدیریت کنید.',
          null,
          'تنظیمات صفحه نمایش'),
      ItemModel(
          'اغلب تولید کنندگان گوشی های هوشمند ادعا می کنند باتری هایی که تولید می کنند، طول عمر بالایی دارند اما به مرور متوجه می شوید که عملکرد باتری دستگاه شما هر روز کمتر می شود. اگر شرایط نگهداری از باتری خوب نباشد، سرعت این روند افزایش می یابد. تحقیقات نشان می دهد که فرقی ندارد تلفن شما در حال استفاده باشد یا نه. اگر دستگاه گرم شود، عمر باتری آن کاهش پیدا می کند. برای بهبود شرایط نگهداری از باتری کافی است حواستان را جمع کنید تا در روزهای گرم و آفتابی، گوشی را روی داشبورد ماشی قرار ندهید.وقتی از گوشی استفاده می کنید، متوجه می شوید که دمای آن بالا رفته و گرم شده است. مخصوصا اگر یک بازی با گرافیک سنگین انجام دهید، می بینید که گوشی چقدر در دستان شما گرم و آزار دهنده شده است. در این زمان بهتر است برنامه مورد استفاده تان را ببنیدید و گوشی را رها کنید تا استراحت کند و خنک شود. می توانید حتی گوشی را خاموش کنید تا سرعت انجام این پروسه افزایش یابد. بسیاری از کاربران در دسته ۱۰-۹۰ قرار دارند. یعنی باتری دستگاهشان را بیش از ۹۰% شارژ نمی کنند و البته اجازه نمی دهند شارژ آن به کمتر از ۱۰% برسد. برخی تحقیقات نشان داده است ۴۰-۸۰ گزینه بهتری است هر چند کاربران نمی توانند همیشه از این راه حل استفاده کنند و وقتی سطح شارژ باتریشان به ۴۰% رسید، ان را شارژ کنند. اما به هر حال بهتر است حداقل یکبار هر سه ماه اجازه دهید شارژ باتری کاملا خالی شود و دوباره آن را شارژ کنید.',
          null,
          'نگهداری فیزیکی از باتری'),
      ItemModel(
          'ممکن است شما فکر کنید که اپلیکیشن های زیادی باید دانلود کنید تا به عمر باتریتان افزوده شود اما بهتر است بدانید که تنها تعداد معدودی از این برنامه ها واقعا کاربردی و مفید هستند.Greenify به شما کمک می کند اپلیکیشن هایی که شارژ زیادی از باتری را مصرف می کنند شناسایی کرده و آن ها را غیرفعال کنید. به این ترتیب سرعت عملکرد و پردازش دستگاه نیز افزایش پیدا می کند. این اپلیکیشن ها در پس زمینه دستگاه شما تا وقتی دوباره به آن ها اجازه فعالیت ندهید، غیرفعال باقی می مانند.البته به خاطر داشته باشید که استفاده از برنامه Greenify باعث می شود بخش عمده عملکرد اپلیکیشن ها متوقف شود پس بهتر است از آن برای پیام رسان ها و آلارم ساعت استفاده نکنید. این برنامه همچنین برای دستگاه هایی با اندروید ۶ مارشمالو و بالاتر، قابلیت های کنترل عملکرد شدیدتری به نام های Doze on the go و Aggressive Doze اضافه کرده است. Doze برنامه ای است که به همراه اندروید ۶ مارشمالو معرفی شد. این ویژگی وقتی گوشی در حال انجام کار خاصی نیست، به بهینه سازی مصرف انرژی باتری می پردازد. البته این ویژگی تنها زمانی فعال می شود که دستگاه در حال شارژ نباشد و حداقل ۳۰ دقیقه در حالت بیکار مانده باشد. مواردی که در بالا به آن ها اشاره کردیم، راه حل های رایج و عمومی افزایش طول عمر باتری است. با توجه به این موارد می توانید از خالی شدن سریع باتری دستگاهتان جلوگیری کنید.',
          null,
          'اپلیکیشن هایی که به طول عمر باتری کمک می کنند'),
    ], 'آموزش کاهش مصرف باتری گوشی های اندرویدی'),
    MenuItemModel([
      ItemModel(null, 'assets/26.jpg', null),
      ItemModel(
          'تصویر مخاطب در اندروید را می توان به سادگی تغییر داد. قرار دادن تصویر برای مخاطبین می تواند بسیار جذاب باشد. می دانید چه چیزی کسل کننده است؟ تصویر پیش فرض موبایل برای شماره های افراد مورد علاقه شما. آن ها افراد خاصی در زندگی شما هستند. بهترین دوستان، همسر یا فرزندان. استحقاق این افراد بیشتر از حرف اول نامشان در لیست تماس های موبایل شماست. اصلاح این مسئله بر عهده خود شماست. نگران نشوید ما اینجا هستیم تا به شما در این مورد کمک کنیم.قبل از شروع باید بگویم که این پروسه در گوشی های مختلف فرق می کند.سامسونگ، ال جی، هوآوی و غیره.. این روش بسته به مدل گوشی که استفاده می کنید متفاوت است. اما خیلی راحت می توان در گوشی های مختلف این روش را تشخیص داد چون سیستم شماره گیری در مدل های مختلف تفاوت چندانی با یکدیگر ندارند. بسیار خب. آماده اید؟ بیایید با هم شروع کنیم. اولین کاری که باید انجام دهید این است که لیست شماره ها را باز کنید و شماره ای که می خواهید تصویر آن را تغییر دهید انتخاب کنید.',
          null,
          null),
      ItemModel(
          'این قسمت ممکن است در گوشی های مختلف متفاوت باشد. در بیشتر تلفن ها وقتی روی تصویر پیش فرض می زنید کانتکت کارد (contact card) باز می شود. یک استثناء وجود دارد و آن هم لیست علاقه مندی ها (Favorites list) در گوشی های اندروید استوک و سامسونگ است: اگر روی تصویر ضربه بزنید تماس گرفته میشود. پس باید در گوشی های سامسونگ روی حرف (i) که در تصویر زیر نشان داده شده است ضربه بزنید. و در گوشی های اندروید استوک روی گزینه (سه نقطه) ضربه بزنید. البته این کارها در لیست کامل تماس ها نیاز نیست. فقط کافی است روی تصویر ضربه بزنید.',
          'assets/27.jpg',
          null),
      ItemModel(
          'وقتی وارد صفحه کانتکت کارد (contact card) می شوید روی گزینه ادیت Edit بزنید. گزینه ادیت به دو شکل است یا کلمه Edit یا ویرایش و یا شکل مداد که در تصویر زیر نشان داده شده است. این گزینه در گوشه راست بالای صفحه موجود است. در میان تمام گوشی هایی که من کار کرده ام این گزینه ویرایش یا Edit فقط در گوشی Huawei Honor 5X موقعیت متفاوتی دارد. گزینه ویرایش یا Edit در این مدل گوشی در پایین صفحه قرار دارد.',
          'assets/28.jpg',
          null),
      ItemModel(
          'وقتی صفحه ویرایش یا Edit باز می شود علاوه بر عکس می توانید تمام مشخصات تماس را ویرایش کنید. تغییر تصویر بسیار آسان است. فقط روی تصویری که در پایین نشان داده شده است ضربه بزنید دو گزینه برای شما می آید: عکس جدید بگیرید یا از عکس های گالری انتخاب کنید. سپس عکسی که انتخاب کرده اید را برش (Crop) دهید.',
          'assets/29.jpg',
          null),
      ItemModel(
          'پس از انتخاب، تصویر در کانتکت کارد (Contact card) نمایش داده می شود.',
          'assets/30.jpg',
          null),
      ItemModel(
          'در انتها گزینه ذخیره Save را بزنید تا تصویر در مشخصات او در تمام قسمت های گوشی ثبت شود.',
          'assets/32.jpg',
          null),
    ], 'آموزش عوض کردن تصویر مخاطب در اندروید'),
    MenuItemModel([
      ItemModel(null, 'assets/33.jpg', null),
      ItemModel(
          'گوشی های اندرویدی از لحاظ امنیت همیشه توسط رقبا به چالش کشیده شده اند و این بار یک باگ بزرگ کشف شده است که می تواند از طریق آن گوشی را به سادگی روت کرد. برنامه‌های کمی وجود دارند که تنها طی چند ثانیه گوشی‌های اندرویدی هوشمند، از محصولات ال‌جی گرفته تا سامسونگ و موتورولا و گوشی‌های دیگر برند‌ها را روت کنند. اما اکنون جمعی از متخصصین این حوزه شیوه جدیدی از حمله را اختراع کرده‌اند که از جدیدترین باگ سخت افزاری گوشی های اندرویدی استفاده نموده و دسترسی به “روت” و ریشه تعداد بسیار زیادی از گوشی‌ها را به طور کامل فراهم می‌کند. در این روش از یک باگ در سیستم استفاده شده که در آن اجازه داده می‌شود تا دیتای ذخیره شده در چیپ‌های مموری دستکاری شود.',
          null,
          'آموزش روت گوشی اندروید تنها در چند ثانیه'),
      ItemModel(
          'این باگ سخت افزاری گوشی های اندرویدی که البته به تازگی نیز برای اولین بار کشف نشده و از زمان‌های گذشته وجود داشته است، این پتانسیل را دارد تا میلیون‌ها دستگاه اندرویدی را در سراسر جهان آسیب‌پذیر کند. تا زمانی که راه حل برای برطرف نمودن این مشکل ارائه شود، گوشی‌های اندرویدی در خطر این نوع جدید از حمله قرار دارند که در آن کنترل از دستان بخش‌های مرکزی سیستم عامل ربوده شده و کلیدی‌ترین بخش‌های دفاعی آن به طور کامل از کار می‌افتند. در چنین شرایطی هر نوع تخلیه اطلاعاتی پیش از به نابودی کشیده شدن کامل گوشی می‌تواند به راحتی اتفاق بیافتد. متاسفانه مشخص شده که شیوه جدید نفوذ با استفاده از باگ سخت افزاری گوشی های اندرویدی که تحت عنوان “رو همر” (Rowhammer) شناخته می‌شود، می‌تواند رنج بسیار وسیعی از گوشی‌ها را درگیر خود کند، چون دستگاه‌های پیشین و خیلی قدیمی‌تری که به چیپ‌های ARM مجهز شده بودند نیز می‌توانند به این روش مورد سوء استفاده قرار بگیرند. متخصصین پیشتر بر این باور بودند که حملات Rowhammer که برخی قسمت‌های حساس از نظر امنیت دیتا را دگرگون می‌کردند، به اندازه‌ای قابل اطمینان نیستند تا بتوانند یک شیوه پایدار و مطمئن تهدید را برای گوشی‌های هوشمند شکل دهند. از آنجایی که بهره‌بردارى کردن از سیستم به خرابی‌های سخت افزاری که تصادفا پیش آمده و یا ویژگی‌های مدیریت حافظه پیشرفته بستگی دارند، از همین رو می‌توان به راحتی آنان را شناسایی و این و باگ سخت افزاری گوشی های اندرویدی را رفع کرد. اما تحقیقات گروهی بین‌المللی از متخصصین آکادمیک که مشغول بررسی این موضوع هستند، فرضیات یاد شده را به طور کلی با چالش رو به رو ساخته است. اپلیکیشن تهیه شده توسط این گروه برای بهره بری از باگ سخت افزاری گوشی های اندرویدی ، به هیچ اجازه‌ای از سوی کاربر احتیاج نداشته و به هیچ آسیب پذیری در اندروید برای کار کردن صحیح خود بستگی ندارد. در عوض، برای حمله به قلب گوشی از یک آسیب پذیری سخت افزاری سوء استفاده کرده و با استفاده از Rowhammer، بیت‌های تعیین کننده و سرنوشت ساز دیتا را دست‌خوش تغییر قرار می‌دهد، به طوری که قادر است تا بیشتر دستگاه‌های اندرویدی تولید شده توسط برندهای نامی بازار، همچون ال‌جی، سامسونگ، موتورولا و به احتمال زیاد بسیاری دیگر از تولید کنندگان را روت نماید.',
          null,
          'جدیدترین باگ سخت افزاری گوشی های اندرویدی'),
      ItemModel(
          'تا پیش از این رخنه‌های نرم افزاری نقطه تمرکز متخصصین در زمینه‌های گوشی‌های هوشمند بوده و کاربران نیز همیشه از بابت مشکلات امنیتی نرم افزاری ابراز نگرانی می‌کرده‌اند، از همین رو می‌بینیم که با ارائه یک آپدیت جدید نرم افزاری برای یک مدل خاص، درصد بالایی از کاربران به منظور جلوگیری از مشکلات احتمالی آن را دریافت می‌کنند، اما هیچ‌کس تاکنون به باگ سخت افزاری گوشی های اندرویدی فکر نکرده است. یکی از محققین با نام ویکتور ون‌در وین (Victor van der Veen) در نامه‌ای پس از انجام تحقیقات نوشته:اکنون ما از باگ سخت افزاری گوشی های اندرویدی کشف شده برای شکستن گوشی‌ها و فبلت‌های شما به روشی مطمئن و قابل اطمینان، بدون بهره بردن از هرگونه آسیب پذیری نرم افزاری و یا دیگر ویژگی‌های سری و محرمانه استفاده می‌کنیم. متاسفانه به دلیل یاد شده، یعنی سخت افزاری بودن مشکل، هیچ راه حل سریعی در دسترس نیست، چون همانند گذشته نمی‌توان به سرعت یک آپدیت امنیتی نرم افزاری ارائه کرده و مشکل را طی مدت زمانی کوتاه بر روی تعداد زیادی از گوشی‌های هوشمند حل کرد. تا کنون Drammer، آن طور محققین اپلیکیشن خود را نام نهاده‌اند، توانسته تا با بهره‌برداری از باگ سخت افزاری گوشی های اندرویدی ، دستگاه‌هایی که در ادامه ذکر می‌کنیم را با موفقیت روت نماید: Nexus 4 و Nexus 5 به عنوان گوشی‌های اندرویدی اختصاصی گوگل، پرچمدار پیشین ال‌جی یعنی G4 و مدل‌های Moto G ساخته شده از سال 2013 تا 2014 توسط کمپانی موتورولا (که اکنون به مالکیت لنوو در آمده)، گلکسی اس 4 و اس 5 ساخت سامسونگ و گوشی One ساخت شرکت OnePlus. ناگفته نماند که در برخی موارد نتایج قابل اطمینانی به دست نیامده است، به عنوان نمونه، تنها 12 مورد از 15 گوشی Nexus 5 با موفقیت روت شدند، در حالی که تنها یکی از دو گوشی گلکسی اس 5 به این شیوه روت شد.',
          null,
          'راه حل سریعی در دسترس نیست'),
      ItemModel(
          'محققین هنوز مطمئن نیستند که چرا با وجود کشف کردن چنین باگ سخت افزاری گوشی های اندرویدی ، نتایج متناقضی دریافت می‌نمایند. یک تئوری این است که عمر دستگاه مورد آزمایش می‌تواند به عنوان یک عامل کلیدی ایفای نقش کند، از آنجایی که به طور حتم استفاده مداوم و زیاد از گوشی طی زمان می‌تواند سلول‌های درونی چیپ را از پا درآورده و آن را برای این نوع حمله آماده‌ کند. تئوری دیگر بستگی داشتن نحوه کارکرد Rowhammer به تولیدکننده چیپ مموری است، آن‌طور که برخی از مدل‌ها شدیدا به این نوع از حمله واکنش نشان می‌دهند (استفاده از چیپ‌های مموری مختلف در نسل‌های متفاوت یک مدل گوشی، اتفاق غیر متداولی نیست). این گروه محقق تصمیم دارند تا به زودی یک اپلیکیشن پایدار را به صورت عمومی عرضه کرده تا کاربران بتوانند به صورت انفرادی آن را بر روی گوشی خود تست و نتیجه این باگ سخت افزاری گوشی های اندرویدی را به صورت بی‌نام از طریق همان اپلیکیشن برای سازنده ارسال کنند تا میزان کارکرد این روش و میزان اهمیت این باگ با انجام یک بررسی در سطح وسیع مشخص شود. اگر که تاکنون گوشی خود را به هیچ روشی روت نکرده و درباره عواقب آن بی‌اطلاعید، بد نیست بدانید که امکان غیر فعال شدن گوشی جزء جدانشدنی بیشتر روش‌های روت شدن دستگاه است، به این معنی که عملیات موفق‌آمیز نبوده و گوشی اندرویدی شما را به طور کامل به یک پاره آجر تبدیل می‌کند(نام پاره سنگ (Brick) به همین دلیل انتخاب شده) که دیگر به جز استفاده در مواد لازم برای ساختمان‌سازی هیچ کاربرد دیگری نخواهد داشت!',
          'assets/34.jpg',
          null),
    ], 'آموزش روت گوشی اندروید تنها در چند ثانیه'),
    MenuItemModel([
      ItemModel(null, 'assets/36.jpg', null),
      ItemModel(
          'اگر می خواهید گوشی خود را ریست کنید باید توجه داشته باشید که همه تنظیمات و فایل های حافظه گوشی پاک خواهد شد. دلایل زیادی وجود دارد برای اینکه شما نیاز داشته باشید گوشی اندرویدی خود را ریست کارخانه ای کنید. شاید تعداد زیادی اپلیکیشن بر روی گوشی خود نصب‌کرده‌اید و گوشی شما کند شده است؛ یا آپدیت جدیدی برای گوشی خود دانلود کرده‌اید که باعث ایجاد مشکلاتی در عملکرد گوشی شما شده است؛ یا شاید هم می‌خواهید گوشی خود را ریست کارخانه ای کنید تا آن را بفروشید (وقتی قصد فروش گوشی خود را دارید، بهتر است همیشه گوشی خود را ریست کنید). به‌هرحال در این مطلب نحوه ریست کارخانه ای گوشی‌های اندرویدی را به شما آموزش می‌دهیم که از طریق منوی تنظیمات گوشی یا از طریق بوت لودر -در صورت بالا نیامدن گوشی شما- انجام می‌شود.با توجه به اینکه گوشی‌های اندرویدی در مدل های مختلف و با تعداد بسیار زیاد ارائه شده است، در اینجا ریست کارخانه ای را برای دو گوشی سامسونگ گلکسی S7 و نکسوس 6P آموزش می‌دهیم که مراحل انجام ریست برای سایر گوشی‌ها نیز بسیار شبیه به این دو است. توجه: انجام ریست کارخانه ای کلیه اطلاعات موجود روی گوشی شما را حذف می‌کند. پس بهتر است از کلیه اطلاعاتتان شامل: مخاطبان، عکس‌ها، ویدئوها، فایل‌های متنی و هر اطلاعات شخصی دیگری که به آن نیاز دارید، یک فایل پشتیبان یا همان بکاپ تهیه کنید.',
          null,
          'آموزش ریست فکتوری گوشی اندرویدی'),
      ItemModel(
          'راحت‌ترین روش برای ریست کارخانه ای گوشی‌تان از طریق منوی تنظیمات انجام می‌شود. محل دقیق گزینه ریست کارخانه ای در منو تنظیمات بستگی به گوشی مورد استفاده‌تان، ممکن است کمی متفاوت باشد؛ اما یک‌بار که گزینه «بکاپ و ریست» یا (back up and reset) را پیدا کردید، دیگر با مشکلی مواجه نخواهید شد.',
          null,
          'انجام ریست کارخانه ای از طریق منوی تنظیمات گوشی'),
    ], 'آموزش ریست فکتوری گوشی اندرویدی'),
    MenuItemModel([
      ItemModel(
          'بسیاری از وقت ها عکسهایی را بـه طور تصادفی پاک می‌کنیم و دیگر راهی برای بازگشت نیست . اما در این پست نرم افزاری را معرفی می‌کنیم که می‌تواند تصویر پاک شده را بازیابی کند . در اینجا است که احساس حسرت بـه خاطر از دست دادن عکس هایي با ارزش تمام وجودتان را فرا می گیرد. امروز قصد داریم روشی را برای بازیابی عکسهای با ارزش پاک شده از گوشی اندرویدی شما معرفی کنیم. اپلیکیشن FonePaw Android Data recovery با رابط کاربرپسند خود بـه سادگی عکسهای از دست رفته شما را بازیابی میکند',
          null,
          'بازیابی عکس پاک شده در اندروید '),
      ItemModel(
          'توصیه می کنیم این اپلیکیشن را حتی اگر در حال حاضر بـه آن نیاز ندارید هم نصب کنید، چرا که برای بازیابی عکسهای در صورت از دست دادن آنها، سرعت عمل شرط نخست موفقیت خواهد بود.حال فرض کنید تصویری بـه طور ناخواسته از گوشی شما پاک شده است. نخستین کاری که لازم است انجام دهید، قطع کردن اتصال گوشی خود بـه اینترنت است. چرا که اگر فایل جدیدی از طریق اینترنت وارد گوشی شده و در آن ذخیره شود، بازیابی فایل قبلی بسیار دشوار و حتی غیرممکن خواهد بود. همچنین بـه یاد داشته باشید که این برنامه برای بازیابی تصاویر بـه دسترسی روت نیاز دارد. نکته مهم دیگر این است که این برنامه باید روی کامپیوتر «مک یا ویندوز» نصب شود. پس از نصب، محیط برنامه بـه این شکل خواهد بود. حال گوشی خود را بـه کامپیوتر متصل کرده و حالت Debugging را فعال کنید. اگر پیام مشابهی روی کامپیوتر خود دریافت کردید نیز آن را تایید کنید.',
          'assets/77.jpg',
          null),
      ItemModel(
          'حال می‌توانید نوع فایلی که قصد بازیابی آن را دارید انتخاب کنید. در مرحله بعد اسکن گوشی شما آغاز میشود. در این مرحله پیامی روی گوشی نمایش داده میشود، آن را تایید کنید. پس از تکمیل اسکن، گوشی بـه طور خودکار ریستارت میشود. صبور باشید تا گوشیبه طور کامل روشن و قابل استفاده شود. هر پیامی که برای دسترسی بـه فایل هـای گوشی از سوی این برنامه دریافت کردید را تایید کنید.تمامی فایل هـای حذف شده از گوشی خود را در این صفحه مشاهده می کنید. هرکدام که مدنظر شما است را انتخاب کنید، گزینه recover را انتخاب کنید و کار بـه همین سادگی بـه اتمام می رسد.',
          'assets/78.jpg',
          null),
    ], 'بازیابی عکس پاک شده در اندروید '),
    MenuItemModel([
      ItemModel(
          'مخفی شدن در تلگرام طوری که کسی نداند اسم ما چیست.با خود می گویید امکان ندارد اما ما یک ترفند عالی برای این کار داریم. این روزها انجام کارهای مختلف در تلگرام از جذابیت خاصی برخوردار بوده بنابر این می‌خواهیم ترفندی بسیار جذاب و البته ساده را به شما معرفی کنیم تا دوستانتان را شگفت‌زده کنید! به کمک این ترفند می‌توانید به‌صورت نامرئی (بدون نام) برای دوستان‌تان یا هر کاربر دیگر پیام ارسال کنید. (همچنین می‌توانید نام کانال را نیز نامرئی کنید) به‌عبارت دقیق‌تر همان‌طور که می‌دانید هر کاربر در اپلیکیشن تلگرام باید برای خود یک نام (First name) انتخاب کند و هنگام اختصاص نام اجازه استفاده از فاصله خالی (Space) را ندارد، اما با ترفندی که در ادامه معرفی می‌کنیم یک نام کاملا نامرئی به شما اختصاص می‌یابد.پیش از هر چیز توجه داشته باشید که این ترفند نیازمند تلگرام نسخه دسکتاپ است، اما تغییر نام شما در تمام دستگاه‌ها قابل مشاهده بوده و فقط برای اجرای ترفند به نسخه دسکتاپ تلگرام نیاز خواهید داشت. نرم‌افزار Word از مجموعه آفیس را اجرا کرده و با مراجعه به تب Insert روی Symbol کلیک کرده و در ادامه گزینه More Symbols را انتخاب کنید.در بخش From از پنجره به‌نمایش درآمده گزینه Unicode را انتخاب کرده و در کادر Character Code مقدار ۲۰۰C را تایپ کنید. روی گزینه Shortcut key کلیک کرده و کلیدهای alt+X را از روی صفحه‌ کلید رایانه فشار دهید تا این کلیدها به‌عنوان میانبر برای تایپ کاراکتر موردنظر اختصاص یابد. (در حالت پیش‌فرض نیز این میانبر وجود دارد، اما ممکن است به وسیله نرم‌افزارها تغییر کرده باشد و برای اطمینان از عملکرد میانبر این مراحل طی شده است) اطمینان حاصل کنید هیچ عبارتی در صفحه تایپ نشده است. (کلیدهای Ctrl+A را فشار داده و پس از آن کلید Delete را فشار دهید تا عبارت‌های موجود احتمالی حذف شوند)زبان صفحه‌کلید را به فارسی تغییر داده و از راست به چپ، عبارت جادویی را به روش زیر تایپ کنید: سه مرتبه فشار کلیدهای Alt+X، یک مرتبه فشار کلید Space، سه مرتبه فشار کلیدهای Alt+X توجه: منظور از سه مرتبه فشار کلیدهای Alt+X این است که یک مرتبه کلید Alt را فشار داده و نگه‌دارید سپس کلید X را فشار دهید، کلید Alt و X را رها کرده، دوباره کلید Alt را نگه‌داشته و کلید X را فشار دهید و در پایان باز هم کلیدها را رها کرده و برای مرتبه سوم ضمن فشار کلید Alt و نگهداشتن آن کلید X را نیز فشار دهید. (منظور از فشار کلید X، فشار کلید «ط» در زبان فارسی است) در پایان پس از تایپ کامل عبارت جادویی، کلیدهای Ctrl+A را فشار دهید تا کل کاراکترهای پنهان و پیدای موجود در صفحه به حالت انتخاب درآمده و سپس از تب Home روی آیکون کپی‌کلیک کنید. (می‌توانید از کلیدهای Ctrl+C نیز کمک بگیرید) نرم‌افزار تلگرام دسکتاپ را اجرا کرده و به منوی Settings مراجعه کنید. روی نام خود کلیک کنید و نشانگر ماوس را در کادر نام قرار دهید. کلیدهای Ctrl+A را فشار داده و پس از انتخاب کل نام موجود، کلیدهای Ctrl+V را برای جایگزینی عبارت جادویی کپی شده در حافظه موقت ویندوز فشار دهید. روی گزینه Save کلیک کرده و تغییرات را مشاهده کنید.',
          null,
          'آموزش مخفی شدن در تلگرام جالب و کاربردی'),
    ], 'آموزش مخفی شدن در تلگرام جالب و کاربردی '),
    MenuItemModel([
      ItemModel(null, 'assets/38.jpg', null),
      ItemModel(
          'وقتی در سیستم عامل اندورید هستید و قصد دارید تا نام برنامه مورد نظر را در منو عوض کنید باید به ترفند امروز ما عمل کنید. هر اپلیکیشنی در سیستم‌عامل اندروید، نام مخصوص به خود را دارد و شاید کمتر کاربری به فکر تغییر نام اپلیکیشن باشد، اما مواردی نیز وجود دارد که کاربران ترجیح می‌دهند نام اپلیکیشن‌های موجود در صفحه اصلی دستگاه هوشمندشان را به دلخواه تغییر دهند. به‌عنوان مثال ممکن است کاربری اپلیکیشن نقشه نوکیا با نام Here را روی دستگاه خود نصب کرده و قصد داشته باشد آن را روی صفحه اصلی با نام «نقشه» قرار دهد یا حتی تصویر دلخواه خود را جایگزین آیکون این اپلیکیشن کند. دوست دارید با روش انجام این کار آشنا شوید و از همین حالا شخصی‌سازی عنوان اپلیکیشن‌ها را در دستگاه‌های مجهز به سیستم‌عامل اندروید اجرا کنید؟ اپلیکیشن معرفی شده در این ترفند نه تنها برای انجام این کار شما را یاری می‌کند، بلکه با استفاده از آن می‌توانید میانبرهایی را برای دسترسی به بخش‌ها و ابزارهای مختلف موجود در اندروید نیز به صفحه‌ اصلی دستگاه خود اضافه کنید. به این لینک مراجعه کرده و اپلیکیشن Quick Shortcut Maker را دانلود و روی دستگاه اندرویدی خود نصب کنید: http://tiny.cc/click_quickshortcut به فهرست برنامه‌های نصب شده در دستگاه هوشمند خود مراجعه کرده و برنامه QuickShortcutMaker را اجرا کنید. تب Applications را فعال کرده و روی هریک از اپلیکیشن‌های مورد نظرتان که قصد دارید عملیات تغییرنام یا تغییر آیکون را اجرا کنید، فشار دهید. در بالای صفحه به‌نمایش درآمده مربوط به هر اپلیکیشن، عنوان اپلیکیشن با عبارت Tap to change label قابل مشاهده است. روی این بخش فشار داده و عنوان موردنظرتان را برای اپلیکیشن وارد کنید. در ادامه چنانچه مایل به تغییر آیکون اپلیکیشن هستید روی آیکون اپلیکیشن که با عبارت Tab to change icon همراه شده نیز فشار دهید و با انتخاب گزینه Images، تصویر دلخواهتان را از روی تصاویر ذخیره شده در دستگاه انتخاب کنید. در پایان روی گزینه Create فشار دهید تا میانبر اپلیکیشن با عنوان و آیکون دلخواهتان به صفحه اصلی دستگاه هوشمندتان اضافه شود.',
          null,
          'آموزش تغییر دادن نام برنامه های اندروید '),
    ], 'آموزش تغییر دادن نام برنامه های اندروید '),
    MenuItemModel([
      ItemModel(null, 'assets/39.jpg', null),
      ItemModel(
          'وقتی با اپل واچ کار می کنید می توانید برای تماس های خود از طریق ساعت رد تماس بزنید و به طرف مقابل پاسخی ندهید. روش‌های مختلفی برای رد تماس‌های دریافتی وجود دارد؛ روش‌هایی همچون کشیدن صفحه به سمت آیکون رد تماس، رد تماس و ارسال پیام کوتاه، هدایت تماس گیرنده به صندوق صوتی یا استفاده از کلید کاهش صدا و بی‌صدا کردن دستگاه برای گذر از تماس دریافتی تا زمان منصرف شدن تماس‌گیرنده!گزینه آخر از جمله مواردی است که اغلب کاربران هنگامی که نمی‌خواهند تماسی را رد کنند، اما قصد پاسخگویی به آن را نیز ندارند، استفاده می‌کنند. با استفاده از این روش تنها کاری که انجام می‌شود این است که صدای گوشی شما موقتا قطع می‌شود و دستگاه شما آنقدر زنگ می‌خورد تا فرد تماس‌گیرنده به خیال آن‌که صدای زنگ تماس را متوجه نمی‌شوید یا آن را با خود همراه ندارید از تماس خود پشیمان شده و تماس را قطع کند. این روش با فشار دکمه کاهش صدا روی دستگاه آیفون قابل اجراست، اما آیا می‌دانید روش سریع‌تری نیز برای انجام این کار توسط ساعت هوشمند اپل وجود دارد که شما را از بیرون آوردن آیفون از جیبتان بی‌نیاز می‌کند؟ این ترفند را می‌توانید به روش زیر انجام دهید: تنها کاری که باید هنگام دریافت تماس انجام دهید این است که به محض مشاهده هشدار تماس روی ساعت هوشمند خود، کف دستتان را به‌طور کامل روی صفحه ساعت قرار دهید!با انجام این کار بدون آن‌که به خارج کردن آیفون از جیبتان نیاز داشته باشید، صدای زنگ تماس قطع شده و بدون رد کردن تماس یا هدایت به صندوق صوتی می‌توانید از پاسخگویی به تماس‌های دریافتی صرف‌نظر کنید.',
          null,
          'آموزش رد کردن تماس در اپل واچ '),
    ], 'آموزش رد کردن تماس در اپل واچ '),
    MenuItemModel([
      ItemModel(null, 'assets/40.jpg', null),
      ItemModel(
          'اگر بخواهیم بین دو سیستم عامل یعنی آیفون و اندروید انتقال مخاطبین را انجام دهیم کار به چه صورت خواهد بود؟ما به شما می گوییم. یکی از مسائلی که هنگام تعویض گوشی با آن همراه می شوید مشکل انتقال کانتکت های شماست. بنابراین اگر آیفون راکنار گذاشته و از اندروید استفاده می کنید و نمی خواهید کانتکت ها و آدرس های ایمیلی که در آیفون ذخیره کرده اید را از دست بدهید باید بتوانید تمام شماره ها را از آیفون برای انتقال به اندروید استخراج کنید. این کار خیلی ساده است و تمام چیزهایی که نیاز دارید یک کامپیوتر به همراه مرورگر می باشد. نکته: برخی از گوشی ها نرم افزاری دارند که می توانید با استفاده از آن تمام محتویات را از آیفون به اندروید انتقال دهید. نرم افزارهای Smart Switch سامسونگ و Sync Manager اچ تی سی. اما اگر فقط می خواهید کانتکت ها را انتقال دهید روش ساده زیر را اعمال کنید.',
          null,
          'آموزش انتقال مخاطبین از آیفون به اندروید '),
      ItemModel(
          'برای این کار باید کانتکت ها را از iCloud دریافت کنید و سپس به Google’s contact انتقال دهید. بنابراین ابتدا وارد اکانت خود در سایت iCloud.com شوید. سپس روی گزینه Contacts کلیک کنید.',
          null,
          'شماره ها را از iCloud استخراج کنید'),
      ItemModel(null, 'assets/41.jpg', null),
      ItemModel(
          'در این جا روی گزینه چرخ دنده شکلی که در گوشه چپ پایین صفحه وجود دارد کلیک کنید و گزینه Select All را انتخاب کنید.',
          null,
          null),
      ItemModel(null, 'assets/42.jpg', null),
      ItemModel(
          'دوباره روی گزینه چرخ دنده شکل کلیک کنید. اما این بار گزینه Export vCard را انتخاب کنید. این گزینه تمام کانتکت های شما را به صورت فایل استخراج می کند و در فولدر دانلودها ذخیره می کند.',
          null,
          null),
      ItemModel(null, 'assets/43', null),
      ItemModel(
          'ابتدا با همان اکانتی که برای اندروید در نظر گرفته اید وارد صفحه Google Contacts شوید. در اینجا شاید کمی کار پیچیده شود چون گوگل سایت جدیدی راطراحی کرده است و این سایت جدید فایل های vCard را پشتیبانی نمی کند. نوار آبی بالای صفحه نشان دهنده سایت جدید است. اگر می خواهید وارد سایت قدیمی شوید روی گزینه More کلیک کنید و در منویی که باز می شود گزینه Leave the Contacts preview را انتخاب کنید.',
          null,
          'وارد کردن کانتکت ها به گوگل کانتکت (Google Contacts)'),
      ItemModel(null, 'assets/45.jpg', null),
      ItemModel(
          'در این جا صفحه سایت قدیمی باز می شود. گزینه Import Contacts را از منوی سمت چپ صفحه انتخاب کنید.',
          'assets/46.jpg',
          null),
      ItemModel(
          'سپس در صفحه ای که باز می شود گزینه Choose File را انتخاب کنید. سپس فایل vcf که از سایت iCloud دانلود کرده بودید را انتخاب کنید. در انتها روی گزینه Import کلیک کنید تا تمام کانتکت های آیفون به اکانت گوگل شما اضافه شود.',
          'assets/47.jpg',
          null),
      ItemModel(
          'همگام سازی کانتکت ها در اندروید معمولا اندروید به صورت اتوماتیک کانتکت ها را همگام سازی می کند اما اگر این اتفاق نیفتاد وارد منوی Settings شوید و گزینه Accounts را انتخاب کنید. روی گزینه Google کلیک کنید. در این صفحه گزینه Contacts را فعال کنید و منتظر بمانید تا کانتکت ها همگام سازی شوند.',
          'assets/48.jpg',
          null),
      ItemModel(null, 'assets/49.jpg', null),
    ], 'آموزش انتقال مخاطبین از آیفون به اندروید '),
    MenuItemModel([
      ItemModel(
          'تا به حال به این فکر کرده‌اید که اگر تلفن همراه هوشمندتان مفقود شد، چکار کنید؟دزدیده شدن تلفن‌های همراه هوشمند علاوه بر ضرر مالی می‌تواند زیان‌های دیگری نیز برای مالکان آنها به همراه داشته باشد.یکی از مهمترین موضوعات هنگام مفقود شدن تلفن همراه اطلاعاتی است که در آن وجود دارد و با ورود تلفن‌های همراه هوشمند میزان اطلاعاتی که افراد برروی تلفن‌های خود ذخیره می‌کنند افزایش چشمگیری داشته است.وجود اطلاعاتی نظیر شماره حساب‌های بانکی، اطلاعات شخصی و عکس‌های خصوصی می‌تواند مالک تلفن همراه را با دردسرهایی مواجه کند. در این راستا مدیر یک شرکت ارائه دهنده خدمات تلفن همراه با اشاره به نرم‌افزارهای موجود برای کمک به مالباختگان گفت: نرم‌افزارهای رایگانی وجود دارند که هم برروی تلفن‌های همراه اپل و هم برروی تلفن‌های همراه اندرویدی قابل اجرا بوده و این امکان را فراهم می‌کنند تا مکان تلفن همراه مفقود شده را به اطلاع مالک آن برسانند.به گزارش پارس ناز ، وی تصریح کرد: به دارندگان تلفن‌های همراه هوشمند توصیه می‌شود تا نرم‌افزارهای پولی را برروی تلفن خود نصب کنند که این نرم‌افزارها مالک تلفن را قادر می‌سازد تا پس از مفقود شدن تلفن از راه دور اطلاعات موجود برروی آن را پاک کند.',
          'assets/82.jpg',
          'هنگام سرقت شدن موبایل چه کار باید کرد؟'),
    ], 'هنگام سرقت شدن موبایل چه کار باید کرد؟'),
    MenuItemModel([
      ItemModel(null, 'assets/50.jpg', null),
      ItemModel(
          'با ترفند مفید آیفون با شما هستیم,بسیاری مواقع پیش می آید که ما مجبوریم مخاطب گوشی خود را بلاک کنیم. در آیفون این ترفند را به شما آموزش می دهیم. کاربران iOS برخی از شماره‌های مزاحم را مسدود می‌کنند ولی در کمال تعجب باز هم شاهد تماس از طرف این شماره‌ها هستند. اما راهکاری وجود دارد تا بتوانید شماره های مسدود شده را دیگر مشاهده نکنید. هیچ سیستم تاییدی در مخابرات وجود ندارد تا بررسی کند که شماره Caller ID که توسط شخص تماس گیرنده در سیستم قرار گرفته است، شماره‌ای است که آن شخص به طور قانونی مالک آن است. یکی از کارمندان نیویورک تایمز در این باره می‌گوید: برای سالیان دراز، Caller ID نیویورک تایمز ۱۱۱-۱۱۱۱(۱۱۱) بود. من به عنوان یک نویسنده در نیویورک تایمز کار می‌کردم و زمانی که شماره آن‌ جا بر روی تلفن من ظاهر می‌شد، من متوجه می‌شدم که چه کسی است. (در حقیقت پیش‌بینی می‌کردم.)با این اوصاف، گاهی اوقات غیرممکن است که تمام مزاحم تلفنی‌ها را مسدود کرد، زیرا بسیاری از مردم و سازمان‌ها که به شما نیاز دارند  از ترفند Caller ID استفاده می‌کنند. سرویس‌ها و نرم‌افزارهای ارزان و حتی رایگانی وجود دارند که تمام تماس‌ها را یک جا مسیریابی می‌کنند.در نتیجه گروهی از افراد مزاحم ممکن است توسط شماره‌های مختلفی با شما تماس بگیرند. این کارمند نیویورک تامیز در ادامه از تجریبات خود می‌گوید: اخیرا، تعدادی افراد مزاحم با من تماس گرفته‌اند که به نظر می‌رسد این تماس‌ها تنها از محدود کد محلی من نیست (۲۰۶ در ایالت واشنگتن) و از مناطق دیگری این تماس‌ها گرفته شده است. به طوری که شماره آن‌ها با سه عدد مانند ۱۲۳ در شماره تلفن ۴۵۶-۱۲۳ آغاز می‌شود. البته این موضوع باعث خواهد شد که من راحت‌تر شماره‌ها را از هم تشخیص داده و به آن‌ها پاسخ دهم. Jeff Carlson یکی از کارمندان Macworld نیز مشکل خود را در این زمینه این‌گونه مطرح کرد: من یک مخاطب در گوشی خود ساختم و شماره تمام مزاحم تلفنی‌های خود را در آن وارد کردم و در نهایت آن مخاطب را بلاک کردم. اما با این وجود، هنوز هم از طرف شماره‌های موجود در این مخاطب تماس دریافت می‌کنم. این موضوع برای من آزاردهنده است. به نظر شما چطور می‌توانم این شماره‌ها را مسدود کنم؟ iOS این امکان را برای کاربران خود فراهم ساخته است تا بتوانند یک شماره یا مخاطب را انتخاب کرده و آن را مسدود نمایند.Jeff تلاش می‌کرد تا با بلاک کردن مخاطب و سپس افزودن شماره‌ها به عنوان شماره‌های اسپم به آن مخاطب خاص به سرعت آن‌ها را مسدود نماید. اما متاسفانه اپل مسدود کردن مخاطبین به این شکل را نمی‌پذیرد. در واقع در سیستم‌عامل اپل می‌بایستی شماره‌های هر فرد را به صورت جدا مسدود کرد. زیرا زمانی که شما به یک مخاطب مسدود شده خود شماره‌ای را اضافه می‌کنید تا آن شماره نیز بلاک شود، سیستم‌عامل iOS آن مخاطب مورد نظر را به‌روز رسانی نمی‌کند. در نتیجه شماره جدیدی که اضافه شده است در لیست شماره‌های بلاک شده قرار نمی‌گیرد. بنابراین به جای این که ابتدا شماره مورد نظر خود را به مخاطب خاص خود که شامل شماره‌های مسدود شده است، اضافه نمایید، مراحل زیر را برای بدست آوردن نتیجه مطلوب طی کنید: ۱- ابتدا دکمه i را که در سمت راست شماره فرد مورد نظر (phone number) در Recents list قرار دارد ، بفشارید. ۲- به قسمت پایینی بیایید و گزینه Block This Caller را انتخاب نمایید. ۳- با انتخاب گزینه Block Contact این عمل را تایید نمایید. ۴- حالا گزینه Add to Existing Contact را انتخاب کرده، در میان مخاطب‌های خود جستجو کنید، مخاطب مربوطه که در آن شماره‌های اسپم را ذخیره می‌سازید، پیدا کنید و شماره خود را به آن اضافه نمایید. مرحله آخر به افرادی که در بلاک کردن دستی شماره‌ها تنبلی می‌کنند، کمک خواهد کرد. هم‌چنین در صورتی که شماره اسپم به شکل عجیبی از لیست سیاه شما پاک شده باشد، این روش گره‌گشا خواهد بود. (شما می‌توانید لیست سیاه خود را از مسیر Settings > phone > Blocked پیدا کنید. در این قسمت شما می‌توانید به صورت دستی شماره‌ها را از طریق گزینه Add New که در پایین لیست قرار دارد به این لیست اضافه نمایید.) در iOS9، اپل یک جستجوی داخلی به منظور تطابق شماره‌ای که شخص در گوشی خود مشاهده می‌کند، با شماره تلفن تعبیه شده در ایمیل یا هر مکان دیگری در iOS اضافه کرده بود. اما این ویژگی زمانی به درستی کار می‌کرد که شما یک لیست از تمام شماره‌های اسپم خود داشتید که iOS می‌توانست به آن رجوع کند، در غیر این صورت آن ویژگی جستجوی اپل نیز کارایی نداشت و آن شماره‌ها به طور مرتب تغییر می‌کردند. اپل در مراسم WWDC اخیر خود به این نکته اشاره کرد که او این شرایط را برای اپراتورهای تلفن فراهم خواهد کرد تا به بانک اطلاعاتی شماره‌های ناخواسته متصل شوند و شماره تماس گیرنده را زمانی که تماسی با شما گرفته می‌شود در صفحه اصلی نمایش دهند. با این روش دیگر شماره‌هایی مانند ۱۱۱-۱۱۱۱(۱۱۱) در گوشی شما ظاهر نخواهند شد و باعث سردرگمی شما نمی شود. این کار دقیقا مشابه این است که شماره‌های اسپم را به مخاطب اسپم خود اضافه نمایید.',
          null,
          'آموزش بلاک کردن مخاطبین در آیفون '),
    ], 'آموزش بلاک کردن مخاطبین در آیفون '),
    MenuItemModel([
      ItemModel(null, 'assets/52.jpg', null),
      ItemModel(
          'تلگرام قابلیت به اشتراک گذاشتن فیلم و عکس ها را هم دارد و این موارد به مرور زمان باعث اشغال حافظه و کاهش سرعت می گردد. شاید عده ای هنوز روش پاکسازی cache تلگرام خود را ندادند پس با آموزش زیر همراه باشید.تلگرام در ایران پر طرفدارترین شبکه اجتماعی است که در کنار محبوبیت هایش مشکلاتی نیز دارد. نرم‌افزار تلگرام امکانات بسیار خوبی را در اختیار کاربران قرار می‌دهد، اما با به‌وجود آمدن کانال‌ها برای کاربران خود دردسرهای زیادی ایجاد کرده است.یکی از این مشکلات پشتیبانی نکردن از قابلیت حذف اطلاعات دریافت شده در کانال ها بود و بسیاری از کاربران به‌خصوص کاربران دستگاه‌های اندرویدی که از ظرفیت ذخیره‌سازی محدودی روی دستگاه خود برخوردار بودند با مشکل کمبود فضای خالی روی دستگاه مواجه می‌شدند. این مشکل به گوش سازندگان این نرم‌افزار رسیده و کاربران می‌توانند بدون دردسر و بدون نیاز به نرم‌افزارهای مدیریت فایل، حافظه کش و فایل‌های دانلودی توسط این برنامه را از روی دستگاه هوشمند خود پاکسازی کنند. مدیریت Cache در نسخه جدید تلگرام به شما این امکان را می‌دهد اطلاعات موردنظر مربوط به هر کانال یا همه کانال‌ها را به‌راحتی حذف کرده و در صورت نیاز با مراجعه مجدد به کانال موردنظر، آنها را از سرورهای ابری تلگرام فراخوانی کنید.این قابلیت از نسخه 3.3.2 به بعد به پیام رسان تلگرام افزوده شده و برای سیستم‌عامل اندروید و آی‌او‌اس قابل استفاده است. اما شاید عده ای هنوز روش پاکسازی cache تلگرام خود را ندادند .برای بهره‌مندی از این قابلیت و پاکسازی حافظه کش نرم‌افزار به این روش عمل کنید: 1ـ ابتدا به یکی از آدرس های زیر مراجعه کرده و نرم‌افزار تلگرام نصب شده روی دستگاه هوشمند خود را به جدیدترین نسخه به‌روزرسانی کنید: Android:https://telegram.org/dl/android iOS: https://telegram.org/dl/ios 2ـ نرم‌افزار را اجرا کرده و پس از مراجعه به منوی اصلی روی Settings فشار دهید. 3ـ اکنون با اسکرول کردن صفحه تنظیمات و مراجعه به بخش Cache Settings گزینه‌های مختلفی برای پاکسازی حافظه کش در اختیار شما قرار می‌گیرد',
          null,
          'فضای اشغال شده توسط تلگرام را آزاد کنید'),
      ItemModel(
          'پاکسازی cache تلگرام 4ـ شما می‌توانید با فشار روی گزینه Clear Cache و انتخاب هر یک از موارد دلخواه، عملیات پاکسازی حافظه را آغاز کنید. (عملیات پاکسازی حافظه کش، فقط اطلاعات دریافت شده در حافظه را حذف می‌کند و این اطلاعات اعم از ویدئو، صوت، عکس و… در سرورهای ابری تلگرام موجود بوده و با دسترسی مجدد شما به کانال موردنظر دوباره فراخوانی شده و در اختیار شما قرار می‌گیرد. پس نگران از دست رفتن اطلاعات خود نباشید.) نکته: در سیستم‌عامل آی‌او‌اس می‌توانید حافظه کش مرتبط با چت‌های فرد به فرد را نیز پاکسازی کرده و در سیستم‌عامل اندروید، این پاکسازی محدود به کانال‌ها و سوپر گروه‌ها می‌شود. نکته دیگری که باید به آن توجه داشته باشید مقدار مقابل گزینه‌ Keep Media در صفحه تنظیمات حافظه است. در این بخش می‌توانید مقادیر مختلفی همچون همیشه، یک هفته و یک‌ماه را انتخاب کنید که انتخاب گزینه‌های یک هفته و یک ماه موجب می‌شود تا اطلاعات ذخیره شده در حافظه کش به‌طور خودکار پس از مشاهده نکردن مجدد در مدت زمان مشخص شده، از روی دستگاه حذف شوند.',
          'assets/51.jpg',
          null),
    ], 'فضای اشغال شده توسط تلگرام را آزاد کنید'),
    MenuItemModel([
      ItemModel(null, 'assets/53.jpg', null),
      ItemModel(
          'اگر تکست و یادداشتی در آیفون خود نوشته اید و به اشتباه آن را پاک کرده اید جای نگرانی نیست چون قابل بازگردانی است. اگر شما هم مطالب مهم خود را در اپلیکیشن یادداشت آیفونتان می نویسید همراه ما باشید تا اگر احیانا یک زمانی یادداشت هایتان را به اشتباه پاک کردید آنها را در عرض چند دقیقه بازگردانید. حتماً تا به‌ حال با مشکل پاک شدن و یا پاک کردن غیرعمدی یادداشت‌ها در اپلیکیشن‌های یادداشت نویسی تلفن‌های همراه مواجه شده اید. احتمالاً بعضی از این یادداشت‌ها مهم و حیاتی بوده‌اند و از دست دادن آن‌ها چیزی شبیه به فاجعه است. اما نگران نباشید در این گزارش به شما خواهیم گفت که چگونه یادداشت‌های پاک شده خود را در دستگاه‌های اپل مثل آیفون یا آی پد بازیابی کنید.',
          null,
          'بازگردانی تکست پاک شده در آیفون '),
      ItemModel(
          'گام اول: اپلیکیشن یادداشت‌برداری اپل با نام Notes را باز کنید. گام دوم: معمولاً این اپلیکیشن به عنوان آخرین مورد در صفحه نمایش تلفن همراه یا آی پد نمایش داده می‌شود، آیکون اپلیکیشن را به گوشه سمت چپ پایین صفحه نمایش انتقال دهید. گام سوم: پایین صفحه، پوشه‌ای به نام Recently deleted قرار دارد. در این فولدر یا پوشه تمام یادداشت‌هایی که در طول ۳۰ روز گذشته پاک شده‌اند، قرار دارند و از آنجا می‌توان تمام یادداشت‌هایی که در طول ۳۰ روز یا یک ماه گذشته پاک شده‌اند را بازیابی کرد. گام چهارم: بر روی پوشه Recently deleted کلیک کنید و دکمه edit در گوشه سمت راست پایین را باز کنید.روی یادداشتی که می‌خواهید بازیابی شود، کلیک کنید و به همین روش هر تعداد یادداشت پاک شده‌ای را که می‌خواهید بازیابی کنید، انتخاب کنید. گام پنجم: روی دکمه Move to که در گوشه سمت چپ پایین قرار دارد کلیک کنید. پوشه مقصد را انتخاب کنید. در صورتی که پوشه خاصی برای یادداشت‌ها ندارید، در این مرحله می‌توانید پوشه موردنظر را بسازید.گفتنی است ؛ با این روش فقط می‌توانید یادداشت‌هایی را که در طول ۳۰ روز گذشته و نه بیشتر پاک شده‌اند را بازیابی کنید.',
          null,
          'آموزش بازیابی یادداشت های پاک شده در آیفون و آیپد:'),
    ], 'بازگردانی تکست پاک شده در آیفون '),
    MenuItemModel([
      ItemModel(
          'همیشه ممکن است پیام های مزاحمی از شماره های مختلف برای ما ارسال شوند که باید به طریقی آن ها را بلاک کنیم. در این مطلب با شما هستیم تا نحوه مسدود کردن پیام‌های متنی بر روی گوشی‌های مختلف اندروید را آموزش دهیم.',
          null,
          'بلاک کردن پیام های مزاحم در اندروید '),
      ItemModel(
          'برای مسدود کردن پیام‌ها بر روی گوشی‌های نکسوس مانند ۶P یا ۵X دو راه وجود دارد، اولین راه این است که مکالمه مخاطب موردنظر خود را باز کنید. بر روی More یا عبارت بیشتر که با سه نقطه نشان داده شده است ضربه بزنید. گزینه People & Option را انتخاب کنید و بر روی عبارت Block که به معنی مسدود کردن است ضربه بزنید. شما همچنین می‌توانید اپلیکیشن پیام‌رسان را باز کنید و بر روی مکالمه‌ای که می‌خواهید آن را مسدود کنید ضربه بزنید، گوشه بالا سمت راست بر روی Block ضربه بزنید و گزینه Ok را انتخاب کنید.',
          null,
          'برای گوشی‌های نکسوس'),
      ItemModel(
          'مانند نکسوس، گوشی‌های سامسونگ نیز برای مسدود کردن پیام‌های متنی دو راه دارند.یک راه این است که پیام‌ها را باز کنید و مکالمه فرد موردنظر خود را انتخاب کنید . بر روی آیکن بیشتر ضربه بزنید، گزینه Block number را باز کنید. سپس این گزینه را روی On قرار دهید.  روش دیگر این است که به مسیر زیر بروید: Messanger > More >Settingبر روی Block messages ضربه بزنید و یک جعبه آنجا مشاهده می‌کنید که می‌توانید لیست مسدود شده‌ها را در آنجا با عنوان Block list ببینید. در اینجا به صورت دستی نام مخاطب خود را اضافه می‌کنید و بر روی علامت + ضربه بزنید یا از inbox یا لیست مخاطبان خود یکی را اضافه کنید. زمانی که تمام مخاطبان مورد نظر خود را به لیست اضافه کردید بعد فلش برگشت را انتخاب کنید.',
          null,
          'برای گوشی‌های سامسونگ'),
      ItemModel(
          'فرایند مسدود کردن در گوشی LG سریع و سر راست است. تفاوتی که گوشی‌های LG با سایر گوشی‌ها دارد این است که به جای مفهوم مسدود کردن، از اسپم استفاده می‌شود و به این صورت پیام‌ها مسدود می‌شود. اپلیکیشن پیام‌رسانی LG را باز کنید. بر روی SMS یا MMS مخاطب موردنظر ضربه بزنید. به مسیر زیر بروید: Menu > Register spam number and check or uncheck Delete all messages of the selected number به خاطر داشته باشید که این قسمت کاملا اختیاری است و می‌توانید آن را انتخاب نکیند. این گزینه به شما می‌گوید که بعد از مسدود کردم پیام مخاطب مورد نظر همه پیام‌های آن مخاطب حذف می‌شود.با این روش، مخاطب یا شماره موردنظر مسدود می‌شود و از سمت آن پیامی دریافت نمی‌کنید.',
          null,
          'برای گوشی‌های LG'),
      ItemModel(
          'فرایند مسدود کردن بر روی گوشی‌های HTC نیز مانند گوشی‌های LG سریع است. پیام‌رسان را باز کنید بر روی مکالمه مورد نظر خود ضربه بزنید تا زمانی که Message Options یا گزینه‌های پیام ظاهر شود. بعد گزینه Block contact را انتخاب کنید.',
          null,
          'برای گوشی‌های HTC'),
    ], 'بلاک کردن پیام های مزاحم در اندروید '),
    MenuItemModel([
      ItemModel(
          'در تلگرام قابلیتی وجود دارد به نام Secret chat که در ان هیچ اثری از پیام ها در گوشی دو طرف باقی نخواهد ماند و پاک خواهد شد. تلگرام یکی از پیام‌رسان‌های امن و محبوب در میان کاربران دنیای مجازی است. کاربران زیادی برای ارسال پیام، محتوا و عضویت در گروه‌ها و کانال‌های مختلف از تلگرام استفاده می‌کنند. امنیت و امکاناتی چون گروه‌ها، ابرگروه‌ها و کانال‌ها، تلگرام را به یکی از برترین اپلیکیشن‌ها پیام‌رسان تبدیل کرده است.تلگرام دارای گزینه‌ای به اسم “Secret Chat” است. کلیک به شما توصیه می‌کند وقتی که می‌خواهید چت کنید، از “Secret Chat” استفاده کنید. “Secret Chat” امکانات جالب امنیتی و کاربردی را در اختیار شما می‌گذارد که در ادامه مطلب به آنها می‌پردازیم.',
          null,
          'در تلگرام حتما از  Secret chat استفاده کنید '),
      ItemModel(
          'در حالت “Secret Chat” کلیه پیام‌های متنی و محتویات (ویدیو و عکس) که میان شما ردبدل می‌شود، رمزگذاری می‌شود و به غیر از شما و گیرنده پیام کسی امکان دسترسی به پیام‌ها و محتویات آنها را نخواهد داشت. وقتی برای چت‌ کردن از “Secret Chat” استفاده می‌کنید به هیچ عنوان پیام‌های شما در سرورهای تلگرام ذخیره نمی‌شود.',
          null,
          'استفاده از سیستم‌رمزگذاری “End-to-End”:'),
      ItemModel(
          'این قابلیت به شما برای از بین بردن پیام‌ها کمک می‌کند. شما برای پیام‌ها خود زمان مشخصی را تعریف می‌کند، سپس در آن زمان پیام‌های شما به صورت خودکار در دستگاه طرفین از بین خواهند رفت. با این کار از امکان سوء استفاده از پیامهای خود جلوگیری می‌کنید.',
          null,
          'قابلیت “Self Destruct”:'),
      ItemModel(
          'در حالت “Secret Chat” وقتی پیامی را پاک می‌کنید، این پیام هم در گوشی شما و هم در گوشی مخاطب شما پاک خواهد شد.',
          null,
          'قابلیت پاک کردن پیام در دستگاه طرفین:'),
      ItemModel(
          'در حالت “Secret Chat” امکان “Forward” پیام‌ها را ندارید. این موضوع بسیار مهم است. چرا که در حالت معمول وقتی پیامی را “Forward” می‌کنید، در بالای پیام نام کسی را که شما پیام آن را “Forward” کردید را نوشته می‌شود که این مورد از نظر امنیتی نامناسب است. nmاطلاع‌رسانی در هنگام گرفتن اسکرین‌شات از صفحه چت: اگر مخاطب شما از صفحه چت اسکرین‌شات بگیرید، تلگرام به شما خبر می‌دهد. نکاتی که در استفاده از “Secret Chat” باید به آنها توجه کنید شامل این موارد است: تنها در چت با یک نفر امکان استفاده از “Secret Chat” را دارید و هنوز این قابلیت برای چت‌های گروهی راه‌اندازی نشده است. امکان استفاده از “Secret Chat” در نسخه دسکتاپ تلگرام موجود نیست. برای استفاده از “Secret Chat”، کافی است از طریق منوی تلگرام گزینه “New Secret Chat” را انتخاب کنید و سپس از لیست مخاطبین خود مخاطب مورد نظر را انتخاب کنید. اکنون در محیطی امن با مخاطب مورد نظر خود چت کنید.',
          null,
          'عدم امکان “Forward” پیام‌ها:'),
    ], 'در تلگرام حتما از  Secret chat استفاده کنید '),
    MenuItemModel([
      ItemModel(
          'اطلاعات بسیاری از موبایل ها توسط کدهای مخفی قابل دسترسی است و بشتر کسانی که در کار خرید و فروش گوشی هستند با این کدها سر و کار دارند. برنامه نویسان، اغلب مسیرهای مخفی برای دسترسی به برخی اطلاعات مهم را در برنامه خود قرار می‌دهند تا اینکه در زمان به وقوع پیوستن اشکال، بتوانند به سرعت آن ایرادات را رفع نمایند. دسترسی به این مسیرهای مخفی که تنها خود برنامه نویس از آن آگاه است، تنها از طریق وارد کردن کد امنیتی امکان‌پذیر است. این شیوه، از زمان ابداع تلفن همراه تاکنون، به همین منوال دنبال می‌شود.شاید شما نام پروتکل “USSD” را شنیده باشید. این پروتکل که با نام‌ “کد سریع” نیز در میان کاربران شناخته شد است، می‌تواند این امکان را بدهد تا به اطلاعات پایه بر روی گوشی خود، دسترسی پیدا کنید. این پروتکل، در اصل برای گوشی‌هایی با فناوری رادیویی GSM ساخته شد، اما پس از مدتی، تعدادی از گوشی‌هایی که با فناوری رادیویی CDMA نیز کار می‌کنند نیز توانستند از آن استفاده نمایند. امروز قصد داریم ۷ کد USSD را به شما معرفی نماییم که با استفاده از آن‌ها، می‌توانید به اطلاعات مختلفی بر روی گوشی خود دسترسی داشته باشید.',
          null,
          'دهای مخفی موبایل و فهمیدن اطلاعات'),
      ItemModel(
          'وارد صفحه تماس شوید و کد *#۱۲۳۴۵#۳۰۰۱* را شماره گیری کنید تا به فضای Field Mode بروید. در این بخش، شما می‌توانید اطلاعاتی در خصوص شبکه‌های داخلی یا شبکه‌هایی که در اطراف شما قرار گرفته‌اند را بدست آورید. علاوه بر این، اگر در مکانی قرار دارید که سیگنال‌های دریافتی از طریق اپراتورهای تلفن بسیار ضعیف است، می‌توانید راه کارهایی را در این حالت برای افزایش میزان دریافت سیگنال‌ها توسط دکل‌های تلفن همراه انجام دهید. شایان ذکر است که این قابلیت، در ایران قابل دسترسی نیست و در تست‌های انجام شده، نتیجه‌ای حاصل نشد.',
          null,
          '۱- دسترسی به Field Mode از طریق شماره‌گیری *#۱۲۳۴۵#۳۰۰۱*'),
      ItemModel(
          'این ویژگی، بر روی گوشی‌های اندوریدی کاربرد دارد. با این روش شما می‌توانید برخی امکانات ابتدایی را بر روی تلفن هوشمند خود، در یک فضای جدید و ساده در دسترس داشته و از آن استفاده نمایید. کارهایی مانند تغییر رنگ صفحه نمایش، فعالسازی دوربین، ویبره و … را با انتخاب گزینه‌هایی که به نمایش در می‌آیند، انتخاب کرده و از این قابلیت‌ها بهره ببرید و یا حتی گوشی خود را تست کنید.',
          null,
          '۲- دسترسی General Mode با شماره گیری #*۰#*'),
      ItemModel(
          'IMEI یک شماره منحصر به فرد است و در هر تلفن هوشمند، با دیگری متفاوت خواهد بود. شاید کاربران در طول استفاده از موبایل، نیاز چندانی برای دانستن این شماره نداشته باشند اما در برخی نقاط، شرکت‌های سرویس دهنده شبکه‌های ارتباطی، از این کد برای ثبت نام دستگاه شما در لیست خود استفاده می‌کنند.',
          null,
          '۳- نمایش IMEI با شماره گیری #۰۶#*'),
      ItemModel(
          'در زمان‌هایی که مشغول کار مهمی هستید و نمی‌توانید به تماس‌ها پاسخ‌گو باشید، قادر هستید آن‌ها را به شماره‌ای دیگر انتقال دهید. گزارشات در خصوص شماره‌ای که تماس‌ها روی آن دایورت می‌شود، با شماره گیری کد بالا در اختیار شما قرار خواهد گرفت. در گوشی‌هایی با سیستم عاملiOS، برای تغییر شماره مقصد، وارد تنظیمات شوید و در قسمت Phone، گزینه Call Forwarding را انتخاب نمایید. بر روی گوشی‌های اندروید (البته بسته به نسخه سیستم عامل و مدل گوشی، ممکن است متفاوت باشد) وارد برنامه Phone شده و آیکون “بیشتر” (همان سه نقطه زیر هم) را انتخاب نمایید. با انتخاب Call وارد More Setting شده و Call Forwarding را فعال کرده و شماره مورد نظر را در لیست اضافه کنید.',
          null,
          '۴- چک کردن انتقال تماس با شماره گیری #۶۷#*'),
      ItemModel(
          'ممکن است در برخی شرایط، نتوانید به هنگام زنگ زدن تلفن در همان لحظه به آن پاسخ دهید. با فعال‌سازی این حالت، به شخصی که با شما تماس می‌گیرد، اعلام می‌شود که باید منتظر بماند. شخص در صورت تمایل می‌تواند صبر کند تا شما به تماسش پاسخ دهید.',
          null,
          '۵- فعال کردن حالت انتظار تماس با شماره گیری #۴۳*'),
      ItemModel(
          'در ابتدا باید اشاره داشته باشیم که این کد فقط بر روی گوشی‌های سامسونگ گلکسی قابل اجراست. با این روش، می‌توانید با انتخاب هر گزینه به صورت جداگانه، امکانات دستگاه‌تان را چک کنید. به نظر این ویژگی، در زمان خرید تلفن هوشمند، بسیار کار آمد خواهد بود و کمک زیادی در تشخیص سالم بودن اجزا اصلی گوشی می‌کند به خصوص وقتی که قصد خرید یک تلفن هوشمند کارکرده را داشته باشید.',
          null,
          '۶- منو تنظیمات سریع با شماره گیری #۷۳۵۳#*'),
      ItemModel(
          'باز هم باید اشاره کنیم که این کد تنها بر روی گوشی‌های سامسونگ گلکسی قابلیت اجرا دارد. به هر حال، با استفاده از این کد، قادر هستید اطلاعاتی در خصوص Firmwork نصب شده بر روی گوشی را مشاهده کنید.',
          null,
          '۷- دسترسی به اطلاعات Firmware با شماره گیری #۱۲۳۴#*'),
    ], 'کدهای مخفی موبایل و فهمیدن اطلاعات '),
    MenuItemModel([
      ItemModel(null, 'assets/54.jpg', null),
      ItemModel(
          'گوشی چون همیشه همراه ما است در معرض خطر قرار دارد که یکی از این خطرها افتادن در آب یا خیس شدن است.در این مواقع شما باید گوشی خود را نجات دهید. شاید برای خود و یا اطرافیانتان پیش آمده باشد که به طور اتفاقی گوشی همراهتان خیس شود و سراسیمه به دنبال نجات گوشی باشید و گاهی اوقات برخی از اقدامات نا به جا برای حفظ گوشی نیز می تواند کاملا به مرگ آن منتهی شود. بنابراین بهتر است این مطلب را درباره اقدامات سریع و درست برای حفظ گوشی خیس شده خوانده و به خاطر بسپارید تا در صورت اتفاق، گوشی خود و یا دیگران را از نابودی کامل نجات دهید!',
          null,
          'وقتی گوشی خیس شد چکار کنیم؟ '),
      ItemModel(null, null, '1. تا حد امکان به سرعت گوشی را از آب خارج کنید.'),
      ItemModel(null, 'assets/55.jpg',
          '2. اگر فورا گوشی را از محل آب خارج کنید، ممکن است گوشی شما دچار صدمات زیاد نشده باشد.'),
      ItemModel(null, null,
          '3. پس از خارج کردن گوشی از آب، فورا چند دستمال کاغذی و یا پارچه نرم آورده و گوشی را روی آن قرار دهید و در عین حال خودتان شروع به خارج کردن درب باطری و باطری کنید.'),
      ItemModel(null, 'assets/56.jpg',
          '4. اگر داخل گوشی سیم کارتی قرار دارد، آن را نیز خارج کنید.'),
      ItemModel(null, 'assets/57.jpg',
          '5. هر گونه وسایل جانبی متصل به گوشی اعم از هدفون، مموری کارت، جلد مبایل و… را خارج کنید.'),
      ItemModel(null, 'assets/58.jpg',
          '6. گوشی را با یک پارچه و یا حوله نرم خشک کنید.'),
      ItemModel(null, 'assets/59.jpg', '7. از جارو برقی استفاده کنید.'),
      ItemModel(null, 'assets/60.jpg',
          '8. با استفاده از یک ماده با قدرت جذب بالا ، رطوبت موجود در دستگاه را از بین ببرید. یکی از مواد در دسترس و عالی برنج خام است که می تواند رطوبت را جذب کند.'),
      ItemModel(null, 'assets/61.jpg',
          '9. اجازه دهید گوشی مدتی روی حوله ، دستمال و یا هر گونه دستمال کاغذی جاذب باقی بماند. بهتر است در یک محل آفتابی باشد تا به خشک شدن هر چه بیشتر هر گونه نقاط کوچک و غیرقابل دسترس کمک کند.'),
      ItemModel(null, 'assets/62.jpg',
          '10. گوشی را تست کنید. پس از گذشت حداقل 24 ساعت و یا بیشتر، به گزارش پارس ناز چک کنید که تمام قسمت های گوشی تمیز و خشک به نظر برسد.'),
    ], 'وقتی گوشی خیس شد چکار کنیم؟ '),
    MenuItemModel([
      ItemModel(
          'شماره های مزاحم را می توانید در واتس اپ بلاک کنید تا خیالتان در این برنامه آسوده باشد.ما به شما نحوه بلاک کردن را آموزش می دهیم. این روزها علاوه بر اپلیکیشن تلگرام، اپلیکیشن واتس‌اپ نیز به دلیل پشتیبانی از قابلیت برقراری تماس تلفنی، یکی از محبوب‌ترین اپلیکیشن‌ها در میان کاربران ایرانی به‌شمار می‌رود. همان‌طور که می‌دانید این اپلیکیشن علاوه بر تماس تلفنی، از قابلیت پیام‌رسانی نیز پشتیبانی کرده و به شما این امکان را می‌دهد با دوستان و آشنایان خود مکاتبه کنید. یکی از گزینه‌های بسیار ضروری در چنین اپلیکیشن‌هایی پشتیبانی از قابلیتی برای مسدود کردن کاربرانی است که به هر دلیل احتمال دارد برای شما مزاحمت ایجاد کنند. این قابلیت در واتس‌اپ نیز وجود دارد و چنانچه شما یک مزاحم تلفنی داشته باشید یا کاربری با ارسال پیام‌های متنی برایتان ایجاد مزاحمت کند، می‌توانید ‌براحتی با استفاده از قابلیت موجود، عملیات مسدودسازی کاربر را اجرا کنید.',
          null,
          'بلاک کردن شماره ها در واتس اپ '),
      ItemModel(
          'اپلیکیشن واتس‌اپ را روی دستگاه هوشمندتان اجرا کرده و صفحه ارسال پیام به مخاطب موردنظر را باز کنید. می‌توانید با مراجعه به منوی Contacts روی نام مخاطب موردنظر فشار دهید یا در سیستم‌عامل آی‌او‌اس گزینه Chats را انتخاب کنید.در پنجره گفت‌وگو روی آیکون منو فشار داده یا کلید منو روی دستگاه هوشمندتان را فشار دهید. از منوی به‌نمایش درآمده گزینه‌ More را انتخاب کرده و روی Block فشار دهید. در سیستم‌عامل آی‌او‌اس روی شماره تلفن یا نام مخاطب فشار داده و گزینه Block this Contact را انتخاب کنید.در پنجره تائید روی OK فشار دهید. (در سیستم‌عامل آی‌او‌اس روی Block فشار دهید)از حالا به بعد مخاطب موردنظر شما در لیست سیاه مسدود شده‌ها قرار گرفته و قادر به ارسال پیام یا برقراری تماس با شما نخواهد بود.',
          null,
          'مسدودسازی در واتس‌اپ:'),
      ItemModel(
          'برای انجام این کار می‌توانید از دو روش کمک بگیرید: روش اول: از بخش Contacts روی نام مخاطب مسدود شده فشار داده و چند لحظه صبر کنید سپس از منوی به ‌نمایش درآمده گزینه Unblock را انتخاب کنید. (این روش برای اجرا روی تعداد مخاطبان کم توصیه می‌شود) روش دوم: با فشار آیکون منوی اصلی یا کلید منوی اصلی، به بخش Settings در واتس‌اپ مراجعه کرده و گزینه Account را انتخاب کنید. در ادامه به بخش Privacy مراجعه کرده و روی Blocked Contacts فشار دهید. در پایان از فهرست به‌نمایش درآمده روی هریک از مخاطبان موردنظر فشار داده و با انتخاب گزینه Unblock در پنجره به‌نمایش درآمده، فرمان رفع مسدودی را صادر کنید. (در سیستم‌عامل آی‌او‌اس باید پس از انتخاب مخاطبان موردنظر صفحه را به پایین اسکرول کرده و Unblock this Contact را فشار دهید)',
          null,
          'رفع مسدودیت در واتس‌اپ:'),
    ], 'بلاک کردن شماره ها در واتس اپ '),
    MenuItemModel([
      ItemModel(null, 'assets/64.JPG', null),
      ItemModel(
          'بک آپ گیری از واتس آپ می تواند باعث دردسر برای شما شود چون می توان با ورود به دیتای واتس آپ از نسخه پشتیبان گیری شده استفاده کرد. محققان امنیتی هشدار دادند مکالمات و پیام های حذف شده در واتساپ را می توان هم چنان خواند و از آن ها استفاده کرد. طبق گفته های محققان امنیتی واتساپ پیام هایی که به آرشیو می فرستید را حذف نمی کند. جاناتان زدزیارسکی دریافت که در دستگاه های اپل “ردیابی قانونی” تمام گفتگو های “حذف شده، پاک شده یا آرشیو شده” وجود دارد. این بدان معناست که علی رغم ناپدید شدن پیام ها از دستگاه تان، همان طور که انتظار دارید، ردی از مکالمه هم چنان در تلفن باقی مانده است و افرادی که به دستگاه مربوط دسترسی دارند می توانند این رد را به “حالت اولیه اش” درآورند.این انتظار مبنی بر ناپدید شدن مکالمات حذف شده از گوشی برای کاربران واتساپ منطقی می باشد، به خصوص آن که واتساپ تمرکزش را بر امنیت و حریم خصوصی گذاشته است. این برنامه اخیرا رمزگذاری پیوسته ای را معرفی کرده است. اما این برنامه به جای حذف درست و کامل پیام ها، حافظه یا به اصطلاح نسخه پشتیبانی از مکالمات دارد که می تواند با استفاده از ابزارهای قانونی که توسط نیروهای قانون یا هر کس دیگری که به آن دسترسی دارد استفاده شود آن را برگرداند. زدزیارسکی می گوید: “حفظ اطلاعات حذف شده در یک دستگاه امن در واقع مسئله مهمی به شمار نمی آید اما هنگامی که آن اطلاعات به راحتی بروز می کنند مانند آن که در پایگاه اطلاعاتی واتساپ انجام می شود بیانگر خطر جدی برای حریم خصوصی می باشد”. اطلاعات واتساپ در آیفون یا آیپدتان به طور کدگذاری شده ذخیره نمی شود. اگر چه حالا این سرویس پیام رسان از رمزگذاری پیوسته استفاده می کند اما منحصرا برای اطلاعاتی به کار می رود که میان دستگاه ها انتقال داده شده باشد در نتیجه نمی توان آن پیام را خواند یا جدا کرد. آن اطلاعاتی که شامل رد مکالمات حذف شده است به طور خودکار در آیکلود کپی می شود چه کاراکتر همگام آیکلود قادر باشد چه نباشد، که هم چنین رمزگذاری هم نشده و شخص سومی می تواند آن را بخواند. این بدان معناست که هر کسی به دستگاه یا کامپیوتر مرتبط با دستگاه دسترسی داشته باشدمی تواند به پیام ها دسترسی پیدا کند به خصوص اگر کاربر برای حفاظت از ذخایر یا کپی هایش از رمز عبور استفاده نکند.تنها راه حذف کلی اطلاعات این است که خود برنامه را به طور کلی حذف کنید. طبق گفته های زدزیارسکی، اگر چه کاربران واتساپ نیازی نیست از لو رفتن اطلاعات یا بهتر است بگوییم مکلماتشان بترسند، اما واتساپ توسعه گران نرم افزاری را مجبور کرده تا در طراحی محصولات جدید ردیابی قانونی را در نظر بگیرند. او می گوید: “طراحی هایی که آن ها هنگام توسعه یک برنامه پیام رسانی امن انتخاب می کنند مفاهیم خاصی برای روزنامه نگاران، معاندان سیاسی، کسانی که در کشور به آزادی بیان احترام نمی گذارند و افراد دیگر دارد. گاهی اوقات طراحی ضعیف منجر می شود افراد بی گناه و گاهی اوقات افراد در برابر آزادی بسیار قاطع هستند به زندان بیافتند.”فیسبوک با بیش از ۷۰ درصد از درخواست ها برای اطلاعات با دولت انگلیس موافقت کرده که مشمول اطلاعات واتساپ نیز می شود. بعضی از آن اطلاعات می تواند شامل پیام های رمزگذاری نشده یا کسانی که فکر می کردند اطلاعات شان حذف شده است باشد.',
          null,
          'بازیابی پیام های پاک شده در واتس آپ '),
    ], 'بازیابی پیام های پاک شده در واتس آپ '),
    MenuItemModel([
      ItemModel(
          'شما می توانید روی گوشی خود از طریق کامپیوتر و دسکتاپ برنامه ها و نرم افزارها را نصب کنید.با این ترفند کاربردی همراه ما باشید. اگر تا کنون با سیستم گوگل پلی کار کرده باشید می دانید که می توانید از این طریق روی گوشی خود، نرم افزارها را نصب کنید. اما بسیاری از افراد هستند که امکان دانلود نرم افزار و نصب را روی گوشی خود ندارند و نمی توانند از بسیاری برنامه ها بهره مند باشند. اما یک راه حل فرعی و مناسب و ساده برای نصب نرم افزار روی گوشی اندرویدی یا تبلت اندرویدی وجود دارد. نرم افزار  Pure APK Install، در واقع زمینه ای فراهم می کند که کاربر بتواند از طریق دسکتاپ و ویندوز، بر روی حافظه داخلی یا خارجی گوشی خود نرم افزارهای apk مورد نظرش را نصب کند.بدین منظور نرم افزار مورد نظر را از طریق لینک انتهای متن دانلود کنید. فرایند نصب را که به سادگی و در کمترین مراحل صورت می گیرد دنبال کنید و در نهایت بعد از نصب، نرم افزار را اجرا کنید. در این مرحله فایل apk مورد نظر خود را از طریق بخش جستجوی نرم افزار پیدا کنید.',
          null,
          'نصب برنامه روی گوشی از طریق کامپیوتر '),
      ItemModel(null, 'assets/70.jpg', null),
      ItemModel(
          'حالا گوشی را با کابل به لپ تاپ خود وصل کنید. در هنگام عملیات نصب نباید اسکرین گوشی خاموش شود و یا اینکه گوشی به صورت قفل شده باشد چرا که عملیات نصب انجام نمی شود. زمانی که نرم افزار، فایل مورد نظر را پیدا کرد، محل نصب آن را انتخاب کنید و بعد روی دکمه ی Install کلیک کنید.',
          null,
          null),
      ItemModel(null, 'assets/71.jpg', null),
      ItemModel(
          'بعد از این می توانید فرایند نصب را در کمتر از دقیقه ای مشاهده کنید. زمانی که نرم افزار نصب شد، آیکون مورد نظر روی گوشی مشاهده می شود.Pure APK Install دارای قابلیت های امنیتی است که انواع فایل های مخرب برای ویندوز و گوشی را تشخیص می دهد و از نصب آن ها روی گوشی جلوگیری می کند.',
          null,
          null),
    ], 'نصب برنامه روی گوشی از طریق کامپیوتر '),
    MenuItemModel([
      ItemModel(
          'آیا می دانستید که می توانید از پیام های خود در تلگرام پرینت تهیه کنید؟ما به شما این مطلب را آموزش خواهیم داد. در این گزارش می خواهیم به شما آموزش دهیم چطور می توانید پیام های تلگرام خود را به صورت پي دي اف دخيره كنيد و يا پرينت بگيريد.',
          null,
          'آموزش گرفتن پرینت از پیام در تلگرام '),
      ItemModel(
          'به آدرس سايت زير مراجعه كنيد: Web.telegram.org', null, 'گام اول :'),
      ItemModel(
          'بعد از اينكه وارد اين قسمت شديد ، كافي است  که کشور خود را انتخاب کرده و شماره تلفن مورد نظر را وارد کنید. سپس وارد حساب كاربري خود شويد كه در اين مرحله يك كد براي شما ارسال ميشود تا تلگرام فعال شود.این مرحله مانند زمانی است که میخواهید تلگرام را بروی کامپیوتر خود فعال کنید.',
          null,
          'گام دوم:'),
      ItemModel(
          'در صورتي كه تمايل داشته باشيد پيام هاي خود و بك كاربر خاص را پرينت بگيريد كافي است از دكمه ميانبر  CTRL+P  استفاده كنيد .',
          null,
          'گام سوم:'),
      ItemModel(
          'در اين قسمت پنجره اي براي شما باز ميشود كه ميتوانيد به صورت پي دي اف ذخيره و يا پرينت بگيريد.در صورتی که میخواهید فقط به صورت pdf داشته باشید باید گزینه print+pdf انتخاب و در فولدر مناسب ذخیره کنید. در غیر این صورت در این مرحله نام پرینتر خود را انتخاب کنید.',
          null,
          'گام چهارم:'),
      ItemModel(
          'هر اندازه از پيام هاي خود را ميخواهيد در پرينت داشته باشيد ، كافي است كه با اسكرول انتخاب كنيد و به سمت بالا برويد.',
          null,
          'گام پنجم :'),
    ], 'آموزش گرفتن پرینت از پیام در تلگرام '),
    MenuItemModel([
      ItemModel(
          'ipad وسیله مناسبی برای یادگیری و سرگرمی کودکان است اما باید به این نکته هم توجه داشته باشیم که کودکان همیشه کنجکاو هستند و ممکن است از طریق اینترنت به سایت های نامناسب هدایت شوند. در این آموزش، شیوه بلاک کردن محتوا و سایت های نامناسب بر روی IOS را توضیح خواهیم داد. بلاک کردن سایت ها از نسخه ۷ به سیستم عامل IOS اضافه شد و مسیر فعال کردن این قابلیت بر روی نسخه های مختلف چندان متفاوت نیست. ابتدا باید به قسمت General تنظیمات خود بروید و سپس گزینه Restriction را فعال کنید. اگر برای اولین بار است که از این امکان استفاده می کنید باید کلمه عبوری را برای آن مشخص کنید. سپس با پیمایش صفحه، قسمتی با عنوان Websites را در انتها لیست مشاهده خواهید کرد.',
          null,
          'محدود کردن دسترسی کودکان در IOS '),
      ItemModel(null, 'assets/73.png', null),
      ItemModel(null, 'assets/74.png', null),
      ItemModel(
          'در ادامه گزینه All Websites را غیرفعال کنید و سپس گزینه Limit Adult Content برای محتوای غیراخلاقی و یا گزینه Specific Websites را برای دیگر سایت ها فعال کنید. بعد از این باید سایت های که قصد بلاک آن ها را دارید در قسمت Never Allow اضافه کنید. برای این کار Add Website را در زیر Never Allow انتخاب کنید. به همین سادگی کودکان خود را در برابر محتوای نامناسب شبکه مجازی محافظت کرده اید. گفتنی است این شیوه محافظ نه تنها بر روی اپلیکیشن های خود IOS عمل می کند بلکه دیگر مرورگرها یا نرم افزارها را نیز از دسترسی به محتوا مورد نظر شما منع می کند.',
          null,
          null),
    ], 'محدود کردن دسترسی کودکان در (IOS) '),
    MenuItemModel([
      ItemModel(null, 'assets/75.jpg', null),
      ItemModel(
          'هک تلگرام موردی است که همه آنرا نقض میکنند اما همزمان د رفضای مجازی اقدام به فروش هک نیز می شود.به تازگی و برای چندمین بار در چند ماه اخیر شاهد شایعه پراکنی جدیدی در رابطه با تلگرام و هک شدن یا نشدن آن در فضای مجازی هستیم. در تازه‌ترین شایعه‌ای که توسط یک فایل صوتی پخش شده و دست به دست می‌شود یک شخص ادعا می‌کندکه تلگرام یکی از دوستان نزدیک وی، تنها با کپی یک کد عددی هک شده است و سعی به هشدار دادن به کاربران دیگر با تشریح این موضوع دارد. اما آیا به راستی نیازی به هشدار در این رابطه هست؟ آیا واقعا روشی که در این فایل صوتی به آن اشاره می‌شود امکان‌پذیر است؟ روشی که این شخص به آن اشاره می‌کند و مدعی است که تلگرام دوستان او با این روش هک شده به این صورت است که یک شخص (غریبه یا حتی یک دوست) با بهانه‌ی اینکه توسط تلگرام شما ریپورت شده است برای اینکه رفع ریپورت شود یک کد عددی را به شما ارسال می‌کندو از شما می‌خواهد که همان کد را کپی کرده و مجددا برای او ارسال کنید. این شخص تاکید می‌کند که این کد ارتباطی به کد ارسال شده توسط تلگرام برای ورود به اکانت ندارد. اگر شما نیز با خواندن این مطلب، یا شنیدن فایل صوتی آن مانند این شخص نگران شده‌اید باید توجه شما را به چند نکته جلب کنیم.',
          null,
          'آیا این صحبت درباره هک تلگرام صحیح است؟'),
      ItemModel(
          'این موضوع نه تنها صحت ندارد بلکه به نوعی غیر ممکن است. تنها کمی آگاهی از مسائل تخصصی و امنیت محتوا کافی است تا متوجه شویم که چنین موضوعی از ریشه غلط است و نمی‌تواند صحت داشته باشد.اما حتی اگر هم آگاهی خاصی از مسائل تخصصی و امنیتی ندارید با کمی تامل می‌توانیدمتوجه غیر عقلانی بودن این موضوع شوید که چرا باید ارسال یک پیام عادی و عددی به یک شخص باعث آسیب پذیر شدن اکانت شما شود؟',
          null,
          'نکته‌ی اول'),
      ItemModel(
          'حتی اگر پاول دورف (صاحب اصلی تلگرام) هم آن سوی گفتگو نشسته باشد با پیام‌هایی که شما برای او ارسال می‌کنید هیچ کاری نمی‌تواند علیه امنیت شما کندچرا که اصلا چنین موضوعی شدنی نیست. بگذارید برای درک بهتر غیرممکن بودن این ماجرا یک مثال ساده بزنیم. روش ادعا شده در این موضوع درست مانند آن است که شما برای یکی از دوستان خود مبلغی را کارت به کارت کنید و با این کار آن شخص به حساب بانکی شما دسترسی پیدا کند',
          null,
          null),
      ItemModel(
          'شایعات زیاد در مورد تلگرام بسیار عجیب است که احتمالا این موضوع به دلیل تعداد مخاطبان چند ۱۰ میلیونی تلگرام در ایران است که شایعه‌های آن نیز به نسبت مخاطبان آن بیشتر از اپلیکیشن‌های دیگر است. در هر صورت خوشبختانه تلگرام یکی از امن‌ترین راه‌های ارتباطی است و اگر از لحاظ امنیتی بالاتر از فیسبوک، واتس‌اپ،لاین، وایبر، یا سرویس‌های ایمیل همچون جیمیل، یاهو و‌… یا حتی موارد ایرانی همچون بیسفون، ساینا و‌… نباشد بدون شک کمتر نیز نخواهد بود و اگر بنا به این باشد که به امنیت تلگرام شک کنیم بدون هیچ درنگی باید به دیگر شبکه‌های ذکر شده نیز شک کرد. البته بدیهی است که هیچ سیستم الکترونیکی در دنیا غیرقابل نفوذ نیست و هکرهای بسیار متخصص و حرفه‌ای احتمالا قادر به نفوذ به تمام این شبکه‌ها خواهند بود اما موضوعی که باید به آن توجه کنید این است که هکری که تا این میزان تخصص و قدرت نفوذ دارد چرا باید حاصل تلاش و تخصص خود را به صورت اینترنتی و با قیمت‌های نازل بفروشد یا از جهتی دیگر چرا باید وقت و انرژی خود را روی چنین موارد بی‌ارزشی بگذارد در حالی که می‌تواند با صرف همان قدرت روی شبکه‌ها و هدف‌های بزرگ‌تر، یک شبه سود کلانی به جیب بزند.',
          null,
          'نکته‌ی دوم'),
      ItemModel(
          'نکته‌ی سومی که باید برای چندمین بار به آن اشاره کنیم نوش داروی غیر قابل نفوذ تلگرام است که متاسفانه هنوز بسیاری از کاربران به آن بی‌توجه هستند. این نوش دارو که با عنوان Two Step Verification در تنظیمات تلگرام قرار دارد می‌تواند یک رمز عبور روی اکانت شما تنظیم کندتا حتی اگر فردی به هر طریق به کد ورودی تلگرام شما دسترسی پیدا کرد به بن بست بزرگی یعنی رمز عبور برخورد کند. درواقع کاربران می‌توانند با فعالسازی این ویژگی یک بار برای همیشه خیال خود را در رابطه با هر شایعه‌ای که در باره‌ی هک تلگرام منتشر می‌شود راحت کنند. یک جستجوی ساده در گوگل کافی است تا با انبوهی از فریب‌های تبلیغاتی مختلف برای هک تلگرام مواجه شوید. از اینکه تمام این روش‌ها تنها یک فریب تبلیغاتی بوده و چیزی جز سوءاستفاده از اعتماد شخص مورد نظر و برداشتن کد ارسالی تلگرام از گوشی او نیست بگذریم. اما حتی اگر یک روزی فرد بسیار متخصصی (که مطمئن باشید فروشندگان اینترنتی جزو این افراد نخواهند بود) پیدا شود که مانند باگ SS7 موفق به دسترسی از راه دور به کد ارسالی تلگرام شود فعال بودن سپر دفاعی تلگرام یعنی Two Step Verification به طور کامل نفوذ آن شخص را با شکست مواجه می‌کند. پس اگر تا به امروز این ویژگی را در تلگرام خود فعال نکرده‌اید حتما توسط روش زیر این امر را انجام دهید.برای این کار به تنظیمات تلگرام وارد شده و به بخش Privacy بروید. گزینه‌ی Two Step Verification را لمس کنید تا به مرحله‌ی تعیین رمز عبور وارد شوید. رمز مورد نظر خود را وارد کنید.',
          null,
          'نکته‌ی سوم'),
      ItemModel(
          'بعد از دومین باری که رمز خود را برای تایید وارد می‌کنید، از شما درخواست Password Hint یا راهنمای یادآوری رمز خواهد شد که در صورت تمایل می‌توانید آن را وارد کنید و در غیر این صورت، بدون وارد کردن حرف یا کلمه‌ای در آن، به مرحله‌ی بعد بروید. مرحله‌ی بعد باید یک ایمیل معتبر وارد کنید تا در صورتی که رمز عبور خود را فراموش کردید،از این ایمیل برای بازیابی آن استفاده کنید. با وجود آنکه در این مرحله نیز می‌توانید با لمس گزینه‌ی Skip از وارد کردن ایمیل بی‌نیاز شوید، قویا پیشنهاد می‌کنیم که یک ایمیل معتبرو البته خصوصی در این بخش وارد کنید یا حداقل رمزی را برای اکانت خود انتخاب کنید که احتمال فراموش کردن آن نزدیک به صفر باشد. با انجام این کار، مرحله‌ی تعیین رمز عبور به اتمام خواهد رسید و از این پس، چنین روش‌هایی امنیت اکانت شما را به خطر نخواهند انداخت.',
          'assets/76.jpg',
          null),
    ], 'آیا این صحبت درباره هک تلگرام صحیح است؟ '),
    MenuItemModel([
      ItemModel(
          'یکی از مشکلاتی که همواره گریبان گیر موبایل داران بوده و هست ، مخفی سازی عکسها ، ویدئو ها و در کل فایلهای خود بنا به هر دلیلی بر روی گوشی بوده است. بدین منظور نیز برنامه های جانبی متعددی عرضه شده است که هر کدام در نوع خود مشکلاتی دارند. اما در صورتی که گوشی شما از نوع سری N نوکیاست (N80،N73،N70و…) ، با استفاده از ترفندی که هم اکنون برای شما معرفی خواهیم کرد میتوانید به سادگی و بدون نیاز به برنامه خاصی فایلهای خود را از داخل گالری خود محو نمایید به نوعی که فایلها کاملأ موجود باشند اما در داخل گالری گوشی ناپدید شوند!',
          'assets/79.jpg',
          'مخفی سازی عکسها ، ویدئو ها در گوشی'),
      ItemModel(
          'وارد منوی گوشی شده و به فولدر Tools بروید. سپس وارد File Manager شوید. اکنون با زدن کلید سمت راست یا اسکرول گوشی ، وارد Memory Card شوید. سپس به فولدر Other رفته و با استفاده از Options > New Folder یک فولدر جدید بسازید و نام آن را Contacts قرار دهید. داخل فولدر Contacts شده و در داخل آن فولدر دیگری ایجاد کنید و نام آن را mobna یا هر نام دلخواه دیگری بگذارید. اکنون از این دو پوشه به عقب بازگردید و به صفحه اصلی File Manager در Memory Card رجوع کنید. حال میتوانید به دلخواه خود برای مخفی سازی ویدئوها به Videos و برای مخفی سازی عکسها به به فولدر Images بروید. سپس بر روی فایل مورد نظر خود که قصد مخفی سازی آن را دارید Options > Move to folder را انتخاب کنید و سپس برای مسیر آن ، فولدری که به تازگی ایجاد کردید یعنی Memory Card / Other / Contacts / mobna را تعیین نمایید و OK کنید. کار تمام است ، پس از این عمل ،  فایل شما از داخل گالری حذف شده است و به هیچ وجه در داخل آن نمایش پیدا نمیکند. برای مشاهده فایل نیز خودتان میتوانید به شکل مخفیانه ، از طریق File Manager گوشی به محلی که فایل را به آنجا منتقل کردید یعنی Other / Contacts مراجعه کنید. در صورتی که میخواهید فایل مجدد داخل گالری نمایش پیدا کند کافی است آن را از درون این فولدر جدید خارج کنید و به محل قبلی منتقل کنید',
          null,
          'برای مخفی سازی فایل های خود:'),
    ], 'مخفی سازی عکسها ، ویدئو ها در گوشی'),
  ];

  static List<CodeModel> codelist = [
    CodeModel('*#0228#', 'وضعیت باتری'),
    CodeModel(
      '*#*#4636#*#*',
      'نمایش اطلاعات درباره دستگاه',
    ),
    CodeModel('*#*#4636#*#*', 'منوی آزمایش'),
    CodeModel('*#*#7780#*#*', 'بازگرداندن به وضعیت کارخانه'),
    CodeModel('*#*#34971539#*#*', 'اطلاعات دوربین'),
    CodeModel('*2767*3855#', 'پاک کردن کامل دستگاه'),
    CodeModel('*#*#7594#*#*', 'تغییر رفتار دکمه پاور'),
    CodeModel('*#*#0283#*#*', 'آزمایش مسیریابی بسته‌ها'),
    CodeModel('*#*#0673#*#*', 'آزمایش صدا'),
    CodeModel('*#*#2663#*#*', 'بررسی نسخه نمایشگر لمسی'),
    CodeModel('*#*#0*#*#*', 'آزمایش LCD'),
    CodeModel('*#*#2664#*#*', 'آزمایش صفحه لمسی'),
    CodeModel('*#*#0588#*#*', 'آزمایش حس‌گر مجاورتی'),
    CodeModel('*#*#232331#*#*', 'آزمایش بلوتوث'),
    CodeModel('*#*#232337#*#', 'بررسی آدرس بلوتوث دستگاه'),
    CodeModel('*#06#', 'نمایش شماره سریال گوشی (IMEI )'),
    CodeModel('*#*#8351#*#*', 'فعال‌سازی حالت شماره‌گیری صوتی'),
    CodeModel('*#*#8350#*#*', 'غیرفعال کردن حالت شماره‌گیری صوتی'),
    CodeModel('*#3282*727336*#', 'مشاهده وضعیت استفاده از داده‌ها'),
    CodeModel('*#872564#', 'کنترل اتصال یو‌اس‌بی'),
    CodeModel('#*#0*', 'منو اطلاعات گوشی'),
    CodeModel('*#*#1111#*#*', '	نمایش نسخه نرم افزار FTA'),
    CodeModel('*#*#3264#*#*', 'نمایش نسخه RAM'),
    CodeModel('*#*#197328640#*#*', 'حالت تست'),
    CodeModel('*#*#0842#*#*', 'تست روشنایی و لرزش'),
    CodeModel('*#*#1575#*#*', 'تست کامل GPS'),
  ];

  static List<AppModel> applist = [
    AppModel(
        'Zapya',
        'assets/icons/zap.png',
        'Zapya - File Transfer, Share Apps & Music Playlist',
        'زاپیا سریعترین ابزار انتقال فایل در جهان از استودیوی برنامه نویسی  DewMobile برای دستگاه های مختلف از جمله اندروید می باشد که توسط آن قادر خواهید بود با سرعت 2 مگابایت بر ثانیه دقیق 10 برابر سرعت 3G به انتقال فایل از طریق وای فای برای دوستان خود بپردازید . با این اپلیکیشن قادر خواهید بود هر آنچه را که در حافظه اسمارت فون خود دارید با سرعتی بالا ارسال کنید و یا به صورت گروهی به انتقال و دریافت فایل بپردازید . امکان ارسال و دریافت فایل ها، برنامه ها، بازی ها و تمامی اطلاعاتی ک برروی هر دو گوشی شما و طرف مقابل وجود دارد، در برنامه تعبیه شده است. اگر از کاربرانی هستید که دوست دارید اطلاعات گوشیتان را برای دوستانتان ارسال کنید همین الان با روش قدیمی بلوتوث خداحافظی کنید و به زاپیا سلام کنید!',
        'https://play.google.com/store/apps/details?id=com.dewmobile.kuaiya.play'),
    AppModel(
        'Adobe Photoshop',
        'assets/icons/ps.png',
        'Adobe Photoshop Express:Photo Editor Collage Maker',
        ' یک برنامه ویرایش عکس حرفه ای از شرکت Adobe است که برای گوشی‌های موبایل عرضه شده است. این برنامه گزیده ای از امکانات نرم افزار قدرتمند Photoshop برای ویرایش عکس را در اختیار کاربران اندرویدی قرار می‌دهد. امکاناتی مانند ویرایش‌های نور، رنگ، کنتراست، اشباع رنگ و…، ساخت کلاژ با چند تصویر، اضافه کردن متن و استیکر روی عکس و ده ها ابزار کاربردی دیگر.',
        'https://play.google.com/store/apps/details?id=com.adobe.psmobile'),
    AppModel(
        'Telegram',
        'assets/icons/tele.png',
        ' Telegram',
        'تلگــرام یک مسنجر قدرتمند، رایگان و بسیار عالی از کمپانی Digital Fortress برای سیستم عامل اندروید می باشد که با تمرکز برروی دو فاکتور مهم سرعت و امنیت بسیار بالا طراحی گردیده است و به کاربران این امکان را می دهد که با سرعتی بسیار بالا عکس ها، ویدئوها، فایل ها و متن های دلخواه خودشان را برای دوستانتان در هر کجای این کره ی خاکی که باشند بفرستند! بله این مسنجر بسیار شبیه به اپلیکیشن معروف واتس آپ می باشد با این تفاوت که ویژگی هایی که تلگرام در اختیار کاربران قرار می دهد نسبت به واتس آپ بیشتر است و آن را به همه ی کاربرانی که به دنبال یک مسنجر رایگان و کم نظیر هستند پیشنهاد می دهیم! در نرم افزار Telegram شما این امکان را در اختیار دارید که به صورت نامحدود به چت کردن با دوستان و آشنایان خود بپردازید، اتاق های چتی تا بی نهایت نفر را ایجاد کنید و به صورت گروهی به چت کردن بپردازید، فایل های مختلف خود از جمله ویدئو تا ۱+ گیگابایت را ارسال کنید و از بابت همیشه داشتن پیام هایتان خیالتان راحت باشد چرا که همه ی پیام های شما ذخیره خواهند شد تا بتوانید به آن ها دسترسی داشته باشید.',
        'https://play.google.com/store/apps/details?id=org.telegram.messenger'),
    AppModel(
        'MX Player',
        'assets/icons/mx.png',
        'MX Player',
        'یکی از بهترین و قدرتمندترین نرم افزارهای ویدئو پلیر برای گوشی های با سیستم عامل اندروید است که با داشتن آن برروی اسمارت فون خود دیگر نیازی به هیچ ویدئو پلیری نخواهید داشت چرا که تمام انتظاراتی را که از یک پلیر کامل دارید در MX Player گنجانده شده است. این ویدئو پلیر قادر است تمامی فیلم های شما با هر فرمتی که باشد را با کیفیت فول اچ دی پخش کند و در صورت داشتن زیرنویس آن ها را با وضوح بالا نمایش دهد. یکی از دلایل محبوبیت این ویدئو پلیر محیط کاربری یوزر فرندلی و زیبای آن است که هر کاربری را جذب خود خواهد کرد! ویدئوپلیرهای مختلفی برای اندروید عرضه شده است که تقریبا همه ان ها در سایت معرفی شده و در این میان ام اکس پلیر توانسته نظر کاربران سراسر جهان را به سمت خودش جلب کند و کاربران بیشتر شیفته کیفیت بالای ساخت این ویدئوپلیر شده اند چرا که ویدئوها را با بالاترین کیفیت ممکن نمایش می دهد! اگر به دنیال کامل ترین، ساده ترین و در عین حال حرفه ای ترین ویدئوپلیر اندرویدی هستید تحت هیچ شرایطی MX Player Pro را از دست ندهید!',
        'https://play.google.com/store/apps/details?id=com.mxtech.videoplayer.ad'),
    AppModel(
        'Swift Key',
        'assets/icons/sw.png',
        'SwiftKey Keyboard',
        'یکی از بهترین، محبوب ترین و زیباترین کیبوردهای موجود در مارکت گوگل پلی برای تبلت ها و گوشی های اندروید می باشد که به صورت رایگان عرضه شده تا به امروز حدود ۵۰۰ میلیون بار توسط کاربران اندرویدی سراسر جهان تنها از گوگل پلی دریافت شده است و نسبت به کیبوردهای رایگان و پولی دیگر در رده ی اول قرار دارد! این کیبورد با پشتیبانی خود از همه ی زبان های دنیا از جمله زبان شیرین فارسی و امکانات بی نظیر خود توانسته است کاربران زیادی را به سمت خود بکشاند! اگر دوست دارید سرعت تایپ خود را بالا ببرید و تجربه ی یک تایپ سریع را داشته باشید کیبورد SwiftKey Keyboar قطعا بهترین گزینه خواهد بود چرا که اندازه دکمه ها، فاصله از یکدیگر، سایز نوشته ها و … تماماً به صورت استاندارد طراحی شده است و خود با سایز صفحه نمایش شما تنظیم می شود و سرعت تایپ شما را تا حد قابل چشمگیری افزایش می دهد.',
        'https://play.google.com/store/apps/details?id=com.touchtype.swiftkey'),
    AppModel(
        'Picsart',
        'assets/icons/picsart1.png',
        'PicsArt – Photo Studio',
        'کامل ترین، بهترین و قدرتمندترین و پرطرفدارترین اپلکییشن ویرایش تصویر (Photo Editor) برای اندروید می باشد که با دانلود بیش از ۷۰ میلیون بار و با دارا بودن امتیاز ۴٫۴ از ۵٫۰ در پلی استور محبوب ترین فوتو ادیتور به شمار می رود که با نصب ان برروی اسمارت فون خود می توانید یک استودیوی عکس فوق العاده را در اندرویدفون خود به ارمغان بیاورید و با استفاده از ابزارهای بی نظیری که در اختیار شما قرار می دهد تجربه ی کار با بهترین و کامل ترین برنامه فوتو ادیتور را داشته باشید. اپلیکیشن فوق تمام ابزارهایی را که برای ویرایش تصویر احتیاج دارید را در اختیار قرار می دهد و می توان ان را قدرتمندترین نرم افزار ویرایش عکس برای اندروید نام برد! شما این امکان را در اختیار دارید تا از میان ده ها افکت فوق العاده در دسته بندی های منحصر به فرد به صورت دلخواه برروی عکس هایتان اعمال کنید و رنگ و رویی تازه را به عکس هایتان ببخشید! نکته قابل توجه این نرم افزار دانلود +۵۰۰ میلیونی ان از مارکت گوگل است که مطمئنا نظر هر کاربر اندرویدی را جلب می کند تا ان را امتحان نماید و به ظمت ان پی ببرد!',
        'https://play.google.com/store/apps/details?id=com.picsart.studio'),
    AppModel(
        'Call Recorder',
        'assets/icons/call.png',
        'Call Recorder - ACR',
        'یک نرم افزار قدرتمند، پرطرفدار و رایگان برای ضبط تماس های تلفنی ورودی و خروجی مخصوص سیستم عامل اندروید می باشد که با داشتن آن برروی اسمارت فون و یا تبلت اندرویدیتان می توانید به صورت خودکار تماس های خودتان را ذخیره نمایید! با این برنامه مهم نیست که تماس گیرنده شما باشید یا شخصی دیگری، شما می توانید تمامی تماس هایی که می گیرید و تماس هایی که دریافت می کنید را ضبط نمایید و در حافظه ی دستگاه اندرویدی خودتان ذخیره کنید! اپلیکیشن فوق دارای رابط کاربری عالی و طراحی بسیار زیبا و کاربرپسندی است و امکان شخصی سازی بسیاری از تنظیمات را نیز به کاربر می دهد تا تجربه ی بهترین و کاربردی ترین اپلیکیشن ضبط مکالمات را در گوشی خود به ارمغان بیاورد.',
        'https://play.google.com/store/apps/details?id=com.nll.acr'),
    AppModel(
        'WhatsApp Messenger',
        'assets/icons/what.png',
        'WhatsApp Messenger',
        'واتس اپ مسنجر یکی از محبوب ترین نرم افزارهای مسنجر و چت برای انواع سیستم عامل ها اعم از اندروید، آی او اس و ویندوز فون است و امروز جدیدترین ورژن آن برای اندروید آماده کرده ایم، با این مسنجر می توانید با استفاده از اتصال های ۲G، ۳G، ۴G، EDGE و یا وای فای و به صورت رایگان برای دوستان و خانواده ی خود عکس ، یادداشت صوتی ، پیام های ویدئویی و متن بفرستید و به چت کردن به صورت گروهی و یک نفره پرداخته و یا به ارسال اس ام اس بپردازید، منظور از رایگان این است که تنها شما هزینه اینترنت را برای چت با دوستان پرداخت می کنید و از شارژ پولی سیمکارت شما هزینه ای کاسته نمی شود! انواع قابلیت های مختلف در مسنجر واتس اپ برای ارتباط شما با مخاطبینتان در سراسر جهان فراهم شده است و شما می توانید به صورت نامحدود (بدون محدودیت) به صورت تمام وقت از ان ها استفاده کنید. با واتس اپ میتوانید به طور رایگان با دیگران تماس تلفنی نیز داشته باشید یا برایشان پیام بفرستید، حتی اگر آن ها در کشور دیگری زندگی کنند! همانطور که گفته شد تنها هزینه ای که باید بپردازید پهنای باند اینترنتی است که از آن استفاده می کنید! مسنجر واتس اپ تا به امروز محبوب ترین مسنجر جهانی است که میلیاردها نفر از سراسر جهان را به سمت خودش کشانده است!',
        'https://play.google.com/store/apps/details?id=com.whatsapp'),
    AppModel(
        'Dolphin Browser',
        'assets/icons/dolph.png',
        'Dolphin Browser - Fast, Private & Adblock',
        'یکی از محبوب ترین، پرطرفدارترین و پردانلودترین مرورگرهای وب اندروید می باشد که تا کنون بیش از ۱۰۰ میلیون بار توسط کاربران اندرویدی سراسر جهان از مارکت اندروید دریافت شده است! این مرورگر ساده، صفحات وب را با سرعت بالا و به زیباترین شکل ممکن به نمایش می گذارد و تجربه ی یک وبگردی جذاب را در اسمارت فون شما به ارمغان می آورد! همانطور که از اسم برنامه نیز مشخص است این مرورگر در گوگل پلی توانسته لقب بهترین مرورگر اندروید را از ان خودش نماید به گونه ای که با ان قادر خواهید بود صفحات وب را با سرعتی بسیار بالا بارگزاری کنید، ویژگی های برنامه چون مسدود کننده تبلیغات اینترنتی مزاحم، پشتیبانی کامل از صفحات وب اچ تی ام ال ۵، پشتیبانی کامل از ادوبی فلش پلیر، امکان وبگردی به صورت مخفی، دانلودمنیجر عالی برای دریافت بدون مشکل فایل ها، دارا بودن پلاگین های مختلف و کاربردی، پشتیبانی از Gestures و غیره بدون شک شما را از داشتن یک مرورگر کامل و بی نقص بی نیاز می سازد. این مرورگر وب برروی همه گوشی ها و تبلت های با صفحه نمایش بزرگ و کوچک بدون هیچ مشکلی نصب و اجرا می شود و می توانید از تمامی قابلیت هایش به رایگان بهره ببرید.',
        'https://play.google.com/store/apps/details?id=mobi.mgeek.TunnyBrowser'),
    AppModel(
        'RAR',
        'assets/icons/rar.png',
        'RAR for Android',
        'برنامه پر کاربرد اندروید جهت باز کردن فایل فشرده با فرمت های RAR, ZIP, TAR, GZ, BZ2, XZ, 7z, ISO, ARJ و یا ساخت فایل فشرده با فرمت zip و rar میباشد. برنامه RAR مانند نسخه ویندوز شامل بیشتر امکانات کاربردی نرم افزار میباشد که مهمترین آن تعمیر فایل فشرده و باز کردن فایل هایی فشرده که دارای پسورد هستند میباشد. ',
        'https://play.google.com/store/apps/details?id=com.rarlab.rar'),
    AppModel(
        'CM Browser',
        'assets/icons/cm.png',
        'CM Browser - Ad Blocker , Fast Download , Privacy',
        'یک مرورگر فوق العاده زیبا و کلاسیک با محیطی کاربری بسیار تمیز از گروه برنامه نویسی Cheetah Mobile Incorporation خالق اپلیکیشن معروف Clean Master مخصوص سیستم عامل اندروید می باشد که تنها با دارا بودن حجمی معادل ۳ مگابایت بهترین مرورگر اندرویدی را در دستگاه شما به ارمغان می آورد! بله این مرورگر کم حجم با بارگزاری بسیار سریع و فوق العاده ی سایت ها، نمایش تمامی وبلاگ ها و وبسایت ها در زیباترین شکل ممکن و دارا بودن یک آنتی ویروس اختصاصی فوق العاده قدرتمند برای حفظ حریم خصوصی شما در اینترنت تجربه ی بهترین و پرسرعت ترین نرم افزار مرورگر را در اسمارت فون و یا تبلت اندرویدیتان به ارمغان خواهد آورد!',
        'https://play.google.com/store/apps/details?id=com.cm.browser.download.fastdwon'),
    AppModel(
        'Nova Launcher',
        'assets/icons/nova.png',
        'Nova Launcher',
        'یکی از زیباترین، حرفه ای ترین و قدیمی ترین لانچرهای اندرویدی است که استودیوی TeslaCoil Software چند سالی است که به صورت حرفه ای برروی آن کار میکند،که یکی از برترین و بهترین لانچرها به شمار می رود و محبوبیت آن را می توان به امکان شخصی سازی واقعا بالای آن نسبت داد! با نصب این لانچر برروی دستگاه اندرویدی خود می تواند بهترین جایگزین صفحه ی خانگی را به اسمارت فون خود هدیه دهید! این لانچر فوق العاده، امکان شخصی سازی اینترفیس گوشی را به شما خواهد داد و قادر خواهید بود تغییرات گرافیکی و کم نظیری را در همه بخش ها اعمال کنید. به طور کلی اگر از افرادی هستید که از اینترفیس تکراری دستگاهتان خسته شده اید و به تنوع نیاز دارید و به دنیال یکی از شیک ترین و پرامکانات ترین لانچرهای اندرویدی می گردید همین الان بدون درنگ به سمت نسخه پرایم Nova Launcher که برای دانلود قرار داده شده بروید چرا که تحت هیچ شرایطی از دانلود خود پشیمان نخواهید شد و این لانچر نظر شما را به خودش جلب خواهد نمود.',
        'https://play.google.com/store/apps/details?id=com.teslacoilsw.launcher'),
    AppModel(
        'Photo Lab',
        'assets/icons/photolab.png',
        'Photo Lab Picture Editor: face effects, art frames',
        'اگر بخواهیم یکی از قدرتمندترین، پرطرفدارترین و بهترین برنامه ویرایش افکت گذاری عکس را برای سیستم عامل اندروید معرفی کنیم که با دارا بودن امکانات بی نظیر شما را متعجب سازد بدون شک اپلیکیشن Pho.to Lab PRO این شایستگی را دارد که از آن به عنوان قدرتمندترین برنامه ی ویرایش تصویر یاد شود! این نرم افزار با در اختیار قرار دادن یک آزمایشگاه عکس شگفت انگیز شما را قادر می سازد که عکس هایی خلاق را ایجاد کنید و از میان صدها افکت، فریم و استایل به دلخواه برروی عکس هایتان اعمال کنید. دوست دارید عکس های خود و یا دوستانتان را به کاریکاتور تبدیل کنید؟! آیا مایلید که عکس انسان را به حیوانات مختلف مونتاژ بزنید !؟ آیا می خواهید کارت پستال های کم نظیر و فوق العاده زیبا و حرفه ای را بدون هیچ دانش خاصی طراحی کنید و برای دوستانتان بفرستید !؟ بله، پس اپلیکیشن Pho.to Lab مخصوص شما طراحی شده است که با داشتن آن بتوانید تجربه ی بهترین فوتو ادیتور را در اندرویدفون خود تجربه کنید!',
        'https://play.google.com/store/apps/details?id=vsin.t16_funny_photo'),
    AppModel(
        'Emras | امراس',
        'assets/icons/emras.png',
        'Emras | امراس',
        'برنامه امراس برای فراهم نمودن اسانی برای مشترکین شرکت های مخابراتی افغانستان میباشد.با این برنامه شما میتوانید به اسانی از بسته های شرکتهای مخابراتی باخبر و انها را فعال یا غیرفعال سازید.معلومات این برنامه از سایت های رسمی شرکت های مخابراتی گرفته شده است.این برنامه هیج وابستگی به کدام شرکت مخابراتی ندارد',
        'https://play.google.com/store/apps/details?id=com.afghanbrandz.afghanbrandz'),
    AppModel(
        'Battery Saver DU',
        'assets/icons/du.png',
        'Battery Saver DU - Life Saver & DU Battery Charger',
        'اگر شما نیز از افرادی هستید که باتری اسمارت فون و یا تبلتتان زمان بسیار محدودی شارژ را نگه می دارد پیشنهاد می دهیم با ما همراه باشید تا یکی دیگر از قدرتمندترین و بهترین اپلیکیشن های مدیریت مصرف باتری را به شما معرفی نماییم و با داشتن آن برروی موبایل خود تا ۷۰ درصد در مصرف باتری صرفه جویی نمایید! تا به این لحظه ده ها مورد از برترین برنامه های مدیریت مصرف باتری را برای شما معرفی نموده ایم که از آن ها می توان به مواردی همچون GO Battery Saver، GO Power Master ، Battery Booster، One Power Guard Easy Battery Saver، ۲x Battery Pro – Battery Saver، Deep Sleep Battery Saver اشاره کرد و اما امروز قصد معرفی یکی از محبوب ترین برنامه های مدیریت باتری با نام DU Battery Saver – Battery Charger & Battery Life Full Pro Unlocked را داریم که استقبال بسیار خوبی از آن صورت گرفته و با ده ها هزار دانلود از گوگل پلی دارای امتیاز ۴٫۶ از ۵٫۰ می باشد که نسبت به اپلیکیشن های معرفی شده و رقیب خود یک سر و گردن بالاتر بوده و آن را به کاربرانی که به دنبال یک اپلیکیشن مدیریت باتری عالی هستیند پیشنهاد می هیم! این نرم افزار به صورت کاملا حرفه ای گامی اساسی در زمینه ی بهینه سازی باتری موبایل شما برمیدارد و با کارهای متعدد به طرز چشمگیری مصرف باتری گوشیتان را کاهش خواهد داد!',
        'https://play.google.com/store/apps/details?id=com.charger.faster.chargdu'),
    AppModel(
        'Viva Video Editor',
        'assets/icons/viva.png',
        'Viva Video Editor - Video Maker with Music',
        'نرم افزاری پرطرفدار و عالی در زمینه ی فیلمبرداری و دوربین از استودیوی برنامه سازی QuVideo برای اندروید است که در دو نسخه رایگان و پولی عرضه شده و امروز قصد معرفی نسخه پولی (Donate) آن را داریم که با قیمت ۳٫۹۹ دلار در مارکت بزرگ گوگل به فروشی می رود و تا به امروز بیش از ۵۰۰ هزار بار توسط کاربران اندرویدی سراسر جهان خریداری شده و از محبوب ترین ها به شمار می رود. شاید شما نیز از کاربرانی باشید که دوست داشته باشید ویدئوهایی را که میگیرید با بالاترین کیفیت ممکن باشد و یا افکت هایی خارق العاده را برروی آن ها اعمال کنید و به گونه ای بسیار حرفه ای و جذاب ویدئوها را جلوه دهید، نرم افزار فیلمبرداری VivaVideo Pro: Video Editor با دارا بودن ده ها قابلیت فوق العاده به شما این اطمینان را می دهد که بهترین برنامه ی فیلمبرداری از لحظات را در اندرویدفون شما به ارمغان بیاورد! شاید با خواندن توضیحاتی از برنامه VivaVideo Pro: Video Editor فک کنید که برنامه فوق نمیتواند نیازهای شما را برآورده سازد اما ویژگی های برنامه را که ببینید بدون شک مجذوب آن خواهید شد و به هیچ وجه نخواهید توانست از ان دست بکشید و ما ان را به شما عزیزان پیشنهاد می دهیم!',
        'https://play.google.com/store/apps/details?id=com.vivaindia.videoeditor'),
    AppModel(
        'Photo Grid ',
        'assets/icons/coll.png',
        'Photo Grid & Video Collage Maker - PhotoGrid 2020',
        'یک نرم افزار عالی و پرطرفدار با بیش از ۱۰۰ میلیون کاربر از سراسر دنیا از گروه برنامه نویسی RoidApp در زمینه ی ساخت و ایجاد عکس های خارق العاده ی کلاژ مخصوص سیستم عامل اندروید می باشد که رتبه ی یک بهترین برنامه عکاسی در ۱۱ کشور و رتبه ی ۵ را در میان ۴۶ کشور از آن خود نموده است و با استفاده از آن می توانید زیباترین، حرفه ای ترین و جذاب ترین عکس های کلاژ را تهیه نمایید. [همانطور که قبلا هم گفته بودیم: [کلاژ – Collage یک واژه ی فرانسوی است که به فرمی از هنر گفته می شود که از به هم چسباندن و مرتبط ساختن تکه های اشیائی همچون کاعذ، تکه های روزنامه، عکس و غیره بر روی یک سطح پدید می آید و اگر بخواهیم واژه ای فارسی را برای آن انتخاب کنیم می توانیم “چسبانه‌کاری” را برگزینیم.] با استفاده از اپلیکیشن Photo Grid – Collage Maker شما قادر خواهید بود در سریع ترین زمان ممکن با ابزارهایی عالی عکس های موجود در گالری موبایل خود را به همدیگر بچسبانید و یک عکس شبکه ای خارق العاده را بسازید و سپس در صورت تمایل افکت هایی خیره کننده و یا قاب های بسیار زیبا را به آن بیفزایید و در نهایت آن را ذخیره کنید و تجربه بهترین برنامه ساخت کلاژ را در اندرویدفون خود به ارمغان بیاورید.',
        'https://play.google.com/store/apps/details?id=com.gridplus.collagemaker'),
    AppModel(
        'Sleep as Android',
        'assets/icons/sleep.png',
        'Sleep as Android 💤 Sleep cycle smart alarm',
        'یک نرم افزار قدرتمند، پرطرفدار و عالی در زمینه ی بیدار کردن شما و خواب آرام از استودیوی Urbandroid Team مخصوص اندروید است که به صورت رایگان عرضه شده و با بیش از ۱۰ میلیون دریافت از مارکت اندروید در صدر برترین برنامه های خواب راحت قرار دارد! با استفاده از این نرم افزار می توانید تنوعی عالی را در خواب خود ایجاد نمایید به گونه ای که هرروزتان را با یک صدای آرامش بخش همچون پرندگان، دریا و … بیدار شوید! در اصل این نرم افزار علاوه بر داشتن یک ساعت زنگ دار بسیار عالی می تواند چرخه ی خواب شما را بدون هیچگونه کم و کاستی ضبط کند.',
        'https://play.google.com/store/apps/details?id=com.urbandroid.sleep'),
    AppModel(
        'WPS Office',
        'assets/icons/word.png',
        'WPS Office - Free Office Suite for Word,PDF,Excel',
        'نرم افزاری قدرتمند برای کسانی می باشد که به دنبال تجربه جدید در استفاده از برنامه های آفیس در گوشی همراه اندرویدی خود هستند. این برنامه به صورت کاملا رایگان عرضه شده است و با پشتیبانی کامل از زبان فارسی امکان نمایش و ویرایش فرمت های DOC/DOCX/TXT/XLS/XLSX/PPT/PPTX و فرمت PDF را می دهد.',
        'https://play.google.com/store/apps/details?id=cn.wps.moffice_eng'),
    AppModel(
        'Busuu',
        'assets/icons/bussu.png',
        'Busuu: Learn Languages - Spanish, French & More',
        'برنامه جدید و حرفه ای busuu Fast Language Learning را استودیو برنامه سازی busuu Limited برای سیستم عامل اندروید طراحی و در گوگل پلی منتشر کرده است که تا به حال بیش از ۵۰ میلیون نصب کننده داشت و توانسته امتیاز ۴٫۳ را از ۵٫۰ به خود اختصاص دهد. با این برنامه خواهید توانست تا بدون هزینه کردن ۱۱ زبان خارجی را مانند زبان مادری آموزش دیده و در مکان های مورد نیاز استفاده کنید.',
        'https://play.google.com/store/apps/details?id=com.busuu.android.enc'),
    AppModel(
        'Phone Cleaner',
        'assets/icons/power.png',
        'Phone Cleaner- Cache Clean, Android Booster Master',
        'یک ابزار کوچک، سریع و کامل برای گوشی های اندرویدی می باشد که با استفاده از آن امکان افزایش سرعت و پاکسازی گوشی را خواهید داشت. این برنامه قابلیت افزایش سرعت رم، بهینه سازی دستگاه، مدیریت برنامه ها، قفل برنامه و حفظ امنیت را نیز دارا است. با استفاده از این برنامه شما می توانید فضای خالی بیشتری را آزاد کنید، رم را افزایش سرعت دهید، امنیت خودتان را تامین کنید، برنامه های غیر لازم را حذف یا غیر فعال کنید، برنامه ها را قفل کنید و دستگاه خود را به صورتی در بیاورید که تصور شود، همین الان آن را خریده اید!',
        'https://play.google.com/store/apps/details?id=phone.cleaner.speed.booster.cache.clean.android.master'),
    AppModel(
        'Slideshow Maker',
        'assets/icons/slide.png',
        'Slideshow Maker',
        'یکی از قدرتمندترین نرم افزارها در زمینه ساخت اسلایدشو برای گوشی های اندرویدی می باشد که موفق به کسب امتیازات بسیاری بالایی در سایت پلی استور شده است. این برنامه علاوه بر امکان ساخت اسلایدشو همچنین قابلیت ویرایش و زیباسازی تصاویر را نیز به کاربران می دهد.',
        'https://play.google.com/store/apps/details?id=ph.app.slideshowmaker'),
    AppModel(
        'Google Drive',
        'assets/icons/drive.png',
        'Google Drive',
        'یکی از بهترین و برترین سرویس های کمپانی گوگل است که مدتی است شاهد ساخت کلاینت مخصوص اندرویدی این سرویس بی نظیر نیز هستیم . توسط این سرویس یک فضای ابری کاملا اختصاصی برای نگه داری و آپلود و دانلود انواع فایل های مورد نظرتان دقیقا همانند سرویس Dropbox به شما تعلق می گیرد که توسط کلاینت اندرویدی این نرم افزار می توانید به راحتی فایل های خود را بر روی فضای شخصی تان مدیریت کنید .',
        'https://play.google.com/store/apps/details?id=com.google.android.apps.docs'),
    AppModel(
        'Duolingo',
        'assets/icons/dolino.png',
        'Duolingo: Learn English Free',
        'برنامه Duolingo  یک برنامه آموزشی می باشد که شما با استفاده از این برنامه می توانید زبان های دیگر را بصورت کامل یاد بگیرید. با Duolingo یک معلم خصوصی برای یادگیری ۱۰ زبان مختلف جهان را داشته باشید. این برنامه در گوگل پلی در سال های ۲۰۱۳ و ۲۰۱۴ مقام بهترین برنامه آموزش زبان را بدست آورد. Duolingo در سطح های مختلفی تعریف شده است که شما می توانید از سطح پایین کم کم به سطح های بالاتر برسید و بهتر و بهتر زبان را یاد بگیرید.',
        'https://play.google.com/store/apps/details?id=com.duolingo'),
    AppModel(
        'Perfect365',
        'assets/icons/perfect.png',
        'Perfect365: One-Tap Makeover',
        'یک نرم افزار عالی و پرطرفدار با بیش از پنجاه میلیون دریافت از گوگل پلی در زمینه روتوش و ترمیم عکس ها مخصوص سیستم عامل اندروید می باشد که توسط گروه برنامه نویسی ArcSoft توسعه و طراحی گردیده است و با استفاده از آن قادر خواهید بود در محیطی ساده و کلاسیک در سریع ترین زمان ممکن و به صورت حرفه ای لک های موجود در چهره را حذف نمایید و با ابزارهایی کاربردی که در اختیار دارید تنها با چند لمس ساده چهره ی خودتان را زیباتر سازید! اگر به دنبال برنامه ای هستید که با آن بتوانید عکس های خودتان را بهبود ببخشید پیشنهاد ما به شما اپلیکیشن فوق العاده ی Perfect365 می باشد. شما قادر هستید که بر اساس سليقه، مد روز و يا قالب های آماده عکس هایتان را ويرايش و آرايش نمایید و در نهایت عکس ویرایش شده را با یک کلیک در گالری خودتان ذخیره کرده و آن را به اشتراک بگذارید.',
        'https://play.google.com/store/apps/details?id=com.arcsoft.perfect365'),
    AppModel(
        'Facebook',
        'assets/icons/face.png',
        'Facebook',
        'فیسبوک سریع تر از گذشته در کنار دوستان خود باشید. دیدن دوستان حاضر، اشتراک گذاری بروز رسانی ها، عکس ها و ویدئوها، اطلاع از لایک کردن و اظهار نظر دوستان در مورد پست های شما، چت کردن و داشتن کنفرانس گروهی، بازی کردن و استفاده از برنامه های مورد علاقه خود از ویژگی های این برنامه هستند.کمپانی فیسبوک برای راحتی کاربران دارای گوشی های هوشمند نرم افزار رسمی خود را طراحی کرده است تا بتوانند در محیطی آسان به تمامی امکانات این شبکه ی اجتماعی دسترسی داشته باشند و کار با فیسبوک لذت بخش تر از مرورگر توسط آنان صورت بگیرد! امروز قصد معرفی نرم افزار رسمی شبکه اجتماعی فیسبوک با نام Facebook for Android را برای اندروید داریم که کاربران دارای دستگاه های هوشمند اندرویدی با آن می توانند به راحتی به فیسبوک متصل شوند و به صورت همیشگی آنلاین باشند و از تمامی ویژگی های فیسبوک به راحت ترین شکل ممکن بهره ببرند.',
        'https://play.google.com/store/apps/details?id=com.facebook.katana'),
    AppModel(
        'Google Translate',
        'assets/icons/trans.png',
        'Google Translate',
        'به احتمال زیاد همه شما با سایت Google Translate آشنا هستید. سایت Google Translate هم اکنون قدرتمندترین و بهترین منبع موجود به منظور ترجمه رایگان متون از زبان‌های مختلف به زبان‌های مختلف دیگر است. به بیان دیگر Google Translate یک دیکشنری آنلاین است که به بهترین شکل ممکن از پس ترجمه عبارات و جملات بر می‌آید. گوگل همچنان در تلاش است تا قابلیت‌ها و دقت عملکرد Google Translate را بهبود بخشد. مترجم آنلاین گوگل ترنسلیت در حال حاضر از 52 زبان مختلف دنیا پشتیبانی می‌کند و زبان فارسی هم یکی از زبان‌های تحت پشتیبانی آن محسوب می‌شود.',
        'https://play.google.com/store/apps/details?id=com.google.android.apps.translate'),
    AppModel(
        '360 Security',
        'assets/icons/sec.png',
        '360 Security - Antivirus, Booster, Phone Cleaner',
        'آنتی ویروس ۳۶۰ Security دارای ویژگی‌هایی مانند اسکنر برنامه و فایل، بهبود سرعت، قفل برنامه، خنک کننده پردازنده، ضد سرقت و غیره است. همچنین این برنامه به غیر از مسائل امنیتی ویژگی پاک سازی حافظه از فایل‌های بیهوده و کش، بهینه سازی سرعت گوشی و فیلتر تماس و پیامک را دارا است.',
        'https://play.google.com/store/apps/details?id=com.total.security.anti'),
    AppModel(
        'Es File Explorer',
        'assets/icons/es.png',
        'Es File Explorer - File Manager Android 2020',
        'یکی از محبوب ترین برنامه های مدیریت فایل Android با تمام ویژگی های لازم است. آن را با یک تجزیه و تحلیل فضایی به شما کمک کند آزاد کردن فضای بر روی دستگاه شما. اشتراک گذاری رسانه ها با سایر کاربران ES File Explorer از طریق WiFi آسان است. ES File Manager همچنین همراه با یک مدیر برنامه که در آن شما می توانید از برنامه های پشتیبان گیری یا حذف پشتیبان استفاده کنید. شما حتی می توانید برنامه های سیستم را با امتیازات ریشه حذف کنید. این ویژگی “Root Explorer” ویژگی های زیادی را برای دستگاه های ریشه دار باز می کند. با این حال، برنامه نشان می دهد بسیاری از تبلیغات مزاحم و با هدف در قدرت کاربران است. برای کاربرانی که ریشه نداشته اند و نیازی به امکانات پیشرفته ندارند، لیست بهترین برنامه های Android File Manager مطمئنا مفید خواهد بود.',
        'https://play.google.com/store/apps/details?id=com.filemanager.lnapp'),
    AppModel(
        'Doo-B | دو بی‎',
        'assets/icons/doob.png',
        'Doo-B | دو بی',
        'دیگر لازم نیست برای خرید و فروش وسایل دست دوم خود تا بازار به زحمت شوید. بزرگترین بازار انلاین برای شما. حالا شما به راحتی میتوانید با استفاده از برنامه دو "بی" از خرید و فروش وسایل دست دوم و جدید شما گرفته تا بست های وظایف و سرویس ها را انجام بدهید',
        'https://play.google.com/store/apps/details?id=com.dooobapp.doobapp'),
    AppModel(
        'InShot',
        'assets/icons/inshot.png',
        'Video Editor & Video Maker - InShot',
        'برنامه حرفه ای و کاربردی اندروید جهت ویرایش ویدیو ( افزودن افکت ، برش و ... ) و عکس ( ویرایش و اصلاح تصاویر ) میباشد. توسط برنامه InShot Video & Photo Editor میتوانید تصاویر و ویدیوهای خود را با ابعاد کامل در اینستاگرام ارسال کنید. یکی از محدودیت های موجود در اینستاگرام ارسال تصاویر در فریم مربعی میباشد و امکان ارسال عکس و ویدئو بصورت افقی نیست.',
        'https://play.google.com/store/apps/details?id=com.camerasideas.instashot'),
  ];
}
// MenuItemModel([],''),
// ItemModel(null,null,null),
//AppModel('','','','',''),
